{
  "title": "AdaEvolve: Adaptive LLM Driven Zeroth-Order Optimization",
  "link": "https://arxiv.org/abs/2602.20133v1",
  "published": "2026-02-23T18:45:31Z",
  "updated": "2026-02-23T18:45:31Z",
  "summary": "The paradigm of automated program generation is shifting from one-shot generation to inference-time search, where Large Language Models (LLMs) function as semantic mutation operators within evolutionary loops. While effective, these systems are currently governed by static schedules that fail to account for the non-stationary dynamics of the search process. This rigidity results in substantial computational waste, as resources are indiscriminately allocated to stagnating populations while promising frontiers remain under-exploited. We introduce AdaEvolve, a framework that reformulates LLM-driven evolution as a hierarchical adaptive optimization problem. AdaEvolve uses an \"accumulated improvement signal\" to unify decisions across three levels: Local Adaptation, which dynamically modulates the exploration intensity within a population of solution candidates; Global Adaptation, which routes the global resource budget via bandit-based scheduling across different solution candidate populations; and Meta-Guidance which generates novel solution tactics based on the previously generated solutions and their corresponding improvements when the progress stalls. We demonstrate that AdaEvolve consistently outperforms the open-sourced baselines across 185 different open-ended optimization problems including combinatorial, systems optimization and algorithm design problems.",
  "id": "http://arxiv.org/abs/2602.20133v1",
  "authors": [
    "Mert Cemri",
    "Shubham Agrawal",
    "Akshat Gupta",
    "Shu Liu",
    "Audrey Cheng",
    "Qiuyang Mang",
    "Ashwin Naren",
    "Lutfi Eren Erdogan",
    "Koushik Sen",
    "Matei Zaharia",
    "Alex Dimakis",
    "Ion Stoica"
  ],
  "categories": [
    "cs.NE",
    "cs.AI",
    "cs.CL"
  ],
  "pdf_link": "https://arxiv.org/pdf/2602.20133v1"
}