{
  "title": "AI Doesn’t Reduce Work—It Intensifies It",
  "link": "https://simonwillison.net/2026/Feb/9/ai-intensifies-work/#atom-everything",
  "published": "2026-02-09T16:43:07+00:00",
  "summary": "<p><strong><a href=\"https://hbr.org/2026/02/ai-doesnt-reduce-work-it-intensifies-it\">AI Doesn’t Reduce Work—It Intensifies It</a></strong></p>\nAruna Ranganathan and Xingqi Maggie Ye from Berkeley Haas School of Business report initial findings in the HBR from their April to December 2025 study of 200 employees at a \"U.S.-based technology company\".</p>\n<p>This captures an effect I've been observing in my own work with LLMs: the productivity boost these things can provide is <em>exhausting</em>.</p>\n<blockquote>\n<p>AI introduced a new rhythm in which workers managed several active threads at once: manually writing code while AI generated an alternative version, running multiple agents in parallel, or reviving long-deferred tasks because AI could “handle them” in the background. They did this, in part, because they felt they had a “partner” that could help them move through their workload.</p>\n<p>While this sense of having a “partner” enabled a feeling of momentum, the reality was a continual switching of attention, frequent checking of AI outputs, and a growing number of open tasks. This created cognitive load and a sense of always juggling, even as the work felt productive.</p>\n</blockquote>\n<p>I'm frequently finding myself with work on two or three projects running parallel. I can get <em>so much done</em>, but after just an hour or two my mental energy for the day feels almost entirely depleted.</p>\n<p>I've had conversations with people recently who are losing sleep because they're finding building yet another feature with \"just one more prompt\" irresistible.</p>\n<p>The HBR piece calls for organizations to build an \"AI practice\" that structures how AI is used to help avoid burnout and counter effects that \"make it harder for organizations to distinguish genuine productivity gains from unsustainable intensity\".</p>\n<p>I think we've just disrupted decades of existing intuition about sustainable working practices. It's going to take a while and some discipline to find a good new balance.\n\n    <p><small></small>Via <a href=\"https://news.ycombinator.com/item?id=46945755\">Hacker News</a></small></p>\n\n\n    <p>Tags: <a href=\"https://simonwillison.net/tags/careers\">careers</a>, <a href=\"https://simonwillison.net/tags/ai\">ai</a>, <a href=\"https://simonwillison.net/tags/generative-ai\">generative-ai</a>, <a href=\"https://simonwillison.net/tags/llms\">llms</a>, <a href=\"https://simonwillison.net/tags/ai-assisted-programming\">ai-assisted-programming</a>, <a href=\"https://simonwillison.net/tags/ai-ethics\">ai-ethics</a></p>",
  "id": "https://simonwillison.net/2026/Feb/9/ai-intensifies-work/#atom-everything"
}