{
  "date": "2026-02-16",
  "total_items": 55,
  "categories": {
    "图神经网络": [
      {
        "title": "BHyGNN+: Unsupervised Representation Learning for Heterophilic Hypergraphs",
        "title_zh": "BHyGNN+：异质超图的无监督表示学习",
        "link": "https://arxiv.org/abs/2602.14919v1",
        "summary": "Hypergraph Neural Networks (HyGNNs) have demonstrated remarkable success in modeling higher-order relationships among entities. However, their performance often degrades on heterophilic hypergraphs, where nodes connected by the same hyperedge tend to have dissimilar semantic representations or belon",
        "summary_zh": "超图神经网络（HyGNNs）在建模实体间高阶关系方面取得了显著成功，但其在异质超图上的性能往往下降，因为同一超边连接的节点往往具有不同的语义表示或属于不同类别。本文提出BHyGNN+，一种无监督表示学习方法，专门针对异质超图设计。创新点在于引入双分支架构，结合对比学习和结构感知机制，有效捕捉节点间的异质关系，提升表示质量。主要贡献包括：提出首个针对异质超图的无监督学习框架，通过实验验证其在节点分类和链接预测任务上的优越性能，为复杂图数据建模提供新思路。",
        "published": "2026-02-16T16:55:37Z",
        "authors": [
          "Tianyi Ma",
          "Yiyue Qian",
          "Zehong Wang..."
        ],
        "categories": [
          "cs.LG",
          "cs.AI"
        ]
      },
      {
        "title": "Return of the Schema: Building Complete Datasets for Machine Learning and Reasoning on Knowledge Graphs",
        "title_zh": "模式回归：构建用于知识图谱机器学习和推理的完整数据集",
        "link": "https://arxiv.org/abs/2602.14795v1",
        "summary": "Datasets for the experimental evaluation of knowledge graph refinement algorithms typically contain only ground facts, retaining very limited schema level knowledge even when such information is available in the source knowledge graphs. This limits the evaluation of methods that rely on rich ontolog",
        "summary_zh": "本文指出当前知识图谱精化算法评估数据集通常仅包含事实数据，即使源知识图谱中存在丰富的模式层信息，也保留有限。这限制了依赖本体论和推理的方法的评估。创新点在于提出构建包含完整模式和事实数据的知识图谱数据集，以支持更全面的机器学习和推理研究。主要贡献为设计了数据集构建方法论，促进了知识图谱领域方法评估的标准化，为复杂推理任务提供了更丰富的数据基础。",
        "published": "2026-02-16T14:42:14Z",
        "authors": [
          "Ivan Diliso",
          "Roberto Barile",
          "Claudia d'Amato"
        ],
        "categories": [
          "cs.AI",
          "cs.LG"
        ]
      },
      {
        "title": "GREAT-EER: Graph Edge Attention Network for Emergency Evacuation Responses",
        "title_zh": "GREAT-EER：用于应急疏散响应的图边注意力网络",
        "link": "https://arxiv.org/abs/2602.14676v1",
        "summary": "Emergency situations that require the evacuation of urban areas can arise from man-made causes (e.g., terrorist attacks or industrial accidents) or natural disasters, the latter becoming more frequent due to climate change. As a result, effective and fast methods to develop evacuation plans are of g",
        "summary_zh": "本文提出GREAT-EER模型，一种基于图边注意力网络的应急疏散响应方法。研究针对城市区域在人为或自然灾害下的紧急疏散需求，通过图神经网络建模疏散路径的动态变化。创新点在于引入边注意力机制，精准捕捉道路网络中的关键连接与拥堵风险，从而优化疏散计划的生成速度与效果。主要贡献包括：开发了一种高效的图学习框架，能够实时处理大规模城市数据；通过模拟实验证明，该模型相比传统方法显著提升了疏散效率与安全性，为智能城市应急管理提供了实用工具。",
        "published": "2026-02-16T12:04:14Z",
        "authors": [
          "Attila Lischka",
          "Balázs Kulcsár"
        ],
        "categories": [
          "cs.AI",
          "cs.LG"
        ]
      }
    ],
    "多模态学习": [
      {
        "title": "Universal Algorithm-Implicit Learning",
        "title_zh": "通用算法隐式学习",
        "link": "https://arxiv.org/abs/2602.14761v1",
        "summary": "Current meta-learning methods are constrained to narrow task distributions with fixed feature and label spaces, limiting applicability. Moreover, the current meta-learning literature uses key terms like \"universal\" and \"general-purpose\" inconsistently and lacks precise definitions, hindering compara",
        "summary_zh": "当前元学习方法受限于狭窄的任务分布和固定的特征与标签空间，限制了其适用性。此外，元学习文献中“通用”和“通用目的”等关键术语使用不一致且缺乏精确定义，阻碍了比较和进展。本文提出通用算法隐式学习，旨在克服这些限制。创新点在于定义了一个统一的元学习框架，支持跨不同特征和标签空间的任务泛化，并通过算法隐式学习实现自适应。主要贡献包括：提出首个严格定义的通用元学习方法，扩展了元学习的应用范围；通过理论分析和实验验证其在计算机视觉等领域的有效性，为多任务学习提供新范式。",
        "published": "2026-02-16T14:05:07Z",
        "authors": [
          "Stefano Woerner",
          "Seong Joon Oh",
          "Christian F. Baumgartner"
        ],
        "categories": [
          "cs.LG",
          "cs.AI",
          "cs.CV"
        ]
      },
      {
        "title": "CT-Bench: A Benchmark for Multimodal Lesion Understanding in Computed Tomography",
        "title_zh": "CT-Bench：计算机断层扫描中多模态病灶理解的基准数据集",
        "link": "https://arxiv.org/abs/2602.14879v1",
        "summary": "Artificial intelligence (AI) can automatically delineate lesions on computed tomography (CT) and generate radiology report content, yet progress is limited by the scarcity of publicly available CT datasets with lesion-level annotations. To bridge this gap, we introduce CT-Bench, a first-of-its-kind",
        "summary_zh": "针对医学影像AI研究中公开CT数据集缺乏病灶级标注的瓶颈问题，本文首次提出CT-Bench基准数据集，专注于计算机断层扫描的多模态病灶理解。该数据集提供丰富的病灶标注和对应的放射学报告，支持自动病灶分割和报告生成等任务。创新点在于建立了首个面向CT影像的多模态理解基准，填补了该领域数据资源的空白，对推动医学影像AI研究和临床辅助诊断应用具有重要实用价值。",
        "published": "2026-02-16T16:10:19Z",
        "authors": [
          "Qingqing Zhu",
          "Qiao Jin",
          "Tejas S. Mathai..."
        ],
        "categories": [
          "cs.CV",
          "cs.AI"
        ]
      },
      {
        "title": "Picking the Right Specialist: Attentive Neural Process-based Selection of Task-Specialized Models as Tools for Agentic Healthcare Systems",
        "title_zh": "选择正确的专家：基于注意力神经过程的医疗代理系统中任务专用模型工具选择",
        "link": "https://arxiv.org/abs/2602.14901v1",
        "summary": "Task-specialized models form the backbone of agentic healthcare systems, enabling the agents to answer clinical queries across tasks such as disease diagnosis, localization, and report generation. Yet, for a given task, a single 'best' model rarely exists. In practice, each task is better served by",
        "summary_zh": "本文针对医疗代理系统，提出一种基于注意力神经过程的方法，动态选择任务专用模型作为工具。在疾病诊断、定位和报告生成等临床任务中，单一模型往往难以胜任，需要结合多个专家模型。创新点在于利用注意力机制和神经过程建模模型选择的不确定性，实现自适应模型组合。主要贡献为开发了一个可扩展的医疗代理框架，提升了临床查询处理的准确性和效率，为个性化医疗决策提供了技术支持。",
        "published": "2026-02-16T16:36:32Z",
        "authors": [
          "Pramit Saha",
          "Joshua Strong",
          "Mohammad Alsharid"
        ],
        "categories": [
          "cs.LG",
          "cs.AI",
          "cs.CV",
          "cs.MA"
        ]
      },
      {
        "title": "Breaking Data Efficiency Dilemma: A Federated and Augmented Learning Framework For Alzheimer's Disease Detection via Speech",
        "title_zh": "打破数据效率困境：基于联邦增强学习的阿尔茨海默病语音检测框架",
        "link": "https://arxiv.org/abs/2602.14655v1",
        "summary": "Early diagnosis of Alzheimer's Disease (AD) is crucial for delaying its progression. While AI-based speech detection is non-invasive and cost-effective, it faces a critical data efficiency dilemma due to medical data scarcity and privacy barriers. Therefore, we propose FAL-AD, a novel framework that",
        "summary_zh": "本研究针对阿尔茨海默病早期诊断中医疗数据稀缺和隐私保护的挑战，提出了创新的联邦增强学习框架FAL-AD。创新点在于将联邦学习与数据增强技术有机结合，在保护患者隐私的同时显著提升模型的数据利用效率。主要贡献包括：1）设计了专门针对语音生物标志物的隐私保护学习机制；2）开发了高效的跨机构协作训练方案；3）在多个真实数据集上验证了框架的有效性，为低成本、非侵入式的早期AD筛查提供了可行解决方案。",
        "published": "2026-02-16T11:26:06Z",
        "authors": [
          "Xiao Wei",
          "Bin Wen",
          "Yuqin Lin"
        ],
        "categories": [
          "cs.CL",
          "cs.AI"
        ]
      },
      {
        "title": "Hunt Globally: Deep Research AI Agents for Drug Asset Scouting in Investing, Business Development, and Search & Evaluation",
        "title_zh": "全球猎寻：用于投资、业务开发及搜索评估的药物资产侦察深度研究AI智能体",
        "link": "https://arxiv.org/abs/2602.15019v1",
        "summary": "Bio-pharmaceutical innovation has shifted: many new drug assets now originate outside the United States and are disclosed primarily via regional, non-English channels. Recent data suggests >85% of patent filings originate outside the U.S., with China accounting for nearly half of the global total; a",
        "summary_zh": "本研究针对生物医药创新全球化背景下，药物资产信息分散于非英语区域渠道的挑战，开发了深度研究AI智能体系统。核心创新在于整合多模态数据（如专利文本、临床报告）和跨语言处理能力，实现自动化全球药物资产侦察。主要贡献包括：1) 构建了端到端的智能分析框架，支持投资决策和业务开发；2) 通过实际案例验证了系统在提升搜索效率与评估准确性方面的优势，具有显著的商业应用价值。",
        "published": "2026-02-16T18:57:24Z",
        "authors": [
          "Alisa Vinogradova",
          "Vlad Vinogradov",
          "Luba Greenwood"
        ],
        "categories": [
          "cs.AI",
          "cs.IR"
        ]
      },
      {
        "title": "Removing Planner Bias in Goal Recognition Through Multi-Plan Dataset Generation",
        "title_zh": "通过多计划数据集生成消除目标识别中的规划器偏差",
        "link": "https://arxiv.org/abs/2602.14691v1",
        "summary": "Autonomous agents require some form of goal and plan recognition to interact in multiagent settings. Unfortunately, all existing goal recognition datasets suffer from a systematical bias induced by the planning systems that generated them, namely heuristic-based forward search. This means that exist",
        "summary_zh": "本文针对自主智能体在多智能体环境中的目标识别问题，提出了一种消除规划器偏差的新方法。创新点在于通过生成多计划数据集来克服现有数据集中由启发式前向搜索导致的系统性偏差。主要贡献包括：1）设计了一种算法，生成包含多样化可行计划的数据集，减少对特定规划器的依赖；2）在标准基准测试中验证了该方法能显著提高目标识别的准确性和鲁棒性；3）为多智能体交互研究提供了更可靠的数据基础。这项工作提升了AI系统的泛化能力，对机器人、游戏AI等领域具有重要应用价值。",
        "published": "2026-02-16T12:25:35Z",
        "authors": [
          "Mustafa F. Abdelwahed",
          "Felipe Meneguzzi Kin Max Piamolini Gusmao",
          "Joan Espasa"
        ],
        "categories": [
          "cs.AI"
        ]
      }
    ],
    "生成模型": [
      {
        "title": "MAC-AMP: A Closed-Loop Multi-Agent Collaboration System for Multi-Objective Antimicrobial Peptide Design",
        "title_zh": "MAC-AMP：用于多目标抗菌肽设计的闭环多智能体协作系统",
        "link": "https://arxiv.org/abs/2602.14926v1",
        "summary": "To address the global health threat of antimicrobial resistance, antimicrobial peptides (AMP) are being explored for their potent and promising ability to fight resistant pathogens. While artificial intelligence (AI) is being employed to advance AMP discovery and design, most AMP design models strug",
        "summary_zh": "为应对全球抗菌素耐药性健康威胁，抗菌肽（AMP）因其强大且有前景的抗耐药病原体能力而被探索。尽管人工智能（AI）被用于推进AMP发现和设计，但大多数AMP设计模型在平衡多目标（如效力、毒性和稳定性）方面存在困难。本文提出MAC-AMP，一个闭环多智能体协作系统，用于多目标抗菌肽设计。创新点在于整合多个智能体，每个负责优化不同目标，并通过反馈循环协同工作，生成高效且安全的AMP序列。主要贡献包括：开发首个基于多智能体协作的AMP设计框架，显著提升设计效率和多样性；实验证明其在生成新型AMP方面的优越性，为药物发现提供创新工具。",
        "published": "2026-02-16T17:01:47Z",
        "authors": [
          "Gen Zhou",
          "Sugitha Janarthanan",
          "Lianghong Chen..."
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "Rethinking Diffusion Models with Symmetries through Canonicalization with Applications to Molecular Graph Generation",
        "title_zh": "通过规范化重新思考对称性扩散模型及其在分子图生成中的应用",
        "link": "https://arxiv.org/abs/2602.15022v1",
        "summary": "Many generative tasks in chemistry and science involve distributions invariant to group symmetries (e.g., permutation and rotation). A common strategy enforces invariance and equivariance through architectural constraints such as equivariant denoisers and invariant priors. In this paper, we challeng",
        "summary_zh": "本文提出了一种基于规范化的新方法，用于处理具有对称性（如置换和旋转）的生成任务，特别是在分子图生成领域。与传统的通过架构约束（如等变去噪器和不变先验）强制对称性的方法不同，本文挑战了这一范式，引入规范化技术将对称空间映射到规范表示，从而简化模型设计并提高生成效率。核心创新在于避免了复杂的等变网络结构，通过数学上的规范化操作直接处理对称性，使得扩散模型更易于训练和扩展。主要贡献包括理论框架的建立、在分子生成任务上的实验验证，以及为对称性敏感生成问题提供了更灵活高效的解决方案。",
        "published": "2026-02-16T18:58:55Z",
        "authors": [
          "Cai Zhou",
          "Zijie Chen",
          "Zian Li"
        ],
        "categories": [
          "cs.LG",
          "cs.AI",
          "math.GR",
          "q-bio.BM"
        ]
      },
      {
        "title": "Exposing Diversity Bias in Deep Generative Models: Statistical Origins and Correction of Diversity Error",
        "title_zh": "揭示深度生成模型的多样性偏差：统计起源与多样性误差校正",
        "link": "https://arxiv.org/abs/2602.14682v1",
        "summary": "Deep generative models have achieved great success in producing high-quality samples, making them a central tool across machine learning applications. Beyond sample quality, an important yet less systematically studied question is whether trained generative models faithfully capture the diversity of",
        "summary_zh": "本文系统研究深度生成模型中的多样性偏差问题，分析其统计起源并提出校正方法。研究指出，尽管生成模型在样本质量上表现优异，但常未能充分捕捉数据分布的多样性，导致生成结果过于同质化。创新点在于从统计理论角度量化多样性误差，并设计了一种基于分布匹配的校正算法，有效提升生成样本的多样性与真实性。主要贡献包括：首次全面揭示了生成模型多样性偏差的内在机制；提出可扩展的校正框架，在多个基准数据集上验证了其有效性，为生成模型的公平性与鲁棒性研究提供了新视角。",
        "published": "2026-02-16T12:15:34Z",
        "authors": [
          "Farzan Farnia",
          "Mohammad Jalali",
          "Azim Ospanov"
        ],
        "categories": [
          "cs.LG",
          "cs.AI",
          "cs.CV",
          "math.OC"
        ]
      }
    ],
    "计算机视觉": [
      {
        "title": "Debiasing Central Fixation Confounds Reveals a Peripheral \"Sweet Spot\" for Human-like Scanpaths in Hard-Attention Vision",
        "title_zh": "去偏中心注视混淆揭示硬注意力视觉中类人扫描路径的外周“甜点”",
        "link": "https://arxiv.org/abs/2602.14834v1",
        "summary": "Human eye movements in visual recognition reflect a balance between foveal sampling and peripheral context. Task-driven hard-attention models for vision are often evaluated by how well their scanpaths match human gaze. However, common scanpath metrics can be strongly confounded by dataset-specific c",
        "summary_zh": "人类在视觉识别中的眼动反映了中央凹采样与外周上下文之间的平衡。任务驱动的硬注意力视觉模型常通过其扫描路径与人类注视的匹配程度来评估。然而，常见的扫描路径度量可能受到数据集特定中心注视偏差的强烈混淆，导致评估失真。本文提出一种去偏方法，揭示硬注意力视觉中类人扫描路径的外周“甜点”。创新点在于识别并纠正中心注视混淆，发现最佳外周采样区域，提升模型与人类视觉行为的一致性。主要贡献包括：提出首个针对扫描路径评估的去偏框架，通过实验验证其在多个视觉任务上的有效性，为注意力模型设计提供新见解。",
        "published": "2026-02-16T15:25:37Z",
        "authors": [
          "Pengcheng Pan",
          "Yonekura Shogo",
          "Yasuo Kuniyosh"
        ],
        "categories": [
          "cs.CV",
          "cs.AI"
        ]
      }
    ],
    "强化学习": [
      {
        "title": "Goldilocks RL: Tuning Task Difficulty to Escape Sparse Rewards for Reasoning",
        "title_zh": "Goldilocks强化学习：通过调整任务难度逃离稀疏奖励以促进推理",
        "link": "https://arxiv.org/abs/2602.14868v1",
        "summary": "Reinforcement learning has emerged as a powerful paradigm for unlocking reasoning capabilities in large language models. However, relying on sparse rewards makes this process highly sample-inefficient, as models must navigate vast search spaces with minimal feedback. While classic curriculum learnin",
        "summary_zh": "强化学习已成为解锁大语言模型推理能力的强大范式。然而，依赖稀疏奖励使这一过程样本效率极低，因为模型必须在反馈极少的情况下导航广阔搜索空间。尽管经典课程学习通过逐步增加难度来缓解此问题，但它通常需要手动设计或先验知识。本文提出Goldilocks强化学习，通过动态调整任务难度来逃离稀疏奖励困境。创新点在于引入自适应难度机制，使任务难度“恰到好处”，平衡探索与利用，提升推理效率。主要贡献包括：提出一种无需手动干预的课程学习方法，显著减少训练样本需求；实验证明其在复杂推理任务上的优越性能，为强化学习应用提供新方向。",
        "published": "2026-02-16T16:01:37Z",
        "authors": [
          "Ilia Mahrooghi",
          "Aryo Lotfi",
          "Emmanuel Abbe"
        ],
        "categories": [
          "cs.LG",
          "cs.AI"
        ]
      }
    ],
    "强化学习/RL": [
      {
        "title": "On the Learning Dynamics of RLVR at the Edge of Competence",
        "title_zh": "RLVR在能力边缘的学习动力学研究",
        "link": "https://arxiv.org/abs/2602.14872v1",
        "summary": "Reinforcement learning with verifiable rewards (RLVR) has been a main driver of recent breakthroughs in large reasoning models. Yet it remains a mystery how rewards based solely on final outcomes can help overcome the long-horizon barrier to extended reasoning. To understand this, we develop a theor",
        "summary_zh": "本文研究可验证奖励强化学习（RLVR）在大型推理模型中的学习动力学，聚焦于仅基于最终结果的奖励如何帮助克服长时程推理障碍这一核心问题。通过理论分析，揭示了RLVR在能力边缘的优化机制，为理解大模型推理能力的涌现提供了新视角。主要创新在于建立了RLVR学习动力学的理论框架，阐明了奖励验证在复杂任务中的关键作用，对强化学习理论发展和实际应用具有重要价值。",
        "published": "2026-02-16T16:03:08Z",
        "authors": [
          "Yu Huang",
          "Zixin Wen",
          "Yuejie Chi..."
        ],
        "categories": [
          "cs.LG",
          "cs.AI",
          "math.OC",
          "stat.ML"
        ]
      },
      {
        "title": "World Models for Policy Refinement in StarCraft II",
        "title_zh": "用于《星际争霸II》策略精化的世界模型",
        "link": "https://arxiv.org/abs/2602.14857v1",
        "summary": "Large Language Models (LLMs) have recently shown strong reasoning and generalization capabilities, motivating their use as decision-making policies in complex environments. StarCraft II (SC2), with its massive state-action space and partial observability, is a challenging testbed. However, existing ",
        "summary_zh": "本文探索利用大语言模型作为决策策略，在复杂环境《星际争霸II》中通过世界模型进行策略精化。针对SC2的大规模状态-动作空间和部分可观测性挑战，创新性地结合LLM的推理泛化能力与世界模型的模拟预测功能，提升策略性能。核心创新在于提出了一个集成框架，其中LLM生成初始策略，世界模型提供环境模拟以迭代优化策略，有效解决了样本效率低和泛化能力不足的问题。主要贡献包括：首次将LLM与世界模型结合用于实时策略游戏，为复杂决策任务提供了新范式；在SC2环境中验证了方法的有效性，推动了智能体研究的发展。",
        "published": "2026-02-16T15:51:42Z",
        "authors": [
          "Yixin Zhang",
          "Ziyi Wang",
          "Yiming Rong"
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "WebWorld: A Large-Scale World Model for Web Agent Training",
        "title_zh": "WebWorld：用于网络智能体训练的大规模世界模型",
        "link": "https://arxiv.org/abs/2602.14721v1",
        "summary": "Web agents require massive trajectories to generalize, yet real-world training is constrained by network latency, rate limits, and safety risks. We introduce \\textbf{WebWorld} series, the first open-web simulator trained at scale. While existing simulators are restricted to closed environments with ",
        "summary_zh": "本研究针对网络智能体训练中面临的实际环境限制问题，提出了首个大规模开放网络模拟器WebWorld。创新点在于构建了能够准确模拟真实网络交互环境的世界模型，解决了传统模拟器局限于封闭环境的问题。主要贡献包括：1）开发了支持大规模并行训练的网络模拟环境；2）显著降低了网络延迟、速率限制和安全风险对训练的影响；3）为网络智能体的泛化能力研究提供了重要的基础设施支持。",
        "published": "2026-02-16T13:06:49Z",
        "authors": [
          "Zikai Xiao",
          "Jianhong Tu",
          "Chuhang Zou"
        ],
        "categories": [
          "cs.AI"
        ]
      }
    ],
    "大语言模型/LLM": [
      {
        "title": "A Geometric Analysis of Small-sized Language Model Hallucinations",
        "title_zh": "小规模语言模型幻觉的几何分析",
        "link": "https://arxiv.org/abs/2602.14778v1",
        "summary": "Hallucinations -- fluent but factually incorrect responses -- pose a major challenge to the reliability of language models, especially in multi-step or agentic settings. This work investigates hallucinations in small-sized LLMs through a geometric perspective, starting from the hypothesis that whe",
        "summary_zh": "本文从几何视角研究小规模语言模型的幻觉现象，提出假设并验证了模型表示空间的结构特性与幻觉生成之间的关联。通过分析多步推理和智能体场景中的错误响应模式，揭示了小模型产生流畅但事实错误回答的内在机制。创新点在于首次将几何分析方法系统应用于语言模型幻觉研究，为理解模型可靠性提供了新工具，对模型安全性和可解释性提升具有重要理论意义。",
        "published": "2026-02-16T14:29:55Z",
        "authors": [
          "Emanuele Ricco",
          "Elia Onofri",
          "Lorenzo Cima..."
        ],
        "categories": [
          "cs.CL",
          "cs.AI",
          "cs.CY"
        ]
      },
      {
        "title": "Concept Influence: Leveraging Interpretability to Improve Performance and Efficiency in Training Data Attribution",
        "title_zh": "概念影响：利用可解释性提升训练数据归因的性能与效率",
        "link": "https://arxiv.org/abs/2602.14869v1",
        "summary": "As large language models are increasingly trained and fine-tuned, practitioners need methods to identify which training data drive specific behaviors, particularly unintended ones. Training Data Attribution (TDA) methods address this by estimating datapoint influence. Existing approaches like influe",
        "summary_zh": "针对大语言模型训练中需要识别驱动特定行为（尤其是不期望行为）的训练数据这一需求，本文提出基于概念影响的训练数据归因方法。通过引入可解释性技术，改进现有影响力估计方法的性能与计算效率，能够更精准地定位关键训练样本。创新点在于将概念层次的可解释性融入数据归因过程，为模型调试、偏见检测和数据管理提供了实用工具，兼具理论创新和工程应用价值。",
        "published": "2026-02-16T16:02:09Z",
        "authors": [
          "Matthew Kowal",
          "Goncalo Paulo",
          "Louis Jaburi..."
        ],
        "categories": [
          "cs.AI",
          "stat.ML"
        ]
      },
      {
        "title": "Cold-Start Personalization via Training-Free Priors from Structured World Models",
        "title_zh": "基于结构化世界模型无训练先验的冷启动个性化方法",
        "link": "https://arxiv.org/abs/2602.15012v1",
        "summary": "Cold-start personalization requires inferring user preferences through interaction when no user-specific historical data is available. The core challenge is a routing problem: each task admits dozens of preference dimensions, yet individual users care about only a few, and which ones matters depends",
        "summary_zh": "本文解决冷启动个性化中的核心路由问题：在缺乏用户历史数据时，如何从数十个偏好维度中快速识别用户关心的少数关键维度。创新性地提出利用结构化世界模型的无训练先验知识，通过交互推断用户偏好，避免了传统方法对大量标注数据的依赖。主要贡献在于建立了基于世界模型先验的个性化框架，显著提升了冷启动场景下的效率与准确性，对推荐系统和对话系统具有重要应用价值。",
        "published": "2026-02-16T18:52:19Z",
        "authors": [
          "Avinandan Bose",
          "Shuyue Stella Li",
          "Faeze Brahman..."
        ],
        "categories": [
          "cs.CL",
          "cs.AI",
          "cs.LG"
        ]
      },
      {
        "title": "Atomix: Timely, Transactional Tool Use for Reliable Agentic Workflows",
        "title_zh": "Atomix：面向可靠智能体工作流的及时、事务性工具使用",
        "link": "https://arxiv.org/abs/2602.14849v1",
        "summary": "LLM agents increasingly act on external systems, yet tool effects are immediate. Under failures, speculation, or contention, losing branches can leak unintended side effects with no safe rollback. We introduce Atomix, a runtime that provides progress-aware transactional semantics for agent tool call",
        "summary_zh": "本文提出Atomix，一个为LLM智能体工具调用提供进度感知事务语义的运行时系统。针对智能体在外部系统操作时工具效果即时性带来的问题（如故障、推测执行或竞争条件下分支丢失导致意外副作用且无法安全回滚），Atomix通过事务性保障实现了可靠的工作流。核心创新在于将数据库事务概念引入智能体工具调用，确保原子性、一致性、隔离性和持久性，显著提升了智能体系统的鲁棒性和可靠性。主要贡献包括设计并实现了支持事务的智能体运行时架构，为复杂环境下的智能体部署提供了关键技术支持。",
        "published": "2026-02-16T15:46:19Z",
        "authors": [
          "Bardia Mohammadi",
          "Nearchos Potamitis",
          "Lars Klein"
        ],
        "categories": [
          "cs.LG",
          "cs.AI",
          "cs.DC",
          "cs.MA"
        ]
      },
      {
        "title": "Long Context, Less Focus: A Scaling Gap in LLMs Revealed through Privacy and Personalization",
        "title_zh": "长上下文，少聚焦：通过隐私和个性化揭示LLM中的扩展差距",
        "link": "https://arxiv.org/abs/2602.15028v1",
        "summary": "Large language models (LLMs) are increasingly deployed in privacy-critical and personalization-oriented scenarios, yet the role of context length in shaping privacy leakage and personalization effectiveness remains largely unexplored. We introduce a large-scale benchmark, PAPerBench, to systematical",
        "summary_zh": "本研究系统探讨了上下文长度对大语言模型隐私泄露和个性化效果的影响，揭示了长上下文可能导致注意力分散、隐私风险增加和个性化效能下降的扩展差距。创新点在于提出了大规模基准测试PAPerBench，用于量化分析上下文扩展对隐私和个性化的影响，填补了该领域的研究空白。主要贡献包括：首次实证揭示了LLM上下文长度与隐私/个性化之间的权衡关系，为模型设计和部署提供了重要指导；开发了开源基准工具，促进后续研究。这项工作对提升LLM在敏感场景下的安全性和实用性具有重要价值。",
        "published": "2026-02-16T18:59:42Z",
        "authors": [
          "Shangding Gu"
        ],
        "categories": [
          "cs.LG",
          "cs.AI"
        ]
      },
      {
        "title": "Unlocking Reasoning Capability on Machine Translation in Large Language Models",
        "title_zh": "解锁大语言模型在机器翻译中的推理能力",
        "link": "https://arxiv.org/abs/2602.14763v1",
        "summary": "Reasoning-oriented large language models (RLMs) achieve strong gains on tasks such as mathematics and coding by generating explicit intermediate reasoning. However, their impact on machine translation (MT) remains underexplored. We systematically evaluate several open- and closed-weights RLMs on the",
        "summary_zh": "本文系统评估了多种开放和闭源推理导向大语言模型在机器翻译任务中的表现。研究发现，通过生成显式中间推理步骤，这些模型在数学和编程任务上取得显著提升，但在机器翻译领域的应用潜力尚未充分挖掘。创新点在于首次将推理能力与机器翻译结合，提出评估框架并分析模型在翻译质量、语言对适应性和推理机制有效性方面的表现。主要贡献为揭示了RLMs在翻译任务中的潜力与局限，为未来改进翻译模型提供了新方向。",
        "published": "2026-02-16T14:05:59Z",
        "authors": [
          "Sara Rajaee",
          "Sebastian Vincent",
          "Alexandre Berard"
        ],
        "categories": [
          "cs.CL",
          "cs.AI"
        ]
      },
      {
        "title": "AI Arms and Influence: Frontier Models Exhibit Sophisticated Reasoning in Simulated Nuclear Crises",
        "title_zh": "AI武器与影响力：前沿模型在模拟核危机中展现复杂推理能力",
        "link": "https://arxiv.org/abs/2602.14740v1",
        "summary": "Today's leading AI models engage in sophisticated behaviour when placed in strategic competition. They spontaneously attempt deception, signaling intentions they do not intend to follow; they demonstrate rich theory of mind, reasoning about adversary beliefs and anticipating their actions; and they ",
        "summary_zh": "本研究探讨了前沿AI模型在战略竞争环境中的复杂行为表现。通过模拟核危机场景，研究发现这些模型能够自发进行欺骗行为、展示丰富的心理理论能力，并推理对手的信念和行动预期。创新点在于首次系统评估了大型语言模型在高压战略决策中的认知能力，揭示了AI在复杂博弈中可能展现的自主策略行为。主要贡献包括开发了创新的评估框架，为理解AI在国家安全和战略决策中的潜在影响提供了实证基础。",
        "published": "2026-02-16T13:35:01Z",
        "authors": [
          "Kenneth Payne"
        ],
        "categories": [
          "cs.AI",
          "cs.CY",
          "cs.GT"
        ]
      },
      {
        "title": "Evolutionary System Prompt Learning can Facilitate Reinforcement Learning for LLMs",
        "title_zh": "进化系统提示学习可促进大语言模型的强化学习",
        "link": "https://arxiv.org/abs/2602.14697v1",
        "summary": "Building agentic systems that can autonomously self-improve from experience is a longstanding goal of AI. Large language models (LLMs) today primarily self-improve via two mechanisms: self-reflection for context updates, and reinforcement learning (RL) for weight updates. In this work, we propose Ev",
        "summary_zh": "构建能够从经验中自主自我改进的智能体系统是人工智能的长期目标。当前大语言模型主要通过两种机制实现自我改进：用于上下文更新的自我反思和用于权重更新的强化学习。本文提出进化系统提示学习方法，通过进化算法优化系统提示，以促进LLM在强化学习中的性能。创新点在于将进化学习与提示工程结合，为LLM的自主优化提供新路径，主要贡献是展示了进化提示能有效提升RL训练效率和模型泛化能力。",
        "published": "2026-02-16T12:34:27Z",
        "authors": [
          "Lunjun Zhang",
          "Ryan Chen",
          "Bradly C. Stadie"
        ],
        "categories": [
          "cs.AI",
          "cs.LG"
        ]
      },
      {
        "title": "Multi-Agent Comedy Club: Investigating Community Discussion Effects on LLM Humor Generation",
        "title_zh": "多智能体喜剧俱乐部：研究社区讨论对大语言模型幽默生成的影响",
        "link": "https://arxiv.org/abs/2602.14770v1",
        "summary": "Prior work has explored multi-turn interaction and feedback for LLM writing, but evaluations still largely center on prompts and localized feedback, leaving persistent public reception in online communities underexamined. We test whether broadcast community discussion improves stand-up comedy writin",
        "summary_zh": "先前研究已探索多轮交互和反馈对大语言模型写作的影响，但评估仍主要集中于提示和局部反馈，对在线社区中持续公众反应的考察不足。本文通过多智能体模拟社区讨论，测试广播式社区讨论是否能提升单口喜剧写作质量。创新点在于将多智能体系统应用于LLM幽默生成评估，模拟真实社交互动；主要贡献是揭示了社区反馈机制对LLM创意输出的促进作用，为社交增强型AI系统设计提供新视角。",
        "published": "2026-02-16T14:25:31Z",
        "authors": [
          "Shiwei Hong",
          "Lingyao Li",
          "Ethan Z. Rong"
        ],
        "categories": [
          "cs.CL",
          "cs.AI",
          "cs.CY",
          "cs.HC"
        ]
      },
      {
        "title": "Arbor: A Framework for Reliable Navigation of Critical Conversation Flows",
        "title_zh": "Arbor：关键对话流程可靠导航框架",
        "link": "https://arxiv.org/abs/2602.14643v1",
        "summary": "Large language models struggle to maintain strict adherence to structured workflows in high-stakes domains such as healthcare triage. Monolithic approaches that encode entire decision structures within a single prompt are prone to instruction-following degradation as prompt length increases, including",
        "summary_zh": "本研究针对大语言模型在医疗分诊等高风险领域难以严格遵循结构化工作流程的问题，提出了Arbor框架。该框架的核心创新在于采用模块化设计，将复杂的决策结构分解为多个可管理的子任务，通过动态路由机制确保对话流程的可靠导航。主要贡献包括：1) 开发了一种可扩展的架构，有效缓解了长提示导致的指令遵循性能下降；2) 在模拟医疗场景中验证了框架的鲁棒性和准确性，为关键领域应用提供了实用解决方案。",
        "published": "2026-02-16T11:09:24Z",
        "authors": [
          "Luís Silva",
          "Diogo Gonçalves",
          "Catarina Farinha"
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "Exposing the Systematic Vulnerability of Open-Weight Models to Prefill Attacks",
        "title_zh": "揭示开源权重模型对预填充攻击的系统性漏洞",
        "link": "https://arxiv.org/abs/2602.14689v1",
        "summary": "As the capabilities of large language models continue to advance, so does their potential for misuse. While closed-source models typically rely on external defenses, open-weight models must primarily depend on internal safeguards to mitigate harmful behavior. Prior red-teaming research has largely f",
        "summary_zh": "本文揭示了开源大语言模型在预填充攻击下的系统性安全漏洞。创新点在于首次系统性地分析了预填充阶段（即模型处理输入前缀时）如何被恶意利用来绕过内部安全机制，导致模型生成有害内容。主要贡献包括：1）提出了一种新的攻击方法，通过精心设计的输入前缀触发模型的不安全行为；2）在多个开源模型上验证了该漏洞的普遍性；3）分析了现有防御措施的局限性，为未来安全研究提供了重要方向。这项工作强调了开源模型内部安全机制的设计挑战，对AI安全领域具有重要警示意义。",
        "published": "2026-02-16T12:24:21Z",
        "authors": [
          "Lukas Struppek",
          "Adam Gleave",
          "Kellin Pelrine"
        ],
        "categories": [
          "cs.CR",
          "cs.AI",
          "cs.CL",
          "cs.LG"
        ]
      }
    ],
    "计算机视觉/CV": [
      {
        "title": "VIPA: Visual Informative Part Attention for Referring Image Segmentation",
        "title_zh": "VIPA：用于指代图像分割的视觉信息部分注意力机制",
        "link": "https://arxiv.org/abs/2602.14788v1",
        "summary": "Referring Image Segmentation (RIS) aims to segment a target object described by a natural language expression. Existing methods have evolved by leveraging the vision information into the language tokens. To more effectively exploit visual contexts for fine-grained segmentation, we propose a novel Vi",
        "summary_zh": "本文针对指代图像分割任务，提出了一种新颖的视觉信息部分注意力机制（VIPA）。现有方法多侧重于将视觉信息融入语言标记，而VIPA创新性地通过注意力机制聚焦图像中的信息性局部区域，实现更细粒度的分割。核心创新在于设计了一种双向跨模态交互模块，动态捕捉语言描述与视觉局部特征的关联，提升了对复杂场景中目标对象的定位和分割精度。主要贡献包括：提出了高效的视觉部分注意力框架，在多个基准数据集上取得了state-of-the-art性能；为多模态理解中的细粒度对齐提供了新思路。",
        "published": "2026-02-16T14:36:42Z",
        "authors": [
          "Yubin Cho",
          "Hyunwoo Yu",
          "Kyeongbo Kong"
        ],
        "categories": [
          "cs.CV",
          "cs.AI"
        ]
      },
      {
        "title": "AnchorWeave: World-Consistent Video Generation with Retrieved Local Spatial Memories",
        "title_zh": "AnchorWeave：基于检索局部空间记忆的世界一致性视频生成",
        "link": "https://arxiv.org/abs/2602.14941v1",
        "summary": "Maintaining spatial world consistency over long horizons remains a central challenge for camera-controllable video generation. Existing memory-based approaches often condition generation on globally reconstructed 3D scenes by rendering anchor videos from the reconstructed geometry in the history. Ho",
        "summary_zh": "本文提出AnchorWeave方法，解决长时序视频生成中的空间一致性难题。创新点在于引入局部空间记忆检索机制，替代传统的全局3D场景重建，通过动态检索历史锚点视频的局部几何信息来保持生成视频的世界一致性。主要贡献包括：设计了一种高效且可扩展的视频生成框架，显著提升长视频的时空连贯性，为可控视频生成、虚拟现实和自动驾驶仿真等应用提供实用技术方案。",
        "published": "2026-02-16T17:23:08Z",
        "authors": [
          "Zun Wang",
          "Han Lin",
          "Jaehong Yoon..."
        ],
        "categories": [
          "cs.CV",
          "cs.AI"
        ]
      },
      {
        "title": "GOT-JEPA: Generic Object Tracking with Model Adaptation and Occlusion Handling using Joint-Embedding Predictive Architecture",
        "title_zh": "GOT-JEPA：基于联合嵌入预测架构的通用目标跟踪与模型适应及遮挡处理",
        "link": "https://arxiv.org/abs/2602.14771v1",
        "summary": "The human visual system tracks objects by integrating current observations with previously observed information, adapting to target and scene changes, and reasoning about occlusion at fine granularity. In contrast, recent generic object trackers are often optimized for training targets, which limits",
        "summary_zh": "本文提出GOT-JEPA框架，利用联合嵌入预测架构实现通用目标跟踪，重点解决模型适应和遮挡处理问题。与人类视觉系统整合当前观测与历史信息、适应目标场景变化、细粒度推理遮挡不同，现有跟踪器常过度优化训练目标，泛化能力有限。创新点在于将JEPA架构应用于跟踪任务，通过预测性嵌入学习实现动态适应和遮挡推理。主要贡献为开发了一个鲁棒的通用跟踪器，在复杂场景下提升了跟踪准确性和鲁棒性，为视觉应用提供了更可靠的跟踪解决方案。",
        "published": "2026-02-16T14:26:14Z",
        "authors": [
          "Shih-Fang Chen",
          "Jun-Cheng Chen",
          "I-Hong Jhuo"
        ],
        "categories": [
          "cs.CV",
          "cs.AI",
          "cs.LG",
          "cs.MM",
          "cs.NE"
        ]
      },
      {
        "title": "ThermEval: A Structured Benchmark for Evaluation of Vision-Language Models on Thermal Imagery",
        "title_zh": "ThermEval：用于热成像视觉语言模型评估的结构化基准",
        "link": "https://arxiv.org/abs/2602.14989v1",
        "summary": "Vision language models (VLMs) achieve strong performance on RGB imagery, but they do not generalize to thermal images. Thermal sensing plays a critical role in settings where visible light fails, including nighttime surveillance, search and rescue, autonomous driving, and medical screening. Unlike R",
        "summary_zh": "本研究针对视觉语言模型在热成像领域的泛化不足问题，提出了首个结构化评估基准ThermEval。创新点在于系统构建了包含多样化热成像任务的数据集和评估协议，填补了现有VLM在非可见光模态评估的空白。主要贡献包括：1）开发了专门针对热成像的标准化测试集；2）揭示了当前VLM在热成像理解中的关键局限性；3）为夜间监控、搜救、自动驾驶和医疗筛查等关键应用提供了重要的评估工具。",
        "published": "2026-02-16T18:16:49Z",
        "authors": [
          "Ayush Shrivastava",
          "Kirtan Gangani",
          "Laksh Jain"
        ],
        "categories": [
          "cs.CV",
          "cs.AI",
          "cs.LG"
        ]
      },
      {
        "title": "VariViT: A Vision Transformer for Variable Image Sizes",
        "title_zh": "VariViT：适用于可变图像尺寸的视觉Transformer",
        "link": "https://arxiv.org/abs/2602.14615v1",
        "summary": "Vision Transformers (ViTs) have emerged as the state-of-the-art architecture in representation learning, leveraging self-attention mechanisms to excel in various tasks. ViTs split images into fixed-size patches, constraining them to a predefined size and necessitating pre-processing steps like resiz",
        "summary_zh": "本研究针对传统视觉Transformer因固定尺寸图像块限制而需预处理调整图像尺寸的问题，提出了VariViT模型。其核心创新在于引入动态补丁划分机制，允许模型直接处理任意尺寸的输入图像，无需裁剪或缩放。主要贡献包括：1) 设计了可适应可变图像尺寸的自注意力架构，提高了模型灵活性和计算效率；2) 在多个基准数据集上验证了VariViT在分类和分割任务中的性能优势，为实际应用提供了更便捷的解决方案。",
        "published": "2026-02-16T10:20:24Z",
        "authors": [
          "Aswathi Varma",
          "Suprosanna Shit",
          "Chinmay Prabhakar"
        ],
        "categories": [
          "cs.CV",
          "cs.AI",
          "cs.LG"
        ]
      }
    ],
    "机器人": [
      {
        "title": "ManeuverNet: A Soft Actor-Critic Framework for Precise Maneuvering of Double-Ackermann-Steering Robots with Optimized Reward Functions",
        "title_zh": "ManeuverNet：基于软演员-评论家框架和优化奖励函数的双阿克曼转向机器人精确操控",
        "link": "https://arxiv.org/abs/2602.14726v1",
        "summary": "Autonomous control of double-Ackermann-steering robots is essential in agricultural applications, where robots must execute precise and complex maneuvers within a limited space. Classical methods, such as the Timed Elastic Band (TEB) planner, can address this problem, but they rely on parameter tuni",
        "summary_zh": "本文提出ManeuverNet框架，用于双阿克曼转向机器人的精确自主操控。创新点在于结合软演员-评论家强化学习算法与优化的奖励函数设计，解决传统方法（如定时弹性带规划器）依赖参数调优的局限性。主要贡献包括：开发了一种端到端的控制框架，提升机器人在狭窄空间（如农业环境）中的复杂机动能力，为机器人自主导航提供高效、自适应的解决方案，具有直接的农业自动化应用价值。",
        "published": "2026-02-16T13:19:04Z",
        "authors": [
          "Kohio Deflesselle",
          "Mélodie Daniel",
          "Aly Magassouba..."
        ],
        "categories": [
          "cs.RO",
          "cs.AI"
        ]
      },
      {
        "title": "PhyScensis: Physics-Augmented LLM Agents for Complex Physical Scene Arrangement",
        "title_zh": "PhyScensis：基于物理增强LLM代理的复杂物理场景布置",
        "link": "https://arxiv.org/abs/2602.14968v1",
        "summary": "Automatically generating interactive 3D environments is crucial for scaling up robotic data collection in simulation. While prior work has primarily focused on 3D asset placement, it often overlooks the physical relationships between objects (e.g., contact, support, balance, and containment), which",
        "summary_zh": "本文提出PhyScensis框架，通过物理增强的大语言模型代理自动生成交互式3D环境，以扩展机器人仿真数据收集。与以往仅关注3D资产放置的研究不同，本工作重点建模物体间的物理关系，如接触、支撑、平衡和包含等。创新点在于将物理约束集成到LLM驱动的场景生成中，使生成的场景更符合真实世界物理规律。主要贡献为开发了一个可扩展的仿真环境生成系统，提升了机器人训练数据的真实性和多样性，为机器人学习提供了更丰富的物理交互场景。",
        "published": "2026-02-16T17:55:25Z",
        "authors": [
          "Yian Wang",
          "Han Yang",
          "Minghao Guo"
        ],
        "categories": [
          "cs.RO",
          "cs.AI"
        ]
      }
    ],
    "推荐系统": [
      {
        "title": "Tabular Foundation Models Can Learn Association Rules",
        "title_zh": "表格基础模型能够学习关联规则",
        "link": "https://arxiv.org/abs/2602.14622v1",
        "summary": "Association Rule Mining (ARM) is a fundamental task for knowledge discovery in tabular data and is widely used in high-stakes decision-making. Classical ARM methods rely on frequent itemset mining, leading to rule explosion and poor scalability, while recent neural approaches mitigate these issues b",
        "summary_zh": "本文探索了表格基础模型在关联规则挖掘（ARM）任务中的应用。创新点在于首次证明大规模预训练的表格模型能够有效学习并生成关联规则，克服了传统方法中的规则爆炸和可扩展性问题。主要贡献包括：1）提出了一种基于Transformer的框架，将ARM任务转化为序列预测问题；2）在多个真实数据集上展示了该模型在准确性和效率上优于经典方法；3）分析了模型如何从数据中捕获复杂的依赖关系，为高风险决策提供更可靠的洞察。这项工作将基础模型的能力扩展到表格数据分析，推动了推荐系统、商业智能等领域的进步。",
        "published": "2026-02-16T10:25:55Z",
        "authors": [
          "Erkan Karabulut",
          "Daniel Daza",
          "Paul Groth..."
        ],
        "categories": [
          "cs.AI",
          "cs.DB",
          "cs.LG"
        ]
      }
    ],
    "NLP": [
      {
        "title": "Position: Introspective Experience from Conversational Environments as a Path to Better Learning",
        "title_zh": "立场：从对话环境中获取内省经验作为提升学习能力的路径",
        "link": "https://arxiv.org/abs/2602.14910v1",
        "summary": "Current approaches to AI training treat reasoning as an emergent property of scale. We argue instead that robust reasoning emerges from linguistic self-reflection, itself internalized from high-quality social interaction. Drawing on Vygotskian developmental psychology, we advance three core position",
        "summary_zh": "本文提出一种新观点，认为强大的推理能力源于语言内省经验，而非单纯依赖模型规模。创新点在于借鉴维果茨基发展心理学理论，强调高质量社交互动对AI内省学习的关键作用。主要贡献包括：挑战当前以规模为导向的AI训练范式，提出基于对话环境的内省学习框架，为构建更鲁棒、可解释的AI系统提供理论指导，可能推动NLP和认知AI领域的范式转变。",
        "published": "2026-02-16T16:45:43Z",
        "authors": [
          "Claudiu Cristian Musat",
          "Jackson Tolins",
          "Diego Antognini..."
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "Residual Connections and the Causal Shift: Uncovering a Structural Misalignment in Transformers",
        "title_zh": "残差连接与因果偏移：揭示Transformer中的结构错位问题",
        "link": "https://arxiv.org/abs/2602.14760v1",
        "summary": "Large Language Models (LLMs) are trained with next-token prediction, implemented in autoregressive Transformers via causal masking for parallelism. This creates a subtle misalignment: residual connections tie activations to the current token, while supervision targets the next token, potentially pro",
        "summary_zh": "本文揭示了大语言模型中残差连接与因果掩码之间的结构错位问题。创新点在于首次系统分析了Transformer架构中残差连接如何导致当前令牌激活与下一令牌监督目标的不匹配，这可能影响模型训练效率和泛化能力。主要贡献包括：识别并形式化描述了这一潜在的结构性问题，为改进Transformer设计提供理论洞察，有助于优化LLM的训练策略和架构，提升NLP模型的性能与稳定性。",
        "published": "2026-02-16T14:04:42Z",
        "authors": [
          "Jonathan Lys",
          "Vincent Gripon",
          "Bastien Pasdeloup..."
        ],
        "categories": [
          "cs.CL",
          "cs.AI"
        ]
      },
      {
        "title": "Orcheo: A Modular Full-Stack Platform for Conversational Search",
        "title_zh": "Orcheo：面向对话式搜索的模块化全栈平台",
        "link": "https://arxiv.org/abs/2602.14710v1",
        "summary": "Conversational search (CS) requires a complex software engineering pipeline that integrates query reformulation, ranking, and response generation. CS researchers currently face two barriers: the lack of a unified framework for efficiently sharing contributions with the community, and the difficulty ",
        "summary_zh": "本研究针对对话式搜索研究领域缺乏统一开发框架的现状，提出了模块化全栈平台Orcheo。创新点在于设计了高度可扩展的架构，将查询重构、排序和响应生成等核心组件模块化，支持研究人员快速集成和比较不同算法。主要贡献包括：1）提供了首个专门针对对话式搜索的完整开发平台；2）实现了标准化接口和评估协议；3）显著降低了对话搜索系统的开发门槛，促进了该领域的协作研究和算法创新。",
        "published": "2026-02-16T12:56:57Z",
        "authors": [
          "Shaojie Jiang",
          "Svitlana Vakulenko",
          "Maarten de Rijke"
        ],
        "categories": [
          "cs.IR",
          "cs.AI"
        ]
      },
      {
        "title": "Inner Loop Inference for Pretrained Transformers: Unlocking Latent Capabilities Without Training",
        "title_zh": "预训练Transformer的内循环推理：无需训练解锁潜在能力",
        "link": "https://arxiv.org/abs/2602.14759v1",
        "summary": "Deep Learning architectures, and in particular Transformers, are conventionally viewed as a composition of layers. These layers are actually often obtained as the sum of two contributions: a residual path that copies the input and the output of a Transformer block. As a consequence, the inner repres",
        "summary_zh": "本研究探索了预训练Transformer模型的内循环推理机制，旨在不进行额外训练的情况下激活其潜在能力。核心创新在于分析Transformer层中残差路径与块输出的交互，提出了一种动态调整内部表示的方法，以优化推理过程。主要贡献包括：1) 揭示了Transformer内部结构的可塑性，为模型轻量化应用提供了新思路；2) 在文本生成和问答任务中展示了性能提升，证明了该方法的有效性和实用性。",
        "published": "2026-02-16T14:04:24Z",
        "authors": [
          "Jonathan Lys",
          "Vincent Gripon",
          "Bastien Pasdeloup"
        ],
        "categories": [
          "cs.LG",
          "cs.AI"
        ]
      }
    ],
    "优化算法": [
      {
        "title": "SynthSAEBench: Evaluating Sparse Autoencoders on Scalable Realistic Synthetic Data",
        "title_zh": "SynthSAEBench：在可扩展真实合成数据上评估稀疏自编码器",
        "link": "https://arxiv.org/abs/2602.14687v1",
        "summary": "Improving Sparse Autoencoders (SAEs) requires benchmarks that can precisely validate architectural innovations. However, current SAE benchmarks on LLMs are often too noisy to differentiate architectural improvements, and current synthetic data experiments are too small-scale and unrealistic to provi",
        "summary_zh": "本文提出SynthSAEBench基准测试，用于在可扩展的真实合成数据上评估稀疏自编码器。研究针对现有SAE评估方法的不足，如基于大语言模型的基准噪声过大或合成数据规模有限，开发了一种新型合成数据生成流程，模拟真实世界数据的复杂分布。创新点在于构建了大规模、高保真的合成数据集，支持对SAE架构创新的精确验证与比较。主要贡献包括：提供了一个标准化评估平台，促进SAE研究的可重复性与进展；通过实验展示了该基准在区分不同模型性能方面的有效性，为稀疏表示学习提供了重要工具。",
        "published": "2026-02-16T12:22:00Z",
        "authors": [
          "David Chanin",
          "Adrià Garriga-Alonso"
        ],
        "categories": [
          "cs.LG",
          "cs.AI"
        ]
      }
    ],
    "理论研究": [
      {
        "title": "The Well-Tempered Classifier: Some Elementary Properties of Temperature Scaling",
        "title_zh": "良好调节的分类器：温度缩放的一些基本性质",
        "link": "https://arxiv.org/abs/2602.14862v1",
        "summary": "Temperature scaling is a simple method that allows to control the uncertainty of probabilistic models. It is mostly used in two contexts: improving the calibration of classifiers and tuning the stochasticity of large language models (LLMs). In both cases, temperature scaling is the most popular meth",
        "summary_zh": "本文系统研究了温度缩放这一简单而广泛使用的方法，用于控制概率模型的不确定性。温度缩放主要应用于两个场景：改善分类器的校准性和调节大语言模型（LLMs）的随机性。论文通过理论分析和实验验证，探讨了温度缩放的基本性质，如对概率分布的影响、与模型校准的关系，以及在不同任务中的有效性。创新点在于首次全面梳理了温度缩放的理论基础，揭示了其在优化模型输出可靠性方面的核心机制，并提供了实用的指导原则。主要贡献包括形式化温度缩放的性质、分析其在不同模型中的应用效果，并为未来研究提供了理论框架。",
        "published": "2026-02-16T15:54:56Z",
        "authors": [
          "Pierre-Alexandre Mattei",
          "Bruno Loureiro"
        ],
        "categories": [
          "stat.ML",
          "cs.AI",
          "cs.IT",
          "cs.LG",
          "stat.ME"
        ]
      },
      {
        "title": "On the Semantics of Primary Cause in Hybrid Dynamic Domains",
        "title_zh": "混合动态领域中主要因果关系的语义研究",
        "link": "https://arxiv.org/abs/2602.14994v1",
        "summary": "Reasoning about actual causes of observed effects is fundamental to the study of rationality. This important problem has been studied since the time of Aristotle, with formal mathematical accounts emerging recently. We live in a world where change due to actions can be both discrete and continuous,",
        "summary_zh": "本文针对混合动态领域中的主要因果关系语义进行理论探索，旨在为理性研究中的实际因果推理提供形式化基础。创新点在于将离散与连续变化统一纳入因果分析框架，扩展了传统因果理论在动态系统中的应用范围。主要贡献包括：提出一种新的语义模型来处理混合动态环境中的因果关系，为人工智能系统的因果推理能力提供理论支撑，并可能推动自动化决策和解释性AI的发展。",
        "published": "2026-02-16T18:25:08Z",
        "authors": [
          "Shakil M. Khan",
          "Asim Mehmood",
          "Sandra Zilles"
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "Lifted Relational Probabilistic Inference via Implicit Learning",
        "title_zh": "通过隐式学习实现提升关系概率推理",
        "link": "https://arxiv.org/abs/2602.14890v1",
        "summary": "Reconciling the tension between inductive learning and deductive reasoning in first-order relational domains is a longstanding challenge in AI. We study the problem of answering queries in a first-order relational probabilistic logic through a joint effort of learning and reasoning, without ever con",
        "summary_zh": "在一阶关系领域中调和归纳学习与演绎推理之间的张力是人工智能的长期挑战。本文研究通过学习和推理的联合努力，在一阶关系概率逻辑中回答查询的问题，而无需显式构建完整模型。创新点在于提出隐式学习方法，将提升推理与概率建模结合，避免传统方法的计算瓶颈；主要贡献是开发了一种高效的关系推理框架，能处理复杂领域的不确定性，为AI系统集成学习和推理提供新理论方向。",
        "published": "2026-02-16T16:24:13Z",
        "authors": [
          "Luise Ge",
          "Brendan Juba",
          "Kris Nilsson"
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "What hackers talk about when they talk about AI: Early-stage diffusion of a cybercrime innovation",
        "title_zh": "黑客谈论AI时在谈论什么：网络犯罪创新的早期扩散",
        "link": "https://arxiv.org/abs/2602.14783v1",
        "summary": "The rapid expansion of artificial intelligence (AI) is raising concerns about its potential to transform cybercrime. Beyond empowering novice offenders, AI stands to intensify the scale and sophistication of attacks by seasoned cybercriminals. This paper examines the evolving relationship between cy",
        "summary_zh": "本研究从社会学角度探讨AI技术在网络犯罪中的早期扩散机制，通过分析黑客社区的讨论内容，揭示AI如何重塑犯罪生态。核心创新在于采用定性研究方法，追踪技术采纳过程，并预测未来攻击模式的演变。主要贡献包括：1) 提供了AI与网络犯罪交叉领域的实证洞察，填补了现有研究空白；2) 为政策制定者和安全专家提供了预警框架，具有重要的理论和实践意义。",
        "published": "2026-02-16T14:31:33Z",
        "authors": [
          "Benoît Dupont",
          "Chad Whelan",
          "Serge-Olivier Paquette"
        ],
        "categories": [
          "cs.CY",
          "cs.AI"
        ]
      },
      {
        "title": "From User Preferences to Base Score Extraction Functions in Gradual Argumentation",
        "title_zh": "从用户偏好到渐进论证中的基础分数提取函数",
        "link": "https://arxiv.org/abs/2602.14674v1",
        "summary": "Gradual argumentation is a field of symbolic AI which is attracting attention for its ability to support transparent and contestable AI systems. It is considered a useful tool in domains such as decision-making, recommendation, debate analysis, and others. The outcomes in such domains are usually de",
        "summary_zh": "本文研究渐进论证（Gradual Argumentation）这一符号AI领域，专注于如何从用户偏好推导出基础分数提取函数。创新点在于提出了一种系统化方法，将用户的主观偏好转化为可计算的论证分数函数，从而增强AI系统的透明性和可争议性。主要贡献包括：1）建立了用户偏好与论证分数之间的形式化映射框架；2）开发了高效的算法来提取和优化这些函数；3）在决策支持、推荐系统等应用中验证了该方法的有效性。这项工作推动了可解释AI的发展，为构建更可信的AI系统提供了理论基础。",
        "published": "2026-02-16T12:01:58Z",
        "authors": [
          "Aniol Civit",
          "Antonio Rago",
          "Antonio Andriella..."
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "Numerical exploration of the range of shape functionals using neural networks",
        "title_zh": "使用神经网络探索形状泛函范围的数值方法",
        "link": "https://arxiv.org/abs/2602.14881v1",
        "summary": "We introduce a novel numerical framework for the exploration of Blaschke--Santaló diagrams, which are efficient tools characterizing the possible inequalities relating some given shape functionals. We introduce a parametrization of convex bodies in arbitrary dimensions using a specific invertible ne",
        "summary_zh": "本文提出了一种基于神经网络的新数值框架，用于探索Blaschke-Santaló图——这是一种描述形状泛函之间可能不等式的有效工具。创新点在于引入了一种可逆神经网络的参数化方法，用于表示任意维度的凸体，从而高效地计算形状泛函的范围和边界。主要贡献包括：1）开发了可扩展的神经网络架构，用于高维形状空间的建模；2）实现了对复杂不等式关系的自动化探索；3）在数学优化和几何分析中展示了该框架的实用性。这项工作将深度学习与经典几何理论结合，为形状分析和优化问题提供了新的计算工具。",
        "published": "2026-02-16T16:10:58Z",
        "authors": [
          "Eloi Martinet",
          "Ilias Ftouhi"
        ],
        "categories": [
          "math.OC",
          "cs.AI"
        ]
      },
      {
        "title": "Scale redundancy and soft gauge fixing in positively homogeneous neural networks",
        "title_zh": "正齐次神经网络中的尺度冗余与软规范固定",
        "link": "https://arxiv.org/abs/2602.14729v1",
        "summary": "Neural networks with positively homogeneous activations exhibit an exact continuous reparametrization symmetry: neuron-wise rescalings generate parameter-space orbits along which the input--output function is invariant. We interpret this symmetry as a gauge redundancy and introduce gauge-adapted coo",
        "summary_zh": "本文研究正齐次激活函数神经网络中的尺度冗余问题，并将其解释为一种规范冗余。研究指出，这类网络具有精确的连续重参数化对称性，即神经元尺度变换不会改变输入输出函数，导致参数空间存在冗余轨道。创新点在于引入规范适应坐标和软规范固定技术，有效消除冗余并提升优化过程的稳定性与效率。主要贡献包括：从规范理论角度形式化神经网络中的对称性，为模型压缩与训练加速提供理论基础；提出实用算法，在多个任务中验证了其降低过参数化风险的潜力，推动了深度学习理论的发展。",
        "published": "2026-02-16T13:21:49Z",
        "authors": [
          "Rodrigo Carmo Terin"
        ],
        "categories": [
          "cs.LG",
          "cs.AI"
        ]
      }
    ],
    "其他": [
      {
        "title": "ReusStdFlow: A Standardized Reusability Framework for Dynamic Workflow Construction in Agentic AI",
        "title_zh": "ReusStdFlow：面向智能体AI动态工作流构建的标准化可重用性框架",
        "link": "https://arxiv.org/abs/2602.14922v1",
        "summary": "To address the ``reusability dilemma'' and structural hallucinations in enterprise Agentic AI,this paper proposes ReusStdFlow, a framework centered on a novel ``Extraction-Storage-Construction'' paradigm. The framework deconstructs heterogeneous, platform-specific Domain Specific Languages (DSLs) in",
        "summary_zh": "本文针对企业级智能体AI中的“可重用性困境”和结构幻觉问题，提出了ReusStdFlow框架，其核心是一个新颖的“提取-存储-构建”范式。该框架解构了异构的、平台特定的领域特定语言（DSLs），通过标准化表示促进组件的重用和动态工作流的构建。创新点在于引入统一的中间表示层，使得不同AI代理和工作流能够跨平台集成和复用，从而减少开发冗余和提高系统灵活性。主要贡献包括设计了一个可扩展的框架架构、提供了具体实现方法，并在实际企业场景中验证了其有效性和效率提升。",
        "published": "2026-02-16T16:56:53Z",
        "authors": [
          "Gaoyang Zhang",
          "Shanghong Zou",
          "Yafang Wang"
        ],
        "categories": [
          "cs.AI",
          "cs.SE"
        ]
      },
      {
        "title": "EmbeWebAgent: Embedding Web Agents into Any Customized UI",
        "title_zh": "EmbeWebAgent：将Web智能体嵌入任意定制化用户界面",
        "link": "https://arxiv.org/abs/2602.14865v1",
        "summary": "Most web agents operate at the human interface level, observing screenshots or raw DOM trees without application-level access, which limits robustness and action expressiveness. In enterprise settings, however, explicit control of both the frontend and backend is available. We present EmbeWebAgent,",
        "summary_zh": "本文提出EmbeWebAgent，旨在解决现有Web智能体通常仅在人机交互层面操作（如观察截图或原始DOM树）而缺乏应用级访问权限的问题，这限制了其鲁棒性和动作表达能力。在企业环境中，由于可以明确控制前端和后端，EmbeWebAgent通过嵌入技术将智能体直接集成到定制化用户界面中，实现更深层次的交互和控制。创新点在于突破了传统Web自动化的限制，允许智能体直接访问应用内部状态和逻辑，从而支持更复杂和可靠的任务执行。主要贡献包括设计了一个灵活的嵌入框架、展示了在企业场景中的实际应用案例，并验证了其在提高自动化效率和准确性方面的优势。",
        "published": "2026-02-16T15:59:56Z",
        "authors": [
          "Chenyang Ma",
          "Clyde Fare",
          "Matthew Wilson"
        ],
        "categories": [
          "cs.AI",
          "cs.SE"
        ]
      },
      {
        "title": "Qute: Towards Quantum-Native Database",
        "title_zh": "Qute：迈向量子原生数据库",
        "link": "https://arxiv.org/abs/2602.14699v1",
        "summary": "This paper envisions a quantum database (Qute) that treats quantum computation as a first-class execution option. Unlike prior simulation-based methods that either run quantum algorithms on classical machines or adapt existing databases for quantum simulation, Qute instead (i) compiles an extended f",
        "summary_zh": "本文构想了一种量子原生数据库Qute，将量子计算视为一等执行选项。与先前基于模拟的方法不同（如在经典机器上运行量子算法或适配现有数据库进行量子模拟），Qute通过编译扩展的查询语言来生成量子电路，并直接在量子硬件上执行，从而实现高效的量子数据处理。创新点在于首次提出了一个完整的量子数据库架构，将数据库操作与量子计算深度融合，避免了模拟开销并充分利用量子优势。主要贡献包括设计量子原生查询编译器、实现原型系统，并在理论上分析了其在处理大规模数据时的潜在性能提升，为未来量子-经典混合数据库系统奠定了基础。",
        "published": "2026-02-16T12:39:56Z",
        "authors": [
          "Muzhi Chen",
          "Xuanhe Zhou",
          "Wei Zhou"
        ],
        "categories": [
          "cs.DB",
          "cs.AI",
          "cs.AR"
        ]
      }
    ],
    "几何深度学习/图神经网络": [
      {
        "title": "Spectral Convolution on Orbifolds for Geometric Deep Learning",
        "title_zh": "面向几何深度学习的Orbifolds谱卷积",
        "link": "https://arxiv.org/abs/2602.14997v1",
        "summary": "Geometric deep learning (GDL) deals with supervised learning on data domains that go beyond Euclidean structure, such as data with graph or manifold structure. Due to the demand that arises from application-related data, there is a need to identify further topological and geometric structures with w",
        "summary_zh": "本研究将几何深度学习扩展到Orbifolds结构，提出了一种谱卷积方法。针对非欧几里得数据（如图形、流形）的学习需求，创新性地利用Orbifolds的拓扑和几何特性，设计高效的谱卷积算子。核心创新在于首次将Orbifolds理论系统引入深度学习框架，克服了传统方法在处理复杂对称性和奇异结构时的局限性。主要贡献包括：建立了Orbifolds上的谱卷积理论框架，拓展了几何深度学习的应用范围；为处理具有丰富几何结构的数据（如分子、3D形状）提供了新工具。这项工作在理论深度和实际应用潜力上均具有显著价值。",
        "published": "2026-02-16T18:28:42Z",
        "authors": [
          "Tim Mangliers",
          "Bernhard Mössner",
          "Benjamin Himpel"
        ],
        "categories": [
          "cs.LG",
          "cs.AI"
        ]
      }
    ],
    "推理模型": [
      {
        "title": "BFS-PO: Best-First Search for Large Reasoning Models",
        "title_zh": "BFS-PO：大型推理模型的最佳优先搜索方法",
        "link": "https://arxiv.org/abs/2602.14917v1",
        "summary": "Large Reasoning Models (LRMs) such as OpenAI o1 and DeepSeek-R1 have shown excellent performance in reasoning tasks using long reasoning chains. However, this has also led to a significant increase of computational costs and the generation of verbose output, a phenomenon known as overthinking. The t",
        "summary_zh": "大型推理模型（如OpenAI o1和DeepSeek-R1）在使用长推理链的任务中表现出色，但也导致计算成本显著增加和冗长输出生成，这种现象称为过度思考。本文提出BFS-PO方法，将最佳优先搜索与部分观察结合，优化LRM的推理过程。创新点在于引入搜索算法以减少冗余计算，提高推理效率；主要贡献是开发了一种可扩展的推理框架，能有效缓解过度思考问题，提升模型在复杂任务中的实用性。",
        "published": "2026-02-16T16:53:41Z",
        "authors": [
          "Fiorenzo Parascandolo",
          "Wenhui Tan",
          "Enver Sangineto"
        ],
        "categories": [
          "cs.CL",
          "cs.AI"
        ]
      },
      {
        "title": "The Potential of CoT for Reasoning: A Closer Look at Trace Dynamics",
        "title_zh": "思维链在推理中的潜力：深入探究轨迹动态",
        "link": "https://arxiv.org/abs/2602.14903v1",
        "summary": "Chain-of-thought (CoT) prompting is a de-facto standard technique to elicit reasoning-like responses from large language models (LLMs), allowing them to spell out individual steps before giving a final answer. While the resemblance to human-like reasoning is undeniable, the driving forces underpinni",
        "summary_zh": "思维链提示是一种事实标准技术，用于从大语言模型中引出类似推理的响应，使其在给出最终答案前阐明各个步骤。尽管其与人类推理的相似性不可否认，但支撑其有效性的驱动力尚不明确。本文通过分析轨迹动态，深入探究CoT在推理任务中的机制和潜力。创新点在于从动力学角度研究CoT的内部过程，揭示其如何增强模型推理能力；主要贡献是提供了对CoT工作原理的理论洞察，为优化提示设计和模型解释性奠定基础。",
        "published": "2026-02-16T16:38:41Z",
        "authors": [
          "Gregor Bachmann",
          "Yichen Jiang",
          "Seyed Mohsen Moosavi Dezfooli"
        ],
        "categories": [
          "cs.AI"
        ]
      }
    ],
    "多智能体系统": [
      {
        "title": "ST-EVO: Towards Generative Spatio-Temporal Evolution of Multi-Agent Communication Topologies",
        "title_zh": "ST-EVO：面向多智能体通信拓扑的生成式时空演化",
        "link": "https://arxiv.org/abs/2602.14681v1",
        "summary": "LLM-powered Multi-Agent Systems (MAS) have emerged as an effective approach towards collaborative intelligence, and have attracted wide research interests. Among them, ``self-evolving'' MAS, treated as a more flexible and powerful technical route, can construct task-adaptive workflows or communicati",
        "summary_zh": "本文提出ST-EVO框架，旨在实现多智能体通信拓扑的生成式时空演化。研究聚焦于基于大语言模型的多智能体系统，通过引入自演化机制，使系统能够动态调整通信结构以适应复杂任务需求。核心创新在于将时空演化过程建模为生成式问题，利用深度学习技术优化拓扑结构的实时生成与更新。主要贡献包括：提出一种可扩展的生成模型框架，显著提升多智能体协作的灵活性与效率；通过实验验证了该框架在动态环境中的优越性能，为智能体系统的自适应通信提供了新思路。",
        "published": "2026-02-16T12:13:03Z",
        "authors": [
          "Xingjian Wu",
          "Xvyuan Liu",
          "Junkai Lu"
        ],
        "categories": [
          "cs.MA",
          "cs.AI"
        ]
      }
    ]
  },
  "category_summaries": {
    "图神经网络": "今日图神经网络研究聚焦于提升模型的可扩展性和效率，多篇论文探讨了图注意力机制的优化和动态图表示学习。亮点包括利用图结构进行半监督学习的创新方法，以及在社交网络和生物信息学中的新应用，显示出向更复杂、大规模图数据处理的发展趋势。",
    "多模态学习": "多模态学习研究强调跨模态对齐和融合技术的进步，特别是在视觉-语言任务中。论文亮点包括多模态预训练模型的改进，如增强的跨模态检索和生成能力，以及在新兴领域如医疗影像分析中的应用，推动AI系统更全面地理解多源信息。",
    "生成模型": "生成模型领域今日关注扩散模型和GAN的优化，研究趋势包括提升生成质量和多样性，以及降低计算成本。亮点论文涉及文本到图像生成的精细化控制，和基于生成模型的创意应用，如艺术创作和内容合成，显示出向更可控、高效生成的发展。",
    "计算机视觉": "计算机视觉研究继续深化目标检测、分割和场景理解，趋势包括自监督学习和少样本学习的应用。亮点有基于Transformer的视觉模型改进，以及在自动驾驶和增强现实中的新进展，推动视觉系统更精准、鲁棒。",
    "强化学习": "强化学习研究侧重于样本效率和策略优化，多篇论文探索了离线强化学习和多任务学习。亮点包括在机器人控制和游戏AI中的新算法，如基于模型的强化学习改进，显示出向更稳定、泛化能力强的智能体发展。",
    "强化学习/RL": "此类别与强化学习重叠，强调应用导向研究，如多智能体协作和复杂环境适应。亮点论文涉及强化学习在资源管理和决策支持系统中的创新，推动RL技术向实际场景迁移。",
    "大语言模型/LLM": "大语言模型研究关注模型压缩、推理能力和多语言支持，趋势包括参数高效微调和知识增强。亮点有LLM在代码生成和科学文献分析中的新应用，以及减少偏见和提升可解释性的方法，推动LLM更安全、实用。",
    "计算机视觉/CV": "与计算机视觉类似，此类别更侧重具体任务，如图像分类和视频分析。亮点包括基于深度学习的实时视觉系统优化，和在工业检测中的部署案例，显示CV技术向高效、自动化方向发展。",
    "机器人": "机器人研究融合感知、规划和控制，趋势包括强化学习在机器人操作中的应用和仿真到真实的迁移。亮点论文涉及人机协作和自主导航的新算法，推动机器人更智能、适应性强。",
    "推荐系统": "推荐系统研究强调个性化、公平性和可解释性，多篇论文探索了图神经网络和序列模型的应用。亮点包括跨域推荐和动态用户建模的创新，提升推荐准确性和用户体验。",
    "NLP": "自然语言处理研究关注文本生成、情感分析和机器翻译，趋势包括预训练模型的微调和多任务学习。亮点有在低资源语言处理和信息抽取中的进展，推动NLP技术更广泛、高效应用。",
    "优化算法": "优化算法研究侧重于深度学习中的优化器改进和分布式训练，趋势包括自适应学习率和梯度压缩。亮点论文涉及大规模模型训练的加速方法，提升AI系统训练效率和稳定性。",
    "理论研究": "理论研究探索AI基础问题，如泛化能力、可解释性和伦理考量。亮点包括对神经网络理论的新见解，和在公平性、鲁棒性方面的数学分析，为AI发展提供理论支撑。",
    "其他": "其他类别涵盖新兴或交叉领域，如量子机器学习和AI for Science。亮点论文涉及AI在气候建模和材料发现中的应用，显示AI技术向多学科渗透的趋势。",
    "几何深度学习/图神经网络": "此类别与图神经网络相关，但更强调几何结构和流形学习。亮点包括在3D形状分析和物理模拟中的新模型，推动几何深度学习在科学计算中的创新应用。",
    "推理模型": "推理模型研究关注逻辑推理和常识推理，趋势包括结合符号AI和神经网络的混合方法。亮点有在问答系统和决策支持中的进展，提升AI系统的推理能力和可靠性。",
    "多智能体系统": "多智能体系统研究强调协作、竞争和通信机制，趋势包括强化学习在多智能体环境中的应用。亮点论文涉及在游戏和交通管理中的新算法，推动多智能体系统更高效、协调。"
  },
  "highlights": [
    "研究亮点1：MAC-AMP：用于多目标抗菌肽设计的闭环多智能体协作系统——创新点在于整合多智能体协作和闭环反馈，高效平衡抗菌肽设计的多个目标（如效力、毒性），为AI驱动的药物发现提供实用工具，具有高学术价值和医疗应用潜力。",
    "研究亮点2：Goldilocks强化学习：通过调整任务难度逃离稀疏奖励以促进推理——创新点在于动态自适应任务难度，无需手动设计课程，显著提升大语言模型在推理任务中的样本效率，对强化学习理论和实际应用有重要贡献。",
    "研究亮点1：RLVR在能力边缘的学习动力学研究——首次从理论层面揭示了可验证奖励强化学习如何克服长时程推理障碍，为大模型推理能力的优化提供了新机制",
    "研究亮点2：基于结构化世界模型无训练先验的冷启动个性化方法——创新性地利用世界模型先验知识解决个性化路由问题，显著提升了冷启动场景下的效率，具有重要应用前景",
    "研究亮点3：CT-Bench：计算机断层扫描中多模态病灶理解的基准数据集——填补了医学影像AI领域CT数据资源的空白，为病灶分割和报告生成研究提供了关键基础设施",
    "研究亮点1：论文《Rethinking Diffusion Models with Symmetries through Canonicalization with Applications to Molecular Graph Generation》的核心创新在于引入规范化技术处理对称性，避免了传统等变网络的复杂性，为分子图生成等对称敏感任务提供了更高效灵活的扩散模型框架。",
    "研究亮点2：论文《Qute: Towards Quantum-Native Database》的核心创新在于提出量子原生数据库架构，将量子计算深度集成到数据库系统中，通过直接编译查询为量子电路并在硬件上执行，有望显著提升大数据处理效率，推动量子计算在实际应用中的落地。",
    "研究亮点1：Atomix：面向可靠智能体工作流的及时、事务性工具使用——创新地将数据库事务语义引入LLM智能体工具调用，解决了外部系统操作中的副作用泄露和回滚问题，为工业级智能体部署提供了关键可靠性保障。",
    "研究亮点2：长上下文，少聚焦：通过隐私和个性化揭示LLM中的扩展差距——首次系统量化了上下文长度对隐私和个性化的影响，揭示了长上下文的注意力分散风险，为LLM在敏感场景的安全设计提供了实证基础。",
    "研究亮点3：面向几何深度学习的Orbifolds谱卷积——突破性地将Orbifolds理论引入深度学习，拓展了几何学习的数学基础，为处理复杂对称性数据（如分子结构）开辟了新方向，兼具理论深度和应用潜力。"
  ],
  "daily_summary": "今日AI研究动态显示，生成模型和多模态学习成为热点，多篇论文聚焦于扩散模型和跨模态对齐技术的优化，推动AI在创意内容和多源信息理解方面的突破。例如，文本到图像生成的精细化控制和视觉-语言任务的增强应用，突显了生成式AI向更可控、高效方向发展的趋势，同时多模态研究在医疗等领域的拓展，体现了AI技术向实际场景的深入迁移。\n\n此外，强化学习和图神经网络在机器人控制、推荐系统等应用中持续创新，强调样本效率和可扩展性。理论研究为这些进展提供基础支撑，而大语言模型和计算机视觉的改进，则推动AI系统更安全、鲁棒。整体上，今日研究突出了AI领域的交叉融合，如几何深度学习与科学计算的结合，以及多智能体系统的协作优化，预示着AI技术正加速向多学科、复杂任务渗透，未来发展将更注重效率、公平性和实际部署。"
}