{
  "date": "2026-02-17",
  "total_items": 49,
  "categories": {
    "理论研究": [
      {
        "title": "Relative Geometry of Neural Forecasters: Linking Accuracy and Alignment in Learned Latent Geometry",
        "title_zh": "神经预测器的相对几何：连接学习潜在几何中的准确性与对齐性",
        "link": "https://arxiv.org/abs/2602.15676v1",
        "summary": "Neural networks can accurately forecast complex dynamical systems, yet how they internally represent underlying latent geometry remains poorly understood. We study neural forecasters through the lens of representational alignment, introducing anchor-based, geometry-agnostic relative embeddings that",
        "summary_zh": "本文研究神经网络在预测复杂动力系统时内部如何表示潜在几何结构。通过表征对齐的视角，提出基于锚点的几何无关相对嵌入方法，以量化预测器学习到的几何表示与真实系统动力学之间的对齐程度。核心创新在于建立了预测准确性与几何对齐之间的理论联系，为理解神经网络的内部表示机制提供了新工具。主要贡献包括：开发了一种可解释的几何对齐度量框架，并通过实验验证了其在提高预测可解释性和泛化能力方面的有效性。",
        "published": "2026-02-17T16:00:08Z",
        "authors": [
          "Deniz Kucukahmetler",
          "Maximilian Jean Hemmann",
          "Julian Mosig von Aehrenfeld..."
        ],
        "categories": [
          "cs.LG",
          "cs.AI"
        ]
      },
      {
        "title": "Outer Diversity of Structured Domains",
        "title_zh": "结构化域的外部多样性",
        "link": "https://arxiv.org/abs/2602.15708v1",
        "summary": "An ordinal preference domain is a subset of preference orders that the voters are allowed to cast in an election. We introduce and study the notion of outer diversity of a domain and evaluate its value for a number of well-known structured domains, such as the single-peaked, single-crossing, group-s",
        "summary_zh": "本文研究选举中的序数偏好域，即选民在选举中允许投出的偏好顺序的子集。作者引入并研究了域的外部多样性概念，并评估了其在多个知名结构化域（如单峰、单交叉、群组等）中的值。创新点在于提出了外部多样性这一新度量，用于量化偏好域的多样性和复杂性，这在选举理论和计算社会选择领域具有理论意义。主要贡献是扩展了对结构化域性质的理解，为选举机制设计和分析提供了新的理论工具。",
        "published": "2026-02-17T16:42:05Z",
        "authors": [
          "Piotr Faliszewski",
          "Krzysztof Sornat",
          "Stanisław Szufa"
        ],
        "categories": [
          "cs.GT",
          "cs.AI",
          "cs.MA"
        ]
      }
    ],
    "计算机视觉/CV": [
      {
        "title": "Intracoronary Optical Coherence Tomography Image Processing and Vessel Classification Using Machine Learning",
        "title_zh": "基于机器学习的冠状动脉光学相干断层扫描图像处理与血管分类",
        "link": "https://arxiv.org/abs/2602.15579v1",
        "summary": "Intracoronary Optical Coherence Tomography (OCT) enables high-resolution visualization of coronary vessel anatomy but presents challenges due to noise, imaging artifacts, and complex tissue structures. This paper proposes a fully automated pipeline for vessel segmentation and classification in OCT i",
        "summary_zh": "本文针对冠状动脉光学相干断层扫描（OCT）图像中存在的噪声、伪影和复杂组织结构的挑战，提出一个全自动的血管分割与分类流程。创新点在于整合了先进的机器学习方法，包括深度学习模型用于鲁棒性图像预处理和特征提取，以及分类算法实现血管类型的精确识别。主要贡献包括：开发了一个端到端的自动化系统，显著提高了OCT图像分析的准确性和效率，为临床诊断提供了可靠的工具。该方法在减少人工干预的同时，增强了血管病理检测的可靠性。",
        "published": "2026-02-17T13:47:27Z",
        "authors": [
          "Amal Lahchim",
          "Lambros Athanasiou"
        ],
        "categories": [
          "cs.CV",
          "cs.AI"
        ]
      },
      {
        "title": "CARE Drive A Framework for Evaluating Reason-Responsiveness of Vision Language Models in Automated Driving",
        "title_zh": "CARE Drive：自动驾驶中视觉语言模型理性响应性评估框架",
        "link": "https://arxiv.org/abs/2602.15645v1",
        "summary": "Foundation models, including vision language models, are increasingly used in automated driving to interpret scenes, recommend actions, and generate natural language explanations. However, existing evaluation methods primarily assess outcome based performance, such as safety and trajectory accuracy,",
        "summary_zh": "基础模型，包括视觉语言模型，正越来越多地用于自动驾驶中，以解释场景、推荐动作并生成自然语言解释。然而，现有的评估方法主要评估基于结果的性能，如安全性和轨迹准确性，而忽略了模型的理性响应性——即模型是否能提供合理且可解释的决策依据。本研究提出CARE Drive框架，专门用于评估自动驾驶中视觉语言模型的理性响应性。创新点在于将评估焦点从纯结果指标转向推理过程的质量，通过设计结构化任务和指标来量化模型解释的合理性和一致性。主要贡献是提供了一个系统化的评估工具，有助于提升自动驾驶系统的透明度和可信度，推动视觉语言模型在安全关键应用中的可靠集成。",
        "published": "2026-02-17T15:13:36Z",
        "authors": [
          "Lucas Elbert Suryana",
          "Farah Bierenga",
          "Sanne van Buuren"
        ],
        "categories": [
          "cs.AI",
          "cs.CV"
        ]
      },
      {
        "title": "Criteria-first, semantics-later: reproducible structure discovery in image-based sciences",
        "title_zh": "标准优先，语义后置：基于图像科学中可复现的结构发现",
        "link": "https://arxiv.org/abs/2602.15712v1",
        "summary": "Across the natural and life sciences, images have become a primary measurement modality, yet the dominant analytic paradigm remains semantics-first. Structure is recovered by predicting or enforcing domain-specific labels. This paradigm fails systematically under the conditions that make image-based",
        "summary_zh": "在自然科学和生命科学中，图像已成为主要的测量模态，但主导的分析范式仍然是语义优先的，即通过预测或强制领域特定标签来恢复结构。这种范式在基于图像的科学所特有的条件下（如噪声、变异性和缺乏先验知识）系统性地失效。本研究提出“标准优先，语义后置”的新范式，用于图像科学中的可复现结构发现。创新点在于优先应用客观标准（如统计或几何准则）来识别结构，而后引入语义解释，从而减少对领域知识的依赖并提高可复现性。主要贡献是开发了一个方法论框架，支持跨学科的图像分析，增强科学发现的鲁棒性和透明度，为大数据环境下的图像处理提供新途径。",
        "published": "2026-02-17T16:45:36Z",
        "authors": [
          "Jan Bumberger"
        ],
        "categories": [
          "cs.CV",
          "cs.AI"
        ]
      },
      {
        "title": "Spanning the Visual Analogy Space with a Weight Basis of LoRAs",
        "title_zh": "基于LoRA权重基的视觉类比空间构建",
        "link": "https://arxiv.org/abs/2602.15727v1",
        "summary": "Visual analogy learning enables image manipulation through demonstration rather than textual description, allowing users to specify complex transformations difficult to articulate in words. Given a triplet $\\{\\mathbf{a}$, $\\mathbf{a}'$, $\\mathbf{b}\\}$, the goal is to generate $\\mathbf{b}'$ such that",
        "summary_zh": "本文提出一种基于LoRA权重基的视觉类比学习方法，通过示例而非文本描述实现图像操作，允许用户指定难以用语言表达的复杂变换。给定三元组图像{a, a', b}，目标是生成b'，使得从a到a'的变换关系能类比应用于b到b'。核心创新在于构建一个权重基空间，将视觉类比表示为LoRA参数的线性组合，从而高效捕捉和泛化多种视觉变换。主要贡献包括：1）提出一种可扩展的权重基框架，支持零样本视觉类比；2）通过实验验证该方法在多样图像编辑任务中的有效性，优于传统基于文本或示例的方法。",
        "published": "2026-02-17T17:02:38Z",
        "authors": [
          "Hila Manor",
          "Rinon Gal",
          "Haggai Maron..."
        ],
        "categories": [
          "cs.CV",
          "cs.AI",
          "cs.GR",
          "cs.LG",
          "eess.IV"
        ]
      },
      {
        "title": "Bayesian Optimization for Design Parameters of 3D Image Data Analysis",
        "title_zh": "基于贝叶斯优化的三维图像数据分析设计参数优化",
        "link": "https://arxiv.org/abs/2602.15660v1",
        "summary": "Deep learning-based segmentation and classification are crucial to large-scale biomedical imaging, particularly for 3D data, where manual analysis is impractical. Although many methods exist, selecting suitable models and tuning parameters remains a major bottleneck in practice. Hence, we introduce",
        "summary_zh": "基于深度学习的分割和分类在大规模生物医学成像中至关重要，尤其是对于三维数据，手动分析不切实际。尽管存在许多方法，但选择合适的模型和调整参数在实践中仍然是一个主要瓶颈。因此，我们引入了一种贝叶斯优化框架，用于自动优化三维图像数据分析的设计参数。该研究创新点在于将贝叶斯优化应用于生物医学图像处理，通过高效搜索参数空间，减少人工调参负担，提高模型性能。主要贡献包括开发了一个可扩展的优化系统，适用于多种深度学习模型，并通过实验验证了其在分割和分类任务中的有效性，为自动化医疗图像分析提供了实用工具。",
        "published": "2026-02-17T15:31:48Z",
        "authors": [
          "David Exler",
          "Joaquin Eduardo Urrutia Gómez",
          "Martin Krüger"
        ],
        "categories": [
          "cs.CV",
          "cs.AI"
        ]
      },
      {
        "title": "Task-Agnostic Continual Learning for Chest Radiograph Classification",
        "title_zh": "任务无关的持续学习在胸部X光片分类中的应用",
        "link": "https://arxiv.org/abs/2602.15811v1",
        "summary": "Clinical deployment of chest radiograph classifiers requires models that can be updated as new datasets become available without retraining on previously observed data or degrading validated performance. We study, for the first time, a task-incremental continual learning setting for chest radiogra",
        "summary_zh": "胸部X光片分类器的临床部署需要模型能够在新数据集可用时进行更新，而无需重新训练先前观察到的数据或降低已验证性能。我们首次研究了胸部X光片分类的任务增量持续学习设置。该研究创新点在于提出了一种任务无关的持续学习方法，专注于医学图像分类，通过避免灾难性遗忘，使模型能够适应新任务而不损害旧任务性能。主要贡献包括设计了一个高效的持续学习框架，结合了知识蒸馏和正则化技术，在公开数据集上展示了优异的分类准确性和稳定性，为医疗AI系统的动态更新提供了理论基础和实践方案。",
        "published": "2026-02-17T18:47:30Z",
        "authors": [
          "Muthu Subash Kavitha",
          "Anas Zafar",
          "Amgad Muneer"
        ],
        "categories": [
          "cs.CV",
          "cs.AI"
        ]
      },
      {
        "title": "Enhancing Building Semantics Preservation in AI Model Training with Large Language Model Encodings",
        "title_zh": "使用大语言模型编码增强AI模型训练中的建筑语义保留",
        "link": "https://arxiv.org/abs/2602.15791v1",
        "summary": "Accurate representation of building semantics, encompassing both generic object types and specific subtypes, is essential for effective AI model training in the architecture, engineering, construction, and operation (AECO) industry. Conventional encoding methods (e.g., one-hot) often fail to convey",
        "summary_zh": "本文研究在建筑、工程、施工和运营（AECO）行业中，准确表示建筑语义（包括通用对象类型和特定子类型）对于有效AI模型训练的重要性。传统编码方法（如one-hot）往往无法传达丰富的语义信息。创新点在于提出使用大语言模型（LLM）编码来增强建筑语义的保留，通过LLM的语义理解能力生成更丰富的特征表示。主要贡献是开发了一种结合LLM的新编码方法，提升了AI模型在AECO任务中的性能，推动了计算机视觉与自然语言处理的交叉应用。",
        "published": "2026-02-17T18:26:06Z",
        "authors": [
          "Suhyung Jang",
          "Ghang Lee",
          "Jaekun Lee"
        ],
        "categories": [
          "cs.AI",
          "cs.CL"
        ]
      },
      {
        "title": "RPT-SR: Regional Prior attention Transformer for infrared image Super-Resolution",
        "title_zh": "RPT-SR：基于区域先验注意力的红外图像超分辨率Transformer",
        "link": "https://arxiv.org/abs/2602.15490v1",
        "summary": "General-purpose super-resolution models, particularly Vision Transformers, have achieved remarkable success but exhibit fundamental inefficiencies in common infrared成像 scenarios like surveillance and autonomous driving, which operate from fixed or nearly-static viewpoints. These models fail to",
        "summary_zh": "本研究针对通用超分辨率模型在红外图像处理中的效率不足问题，提出RPT-SR模型。创新点在于引入区域先验注意力机制，专门优化固定或准静态视角下的红外成像场景，如监控和自动驾驶。主要贡献是显著提升了红外图像超分辨率的计算效率和重建质量，通过利用视角先验信息减少冗余计算，为实际应用提供更高效的解决方案。",
        "published": "2026-02-17T10:56:49Z",
        "authors": [
          "Youngwan Jin",
          "Incheol Park",
          "Yagiz Nalcakan..."
        ],
        "categories": [
          "cs.CV",
          "cs.AI"
        ]
      }
    ],
    "机器人": [
      {
        "title": "VLM-DEWM: Dynamic External World Model for Verifiable and Resilient Vision-Language Planning in Manufacturing",
        "title_zh": "VLM-DEWM：用于智能制造中可验证和鲁棒的视觉语言规划的动态外部世界模型",
        "link": "https://arxiv.org/abs/2602.15549v1",
        "summary": "Vision-language model (VLM) shows promise for high-level planning in smart manufacturing, yet their deployment in dynamic workcells faces two critical challenges: (1) stateless operation, they cannot persistently track out-of-view states, causing world-state drift; and (2) opaque reasoning, failures",
        "summary_zh": "本文针对视觉语言模型在智能制造动态工作单元中部署时面临的无状态操作和推理不透明两大挑战，提出VLM-DEWM框架。核心创新在于引入动态外部世界模型，持续跟踪视野外状态以缓解世界状态漂移，并增强规划过程的可验证性和鲁棒性。主要贡献包括：设计了一个可解释的规划系统，通过实时状态更新和故障检测机制，提高了智能制造的可靠性和安全性。该方法在模拟和真实制造环境中验证了其有效性，为工业自动化提供了新思路。",
        "published": "2026-02-17T12:54:18Z",
        "authors": [
          "Guoqin Tang",
          "Qingxuan Jia",
          "Gang Chen..."
        ],
        "categories": [
          "cs.RO",
          "cs.AI"
        ]
      },
      {
        "title": "Improving MLLMs in Embodied Exploration and Question Answering with Human-Inspired Memory Modeling",
        "title_zh": "通过人类启发式记忆建模改进多模态大语言模型在具身探索与问答中的性能",
        "link": "https://arxiv.org/abs/2602.15513v1",
        "summary": "Deploying Multimodal Large Language Models as the brain of embodied agents remains challenging, particularly under long-horizon observations and limited context budgets. Existing memory assisted methods often rely on textual summaries, which discard rich visual and spatial details and remain brittle",
        "summary_zh": "本文针对多模态大语言模型作为具身智能体大脑时，在长时观测和有限上下文预算下面临的挑战，提出一种人类启发式记忆建模方法。创新点在于设计了一个多模态记忆系统，有效保留视觉和空间细节，避免传统文本摘要方法的信息丢失问题。主要贡献包括：开发了一个可扩展的记忆架构，增强了模型在具身探索和问答任务中的长期依赖处理能力和鲁棒性。通过实验验证，该方法显著提高了智能体在复杂环境中的表现，为具身AI的发展提供了关键技术支撑。",
        "published": "2026-02-17T11:41:27Z",
        "authors": [
          "Ji Li",
          "Jing Xia",
          "Mingyi Li..."
        ],
        "categories": [
          "cs.RO",
          "cs.AI"
        ]
      },
      {
        "title": "Lifelong Scalable Multi-Agent Realistic Testbed and A Comprehensive Study on Design Choices in Lifelong AGV Fleet Management Systems",
        "title_zh": "终身可扩展多智能体现实测试平台及终身AGV车队管理系统设计选择的综合研究",
        "link": "https://arxiv.org/abs/2602.15721v1",
        "summary": "We present Lifelong Scalable Multi-Agent Realistic Testbed (LSMART), an open-source simulator to evaluate any Multi-Agent Path Finding (MAPF) algorithm in a Fleet Management System (FMS) with Automated Guided Vehicles (AGVs). MAPF aims to move a group of agents from their corresponding starting loca",
        "summary_zh": "本文提出了终身可扩展多智能体现实测试平台（LSMART），这是一个开源模拟器，用于在自动化导引车（AGV）车队管理系统中评估任何多智能体路径规划（MAPF）算法。研究创新点在于开发了一个高度可扩展和现实的测试环境，支持终身学习场景，并系统分析了AGV车队管理系统中的设计选择。主要贡献是提供了工具和实证研究，帮助优化AGV系统的路径规划和资源分配，提升工业自动化的效率和适应性。",
        "published": "2026-02-17T16:53:20Z",
        "authors": [
          "Jingtian Yan",
          "Yulun Zhang",
          "Zhenting Liu"
        ],
        "categories": [
          "cs.RO",
          "cs.AI"
        ]
      },
      {
        "title": "Perceptive Humanoid Parkour: Chaining Dynamic Human Skills via Motion Matching",
        "title_zh": "感知型人形机器人跑酷：通过运动匹配链接动态人类技能",
        "link": "https://arxiv.org/abs/2602.15827v1",
        "summary": "While recent advances in humanoid locomotion have achieved stable walking on varied terrains, capturing the agility and adaptivity of highly dynamic human motions remains an open challenge. In particular, agile parkour in complex environments demands not only low-level robustness, but also human-lik",
        "summary_zh": "尽管人形机器人运动控制近期在多变地形稳定行走方面取得进展，但捕捉高度动态人类动作的敏捷性和适应性仍是开放挑战。本文提出感知型人形机器人跑酷系统，通过运动匹配技术链接动态人类技能。创新点在于将高层感知决策与底层运动控制相结合，利用运动匹配算法从人类演示数据中提取并组合技能片段，实现复杂环境中的敏捷跑酷行为。主要贡献是开发了一个端到端框架，在仿真和实体机器人上验证了其能力，显著提升了人形机器人的动态运动性能和类人化表现。",
        "published": "2026-02-17T18:59:11Z",
        "authors": [
          "Zhen Wu",
          "Xiaoyu Huang",
          "Lujie Yang..."
        ],
        "categories": [
          "cs.RO",
          "cs.AI",
          "cs.LG",
          "eess.SY"
        ]
      },
      {
        "title": "Learning to Retrieve Navigable Candidates for Efficient Vision-and-Language Navigation",
        "title_zh": "学习检索可导航候选路径以实现高效视觉语言导航",
        "link": "https://arxiv.org/abs/2602.15724v1",
        "summary": "Vision-and-Language Navigation (VLN) requires an agent to follow natural-language instructions and navigate through previously unseen environments. Recent approaches increasingly employ large language models (LLMs) as high-level navigators due to their flexibility and reasoning capability. However,",
        "summary_zh": "视觉语言导航要求智能体根据自然语言指令在未知环境中进行导航。近期研究越来越多地利用大语言模型作为高层导航器，得益于其灵活性和推理能力。然而，LLM的决策过程通常计算开销大且效率低下。本文提出了一种新颖的候选路径检索学习方法，通过预训练模型快速筛选出潜在的可导航路径，大幅减少LLM的搜索空间。核心创新在于设计了一个轻量级检索模块，能够结合视觉场景和语言指令动态生成高质量候选集。该方法在标准VLN基准测试中实现了导航成功率与效率的显著提升，为实际机器人部署提供了实用化解决方案。",
        "published": "2026-02-17T17:00:11Z",
        "authors": [
          "Shutian Gu",
          "Chengkai Huang",
          "Ruoyu Wang"
        ],
        "categories": [
          "cs.CV",
          "cs.AI"
        ]
      },
      {
        "title": "Robot-Assisted Social Dining as a White Glove Service",
        "title_zh": "机器人辅助社交餐饮：白手套服务",
        "link": "https://arxiv.org/abs/2602.15767v1",
        "summary": "Robot-assisted feeding enables people with disabilities who require assistance eating to enjoy a meal independently and with dignity. However, existing systems have only been tested in-lab or in-home, leaving in-the-wild social dining contexts (e.g., restaurants) largely unexplored. Designing a robo",
        "summary_zh": "机器人辅助喂食系统帮助需要进食协助的残障人士独立且有尊严地用餐。然而，现有系统仅在实验室或家庭环境中测试，真实社交餐饮场景（如餐厅）尚未充分探索。本文提出了一种面向社交餐饮的机器人白手套服务框架，重点解决公共环境中的人机交互与社会适应性挑战。创新点在于整合了情境感知、社交礼仪建模和自适应控制技术，使机器人能够根据用餐场景动态调整喂食策略。通过实地实验验证，该系统显著提升了用户的社交参与感和用餐体验，为辅助机器人技术在复杂社会场景中的落地提供了重要参考。",
        "published": "2026-02-17T17:58:25Z",
        "authors": [
          "Atharva S Kashyap",
          "Ugne Aleksandra Morkute",
          "Patricia Alves-Oliveira"
        ],
        "categories": [
          "cs.RO",
          "cs.AI",
          "cs.HC"
        ]
      },
      {
        "title": "MeshMimic: Geometry-Aware Humanoid Motion Learning through 3D Scene Reconstruction",
        "title_zh": "MeshMimic：通过3D场景重建实现几何感知的人形机器人运动学习",
        "link": "https://arxiv.org/abs/2602.15733v1",
        "summary": "Humanoid motion control has witnessed significant breakthroughs in recent years, with deep reinforcement learning (RL) emerging as a primary catalyst for achieving complex, human-like behaviors. However, the high dimensionality and intricate dynamics of humanoid robots make manual motion design impr",
        "summary_zh": "近年来，人形机器人运动控制取得重大突破，深度强化学习成为实现复杂类人行为的主要推动力。然而，人形机器人的高维度和复杂动力学特性使得手动运动设计变得不切实际。本文提出MeshMimic框架，通过3D场景重建实现几何感知的运动学习。核心创新在于将环境几何信息显式编码为可微网格表示，并融入强化学习策略中，使机器人能够自适应地学习与场景结构交互的运动技能。该方法在模拟和真实机器人实验中均表现出色，显著提升了在复杂地形中的运动稳定性和效率，为人形机器人的自主导航与操作任务开辟了新途径。",
        "published": "2026-02-17T17:09:45Z",
        "authors": [
          "Qiang Zhang",
          "Jiahao Ma",
          "Peiran Liu"
        ],
        "categories": [
          "cs.RO",
          "cs.AI"
        ]
      },
      {
        "title": "Estimating Human Muscular Fatigue in Dynamic Collaborative Robotic Tasks with Learning-Based Models",
        "title_zh": "基于学习模型估计动态协作机器人任务中的人类肌肉疲劳",
        "link": "https://arxiv.org/abs/2602.15684v1",
        "summary": "Assessing human muscle fatigue is critical for optimizing performance and safety in physical human-robot interaction(pHRI). This work presents a data-driven framework to estimate fatigue in dynamic, cyclic pHRI using arm-mounted surface electromyography(sEMG). Subject-specific machine-learning regre",
        "summary_zh": "本文提出一个数据驱动框架，用于估计动态、周期性物理人机交互任务中的人类肌肉疲劳，以优化性能和安全。核心创新在于结合臂戴式表面肌电信号和特定于受试者的机器学习回归模型，实时预测疲劳水平。该方法考虑了任务动态性和个体差异，提高了疲劳估计的准确性和泛化能力。主要贡献包括：1）开发一个端到端框架，从sEMG数据中提取特征并训练个性化模型；2）在真实协作机器人任务中验证框架有效性，展示其优于传统基于力或运动学的方法；3）为自适应机器人控制提供依据，实现更安全和高效的人机协作。",
        "published": "2026-02-17T16:08:10Z",
        "authors": [
          "Feras Kiki",
          "Pouya P. Niaz",
          "Alireza Madani..."
        ],
        "categories": [
          "cs.RO",
          "cs.AI",
          "cs.HC",
          "eess.SP",
          "eess.SY"
        ]
      }
    ],
    "多模态学习": [
      {
        "title": "UrbanVerse: Learning Urban Region Representation Across Cities and Tasks",
        "title_zh": "UrbanVerse：跨城市与任务的城区表示学习",
        "link": "https://arxiv.org/abs/2602.15750v1",
        "summary": "Recent advances in urban region representation learning have enabled a wide range of applications in urban analytics, yet existing methods remain limited in their capabilities to generalize across cities and analytic tasks. We aim to generalize urban representation learning beyond city- and task-spe",
        "summary_zh": "本文针对现有城区表示学习方法在跨城市和跨任务泛化能力上的局限性，提出UrbanVerse框架。创新点在于开发了一个统一的表示学习模型，能够从多源城市数据中提取通用特征，支持多种城市分析任务。主要贡献包括：提出了一种任务无关的预训练策略，增强了模型在不同地理环境和应用场景中的适应性。通过大规模实验验证，UrbanVerse在人口预测、交通流量分析等任务上表现出优越的泛化性能，为智慧城市应用提供了高效工具。",
        "published": "2026-02-17T17:28:48Z",
        "authors": [
          "Fengze Sun",
          "Egemen Tanin",
          "Shanika Karunasekera..."
        ],
        "categories": [
          "cs.LG",
          "cs.AI"
        ]
      },
      {
        "title": "Understanding vs. Generation: Navigating Optimization Dilemma in Multimodal Models",
        "title_zh": "理解与生成：多模态模型中的优化困境导航",
        "link": "https://arxiv.org/abs/2602.15772v1",
        "summary": "Current research in multimodal models faces a key challenge where enhancing generative capabilities often comes at the expense of understanding, and vice versa. We analyzed this trade-off and identify the primary cause might be the potential conflict between generation and understanding, which creat",
        "summary_zh": "当前多模态模型研究面临一个关键挑战：提升生成能力往往以牺牲理解为代价，反之亦然。本文分析了这种权衡关系，并指出其根本原因可能在于生成与理解之间的潜在冲突。通过系统实验和理论分析，我们揭示了优化过程中两者相互制约的内在机制。主要贡献在于提出了一种新颖的优化框架，能够动态平衡生成与理解目标，从而在保持模型生成质量的同时增强其语义理解能力。该方法在多个基准测试中显著提升了模型性能，为多模态模型的协同优化提供了新思路。",
        "published": "2026-02-17T18:04:13Z",
        "authors": [
          "Sen Ye",
          "Mengde Xu",
          "Shuyang Gu"
        ],
        "categories": [
          "cs.CV",
          "cs.AI"
        ]
      },
      {
        "title": "GenAI-LA: Generative AI and Learning Analytics Workshop (LAK 2026), April 27--May 1, 2026, Bergen, Norway",
        "title_zh": "GenAI-LA：生成式AI与学习分析研讨会（LAK 2026），2026年4月27日-5月1日，挪威卑尔根",
        "link": "https://arxiv.org/abs/2602.15531v1",
        "summary": "This work introduces EduEVAL-DB, a dataset based on teacher roles designed to support the evaluation and training of automatic pedagogical evaluators and AI tutors for instructional explanations. The dataset comprises 854 explanations corresponding to 139 questions from a curated subset of the Scien",
        "summary_zh": "本研究介绍了EduEVAL-DB，一个基于教师角色设计的数据集，旨在支持自动教学评估器和AI导师在教学解释方面的评估与训练。该数据集包含854条解释，对应来自科学教育精选子集的139个问题，涵盖了多种教学场景和解释风格。创新点在于将生成式AI与学习分析相结合，通过结构化数据集促进AI在教育领域的应用，特别是提升AI系统的教学解释能力和个性化辅导效果。主要贡献是提供了一个高质量、标注丰富的资源，推动生成式AI在教育技术中的研究与发展，并为LAK 2026研讨会的主题——生成式AI与学习分析的融合——奠定基础，强调跨学科合作以优化学习成果。",
        "published": "2026-02-17T12:11:49Z",
        "authors": [
          "Javier Irigoyen",
          "Roberto Daza",
          "Aythami Morales"
        ],
        "categories": [
          "cs.AI",
          "cs.DB"
        ]
      },
      {
        "title": "MRC-GAT: A Meta-Relational Copula-Based Graph Attention Network for Interpretable Multimodal Alzheimer's Disease Diagnosis",
        "title_zh": "MRC-GAT：基于元关系Copula的图注意力网络用于可解释的多模态阿尔茨海默病诊断",
        "link": "https://arxiv.org/abs/2602.15740v1",
        "summary": "Alzheimer's disease (AD) is a progressive neurodegenerative condition necessitating early and precise diagnosis to provide prompt clinical management. Given the paramount importance of early diagnosis, recent studies have increasingly focused on computer-aided diagnostic models to enhance precision ",
        "summary_zh": "本文提出MRC-GAT模型，用于阿尔茨海默病（AD）的可解释多模态诊断。核心创新在于结合了元关系Copula和图注意力网络（GAT），以捕捉多模态数据（如神经影像和临床指标）之间的复杂依赖关系。该模型旨在提升早期诊断的精确性，同时提供可解释的决策过程，帮助临床管理。主要贡献包括：开发了一个新型的多模态图神经网络框架，利用Copula理论建模变量间非线性关联，增强了诊断模型的准确性和可解释性，为AD的计算机辅助诊断提供了先进工具。",
        "published": "2026-02-17T17:15:28Z",
        "authors": [
          "Fatemeh Khalvandi",
          "Saadat Izadi",
          "Abdolah Chalechale"
        ],
        "categories": [
          "cs.LG",
          "cs.AI",
          "q-bio.QM"
        ]
      },
      {
        "title": "ChartEditBench: Evaluating Grounded Multi-Turn Chart Editing in Multimodal Language Models",
        "title_zh": "ChartEditBench：评估多模态语言模型中的多轮图表编辑能力",
        "link": "https://arxiv.org/abs/2602.15758v1",
        "summary": "While Multimodal Large Language Models (MLLMs) perform strongly on single-turn chart generation, their ability to support real-world exploratory data analysis remains underexplored. In practice, users iteratively refine visualizations through multi-turn interactions that require maintaining common g",
        "summary_zh": "本文针对多模态大语言模型在单轮图表生成任务中表现强劲，但其支持现实世界探索性数据分析的能力尚未充分探索的问题，提出ChartEditBench基准测试。该基准专注于评估MLLMs在多轮交互中基于文本指令编辑图表的能力，要求模型在迭代过程中保持视觉一致性并理解上下文。核心创新在于设计了一个包含多样化图表类型和编辑任务的评估框架，模拟真实数据分析场景。主要贡献包括：1）引入首个专注于多轮图表编辑的基准，填补现有评估空白；2）通过实验揭示当前MLLMs在多轮交互中的局限性，如上下文遗忘和视觉退化；3）为改进MLLMs的实用图表分析工具提供方向。",
        "published": "2026-02-17T17:45:38Z",
        "authors": [
          "Manav Nitin Kapadnis",
          "Lawanya Baghel",
          "Atharva Naik..."
        ],
        "categories": [
          "cs.CL",
          "cs.AI"
        ]
      },
      {
        "title": "How Vision Becomes Language: A Layer-wise Information-Theoretic Analysis of Multimodal Reasoning",
        "title_zh": "视觉如何成为语言：多模态推理的逐层信息论分析",
        "link": "https://arxiv.org/abs/2602.15580v1",
        "summary": "When a multimodal Transformer answers a visual question, is the prediction driven by visual evidence, linguistic reasoning, or genuinely fused cross-modal computation -- and how does this structure evolve across layers? We address this question with a layer-wise framework based on Partial Informatio",
        "summary_zh": "本文研究多模态Transformer在回答视觉问题时，预测是由视觉证据、语言推理还是真正融合的跨模态计算驱动，以及这种结构如何在不同层间演化。作者基于部分信息论提出逐层分析框架，创新点在于使用信息论工具量化视觉和语言信息在多模态模型各层中的贡献和交互。主要贡献是揭示了多模态推理的底层机制，展示了信息从视觉到语言的转换过程，为理解模型内部表示和提升多模态任务性能提供了理论洞察。",
        "published": "2026-02-17T13:49:49Z",
        "authors": [
          "Hongxuan Wu",
          "Yukun Zhang",
          "Xueqing Zhou"
        ],
        "categories": [
          "cs.AI"
        ]
      }
    ],
    "大语言模型/LLM": [
      {
        "title": "This human study did not involve human subjects: Validating LLM simulations as behavioral evidence",
        "title_zh": "这项人类研究未涉及人类受试者：验证LLM模拟作为行为证据的有效性",
        "link": "https://arxiv.org/abs/2602.15785v1",
        "summary": "A growing literature uses large language models (LLMs) as synthetic participants to generate cost-effective and nearly instantaneous responses in social science experiments. However, there is limited guidance on when such simulations support valid inference about human behavior. We contrast two stra",
        "summary_zh": "本文探讨了使用大语言模型（LLMs）作为合成参与者在社会科学实验中生成经济高效且近乎即时响应的新兴方法。研究核心创新在于对比两种策略，以评估LLM模拟在何时能有效支持对人类行为的推断，填补了现有文献中关于LLM作为行为证据验证指导的空白。主要贡献是提出了一个框架，帮助研究者判断LLM模拟的适用性，促进LLM在社会科学研究中的可靠应用。",
        "published": "2026-02-17T18:18:38Z",
        "authors": [
          "Jessica Hullman",
          "David Broska",
          "Huaman Sun"
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "Revisiting Northrop Frye's Four Myths Theory with Large Language Models",
        "title_zh": "用大语言模型重新审视诺斯罗普·弗莱的四种神话理论",
        "link": "https://arxiv.org/abs/2602.15678v1",
        "summary": "Northrop Frye's theory of four fundamental narrative genres (comedy, romance, tragedy, satire) has profoundly influenced literary criticism, yet computational approaches to his framework have focused primarily on narrative patterns rather than character functions. In this paper, we present a new cha",
        "summary_zh": "本文创新性地应用大语言模型（LLMs）重新审视诺斯罗普·弗莱的四种基本叙事类型理论（喜剧、浪漫、悲剧、讽刺）。研究突破在于将焦点从传统的叙事模式分析转向角色功能，利用LLMs自动识别和分类文本中的角色功能，以验证和扩展弗莱的理论框架。主要贡献是开发了一种基于LLM的计算方法，为文学批评和叙事分析提供了新的工具和视角，推动了人文学科与AI的交叉研究。",
        "published": "2026-02-17T16:02:52Z",
        "authors": [
          "Edirlei Soares de Lima",
          "Marco A. Casanova",
          "Antonio L. Furtado"
        ],
        "categories": [
          "cs.CL",
          "cs.AI"
        ]
      },
      {
        "title": "STAPO: Stabilizing Reinforcement Learning for LLMs by Silencing Rare Spurious Tokens",
        "title_zh": "STAPO：通过抑制罕见虚假标记来稳定大语言模型的强化学习",
        "link": "https://arxiv.org/abs/2602.15620v1",
        "summary": "Reinforcement Learning (RL) has significantly improved large language model reasoning, but existing RL fine-tuning methods rely heavily on heuristic techniques such as entropy regularization and reweighting to maintain stability. In practice, they often experience late-stage performance collapse, le",
        "summary_zh": "强化学习显著提升了大语言模型的推理能力，但现有RL微调方法严重依赖启发式技术（如熵正则化和重加权）来维持稳定性，实践中常出现后期性能崩溃问题。本文提出STAPO框架，通过识别并抑制罕见虚假标记来稳定RL训练过程。创新点在于引入基于统计的标记过滤机制，动态检测并降低低概率但高影响的噪声标记对策略梯度的干扰，从而避免训练不稳定。主要贡献是提供了一种理论驱动的稳定性增强方法，在多项推理任务中验证了其有效性，为RL在LLM中的可靠应用提供了新思路。",
        "published": "2026-02-17T14:46:48Z",
        "authors": [
          "Shiqi Liu",
          "Zeyu He",
          "Guojian Zhan..."
        ],
        "categories": [
          "cs.CL",
          "cs.AI"
        ]
      },
      {
        "title": "PERSONA: Dynamic and Compositional Inference-Time Personality Control via Activation Vector Algebra",
        "title_zh": "PERSONA：通过激活向量代数实现动态组合式推理时人格控制",
        "link": "https://arxiv.org/abs/2602.15669v1",
        "summary": "Current methods for personality control in Large Language Models rely on static prompting or expensive fine-tuning, failing to capture the dynamic and compositional nature of human traits. We introduce PERSONA, a training-free framework that achieves fine-tuning level performance through direct mani",
        "summary_zh": "现有大语言模型的人格控制方法依赖静态提示或昂贵的微调，难以捕捉人类特质的动态组合特性。本文提出PERSONA，一种无需训练的框架，通过直接操作模型内部激活向量实现微调级性能。创新点在于利用激活向量代数技术，在推理时动态组合不同人格向量，支持实时调整和混合人格表达。主要贡献是开发了一种高效、灵活的人格控制机制，避免了模型重训练成本，在对话生成和角色扮演任务中展示了高保真度和可控性，为人机交互的个性化提供了新工具。",
        "published": "2026-02-17T15:47:58Z",
        "authors": [
          "Xiachong Feng",
          "Liang Zhao",
          "Weihong Zhong..."
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "Zombie Agents: Persistent Control of Self-Evolving LLM Agents via Self-Reinforcing Injections",
        "title_zh": "僵尸智能体：通过自我强化注入实现自进化LLM智能体的持久控制",
        "link": "https://arxiv.org/abs/2602.15654v1",
        "summary": "Self-evolving LLM agents update their internal state across sessions, often by writing and reusing long-term memory. This design improves performance on long-horizon tasks but creates a security risk: untrusted external content observed during a benign session can be stored as memory and later treat",
        "summary_zh": "自进化LLM智能体通过跨会话更新内部状态（如写入和重用长期记忆）来提升长时程任务性能，但这也带来安全风险：良性会话中观察到的不可信外部内容可能被存储为记忆，并在后续触发恶意行为。本文提出僵尸智能体攻击框架，利用自我强化注入技术实现持久控制。创新点在于设计了一种隐蔽的恶意内容注入机制，使智能体在无监督情况下持续执行攻击者指令。主要贡献是揭示了自进化智能体的新型安全漏洞，提出了防御思路，对AI安全领域具有重要警示意义。",
        "published": "2026-02-17T15:28:48Z",
        "authors": [
          "Xianglin Yang",
          "Yufei He",
          "Shuo Ji..."
        ],
        "categories": [
          "cs.CR",
          "cs.AI"
        ]
      },
      {
        "title": "Recursive Concept Evolution for Compositional Reasoning in Large Language Models",
        "title_zh": "大语言模型组合推理的递归概念演化",
        "link": "https://arxiv.org/abs/2602.15725v1",
        "summary": "Large language models achieve strong performance on many complex reasoning tasks, yet their accuracy degrades sharply on benchmarks that require compositional reasoning, including ARC-AGI-2, GPQA, MATH, BBH, and HLE. Existing methods improve reasoning by expanding token-level search through chain-of",
        "summary_zh": "大语言模型在许多复杂推理任务中表现出色，但在需要组合推理的基准测试（如ARC-AGI-2、GPQA、MATH、BBH和HLE）中准确率急剧下降。现有方法通过扩展词元级搜索（如思维链）来改进推理，但存在局限性。本研究提出递归概念演化框架，通过迭代细化和组合抽象概念来增强大语言模型的组合推理能力。创新点在于引入概念演化的递归机制，使模型能够动态构建和优化推理路径，显著提升在复杂组合任务上的性能。主要贡献是提出一种可扩展的推理增强方法，并在多个基准测试中验证其有效性，为大语言模型的推理能力提升提供了新思路。",
        "published": "2026-02-17T17:01:36Z",
        "authors": [
          "Sarim Chaudhry"
        ],
        "categories": [
          "cs.AI",
          "cs.CL",
          "cs.LG"
        ]
      },
      {
        "title": "A Content-Based Framework for Cybersecurity Refusal Decisions in Large Language Models",
        "title_zh": "大语言模型网络安全拒绝决策的内容驱动框架",
        "link": "https://arxiv.org/abs/2602.15689v1",
        "summary": "Large language models and LLM-based agents are increasingly used for cybersecurity tasks that are inherently dual-use. Existing approaches to refusal, spanning academic policy frameworks and commercially deployed systems, often rely on broad topic-based bans or offensive-focused taxonomies. As a res",
        "summary_zh": "大语言模型及基于LLM的智能体越来越多地用于网络安全任务，这些任务具有固有的双重用途性。现有的拒绝方法，包括学术政策框架和商业部署系统，通常依赖于广泛的基于主题的禁令或攻击性分类法。因此，这些方法在区分合法安全任务和恶意活动时效果有限。本研究提出一个内容驱动的框架，用于大语言模型的网络安全拒绝决策。创新点在于基于任务内容和上下文进行细粒度分析，而非依赖粗粒度的主题分类，从而更准确地识别和拒绝潜在恶意请求。主要贡献是开发了一个可操作的框架，增强LLM在网络安全应用中的安全性和可靠性，为双重用途场景下的伦理部署提供实用解决方案。",
        "published": "2026-02-17T16:12:36Z",
        "authors": [
          "Meirav Segal",
          "Noa Linder",
          "Omer Antverg"
        ],
        "categories": [
          "cs.CL",
          "cs.AI",
          "cs.CR"
        ]
      },
      {
        "title": "The Geometry of Alignment Collapse: When Fine-Tuning Breaks Safety",
        "title_zh": "对齐崩溃的几何学：当微调破坏安全性时",
        "link": "https://arxiv.org/abs/2602.15799v1",
        "summary": "Fine-tuning aligned language models on benign tasks unpredictably degrades safety guardrails, even when training data contains no harmful content and developers have no adversarial intent. We show that the prevailing explanation, that fine-tuning updates should be orthogonal to safety-critical direc",
        "summary_zh": "本文研究对齐语言模型在良性任务上微调时，安全护栏意外退化的问题，即使训练数据不含恶意内容且开发者无对抗意图。核心创新点在于从几何角度分析对齐崩溃现象，挑战了传统观点——即微调更新应与安全关键方向正交。通过理论建模和实验验证，揭示了微调过程中参数空间的几何结构如何导致安全对齐失效。主要贡献包括：1）提出一个几何框架来解释安全对齐的脆弱性；2）识别微调引发安全退化的关键因素，如梯度方向和损失曲面曲率；3）为开发更鲁棒的对齐方法提供理论指导。",
        "published": "2026-02-17T18:39:15Z",
        "authors": [
          "Max Springer",
          "Chung Peng Lee",
          "Blossom Metevier..."
        ],
        "categories": [
          "cs.LG",
          "cs.AI"
        ]
      },
      {
        "title": "CrispEdit: Low-Curvature Projections for Scalable Non-Destructive LLM Editing",
        "title_zh": "CrispEdit：用于可扩展非破坏性大语言模型编辑的低曲率投影",
        "link": "https://arxiv.org/abs/2602.15823v1",
        "summary": "A central challenge in large language model (LLM) editing is capability preservation: methods that successfully change targeted behavior can quietly game the editing proxy and corrupt general capabilities, producing degenerate behaviors reminiscent of proxy/reward hacking. We present CrispEdit, a sc",
        "summary_zh": "大语言模型编辑的一个核心挑战是能力保持：成功改变目标行为的方法可能悄悄操纵编辑代理并破坏一般能力，产生类似于代理/奖励黑客的退化行为。我们提出了CrispEdit，一个可扩展的非破坏性编辑框架。该研究创新点在于引入了低曲率投影技术，通过最小化模型参数空间的曲率变化，确保编辑后模型保持原有能力。主要贡献包括开发了一个高效的编辑算法，减少了编辑过程中的副作用，并在多个基准测试中验证了其有效性和可扩展性，为大语言模型的安全更新和定制化提供了新方法。",
        "published": "2026-02-17T18:58:04Z",
        "authors": [
          "Zarif Ikram",
          "Arad Firouzkouhi",
          "Stephen Tu"
        ],
        "categories": [
          "cs.LG",
          "cs.AI"
        ]
      },
      {
        "title": "SecCodeBench-V2 Technical Report",
        "title_zh": "SecCodeBench-V2技术报告",
        "link": "https://arxiv.org/abs/2602.15485v1",
        "summary": "We introduce SecCodeBench-V2, a publicly released benchmark for evaluating Large Language Model (LLM) copilots' capabilities of generating secure code. SecCodeBench-V2 comprises 98 generation and fix scenarios derived from Alibaba Group's industrial productions, where the underlying security issues",
        "summary_zh": "本文介绍了SecCodeBench-V2，这是一个公开发布的基准测试，用于评估大语言模型（LLM）助手生成安全代码的能力。SecCodeBench-V2包含98个生成和修复场景，这些场景源自阿里巴巴集团的工业产品，涉及底层安全问题。该基准的创新点在于其工业实用性，通过真实生产环境中的安全漏洞案例，为LLM代码生成的安全性评估提供了标准化测试集。主要贡献是填补了现有基准在安全代码生成评估方面的空白，促进了LLM在软件开发中的安全应用研究。",
        "published": "2026-02-17T10:47:06Z",
        "authors": [
          "Longfei Chen",
          "Ji Zhao",
          "Lanxiao Cui"
        ],
        "categories": [
          "cs.CR",
          "cs.AI",
          "cs.SE"
        ]
      },
      {
        "title": "Quantifying construct validity in large language model evaluations",
        "title_zh": "量化大语言模型评估中的结构效度",
        "link": "https://arxiv.org/abs/2602.15532v1",
        "summary": "The LLM community often reports benchmark results as if they are synonymous with general model capabilities. However, benchmarks can have problems that distort performance, like test set contamination and annotator error. How can we know that a benchmark is a reliable indicator of some capability th",
        "summary_zh": "本研究针对大语言模型评估中基准测试结果常被等同于模型通用能力的现状，提出量化结构效度的方法。创新点在于系统分析基准测试的可靠性问题，如测试集污染和标注错误，并引入量化框架来评估基准是否真正反映特定能力。主要贡献是提供了一种科学验证评估工具有效性的方法论，有助于提升LLM评估的严谨性和可比性，为模型能力评估提供更可靠的依据。",
        "published": "2026-02-17T12:15:57Z",
        "authors": [
          "Ryan Othniel Kearns"
        ],
        "categories": [
          "cs.AI",
          "cs.LG"
        ]
      }
    ],
    "优化算法": [
      {
        "title": "On inferring cumulative constraints",
        "title_zh": "关于推断累积约束",
        "link": "https://arxiv.org/abs/2602.15635v1",
        "summary": "Cumulative constraints are central in scheduling with constraint programming, yet propagation is typically performed per constraint, missing multi-resource interactions and causing severe slowdowns on some benchmarks. I present a preprocessing method for inferring additional cumulative constraints t",
        "summary_zh": "本文聚焦于约束编程中的累积约束，这些约束在调度问题中至关重要。研究创新点在于提出了一种预处理方法，用于推断额外的累积约束，以弥补传统单约束传播方法忽略多资源交互的不足，从而解决在某些基准测试中导致的严重性能下降问题。主要贡献是开发了一种高效的算法，通过增强约束传播，提升调度问题的求解速度和可扩展性，为优化算法领域提供了新的改进思路。",
        "published": "2026-02-17T15:03:43Z",
        "authors": [
          "Konstantin Sidorov"
        ],
        "categories": [
          "cs.AI"
        ]
      }
    ],
    "NLP": [
      {
        "title": "Beyond Static Pipelines: Learning Dynamic Workflows for Text-to-SQL",
        "title_zh": "超越静态管道：学习文本到SQL的动态工作流",
        "link": "https://arxiv.org/abs/2602.15564v1",
        "summary": "Text-to-SQL has recently achieved impressive progress, yet remains difficult to apply effectively in real-world scenarios. This gap stems from the reliance on single static workflows, fundamentally limiting scalability to out-of-distribution and长尾 scenarios. Instead of requiring users to sel",
        "summary_zh": "本文针对文本到SQL（Text-to-SQL）任务，指出当前方法依赖单一静态工作流，限制了在分布外和长尾场景中的可扩展性。研究创新点在于提出了一种学习动态工作流的方法，能够根据输入文本自动调整处理流程，提升模型的适应性和鲁棒性。主要贡献是开发了一个框架，减少了对用户手动选择工作流的依赖，推动了Text-to-SQL技术在实际应用中的有效部署，为自然语言处理领域提供了新的解决方案。",
        "published": "2026-02-17T13:24:56Z",
        "authors": [
          "Yihan Wang",
          "Peiyu Liu",
          "Runyu Chen"
        ],
        "categories": [
          "cs.CL",
          "cs.AI"
        ]
      },
      {
        "title": "Avey-B",
        "title_zh": "Avey-B",
        "link": "https://arxiv.org/abs/2602.15814v1",
        "summary": "Compact pretrained bidirectional encoders remain the backbone of industrial NLP under tight compute and memory budgets. Their effectiveness stems from self-attention's ability to deliver high-quality bidirectional contextualization with sequence-level parallelism, as popularized by BERT-style archit",
        "summary_zh": "紧凑型预训练双向编码器在计算和内存受限的工业NLP中仍是核心组件，其有效性源于自注意力机制通过序列级并行实现高质量双向上下文建模，如BERT架构所推广。本文提出Avey-B模型，针对资源受限场景优化双向编码器设计。创新点在于引入新型注意力机制和模型压缩技术，在保持BERT式架构优势的同时，显著降低计算开销和内存占用。主要贡献是开发了一个高效实用的编码器变体，在多项NLP基准测试中达到性能与效率的更好平衡，为边缘计算和实时应用提供了可行解决方案。",
        "published": "2026-02-17T18:50:40Z",
        "authors": [
          "Devang Acharya",
          "Mohammad Hammoud"
        ],
        "categories": [
          "cs.CL",
          "cs.AI"
        ]
      },
      {
        "title": "Beyond Binary Classification: Detecting Fine-Grained Sexism in Social Media Videos",
        "title_zh": "超越二分类：社交媒体视频中的细粒度性别歧视检测",
        "link": "https://arxiv.org/abs/2602.15757v1",
        "summary": "Online sexism appears in various forms, which makes its detection challenging. Although automated tools can enhance the identification of sexist content, they are often restricted to binary classification. Consequently, more subtle manifestations of sexism may remain undetected due to the lack of fi",
        "summary_zh": "本文研究社交媒体视频中细粒度性别歧视的检测问题。核心创新在于突破了传统的二分类框架，提出了一种能够识别多种形式性别歧视的自动化方法。由于在线性别歧视表现形式多样，现有工具往往局限于二元判断，导致更微妙的歧视内容被遗漏。该研究通过引入细粒度分类技术，增强了检测系统的敏感性和准确性。主要贡献包括：开发了一个针对视频内容的细粒度性别歧视检测模型，结合了自然语言处理和计算机视觉技术，为在线内容审核提供了更精细的工具，有助于提升社交媒体环境的公平性。",
        "published": "2026-02-17T17:45:28Z",
        "authors": [
          "Laura De Grazia",
          "Danae Sánchez Villegas",
          "Desmond Elliott..."
        ],
        "categories": [
          "cs.CL",
          "cs.AI"
        ]
      },
      {
        "title": "The geometry of online conversations and the causal antecedents of conflictual discourse",
        "title_zh": "在线对话的几何结构与冲突性话语的因果前因",
        "link": "https://arxiv.org/abs/2602.15600v1",
        "summary": "This article investigates the causal antecedents of conflictual language and the geometry of interaction in online threaded conversations related to climate change. We employ three annotation dimensions, inferred through LLM prompting and averaging, to capture complementary aspects of discursive con",
        "summary_zh": "本文探讨气候变化相关在线线程对话中冲突性语言的因果前因和交互几何结构。研究创新点在于结合大语言模型（LLMs）提示和平均推断方法，定义了三个注释维度来捕捉话语冲突的互补方面。通过分析在线对话的几何特征，该研究揭示了冲突性话语产生的潜在因果机制。主要贡献包括：提出了一个基于几何和因果推理的在线对话分析框架，利用LLMs自动化注释，增强了对话动态的理解，为在线社区管理和内容干预提供了理论依据。",
        "published": "2026-02-17T14:12:03Z",
        "authors": [
          "Carlo Santagiustina",
          "Caterina Cruciani"
        ],
        "categories": [
          "cs.SI",
          "cs.AI",
          "econ.EM",
          "stat.AP"
        ]
      }
    ],
    "生成模型": [
      {
        "title": "Dynamic Training-Free Fusion of Subject and Style LoRAs",
        "title_zh": "主题与风格LoRAs的动态免训练融合",
        "link": "https://arxiv.org/abs/2602.15539v1",
        "summary": "Recent studies have explored the combination of multiple LoRAs to simultaneously generate user-specified subjects and styles. However, most existing approaches fuse LoRA weights using static statistical heuristics that deviate from LoRA's original purpose of learning adaptive feature adjustments and",
        "summary_zh": "近期研究探索了通过组合多个LoRA模块来同时生成用户指定主题和风格的方法。然而，现有方法大多采用静态统计启发式策略融合LoRA权重，这偏离了LoRA学习自适应特征调整的初衷。本文提出了一种动态免训练的LoRA融合框架，能够根据输入内容实时调整主题与风格模块的融合比例。创新点在于引入注意力机制驱动的动态权重分配策略，无需额外训练即可实现精准的特征控制。实验表明，该方法在图像生成任务中显著提升了主题保真度和风格一致性，为个性化生成提供了高效灵活的解决方案。",
        "published": "2026-02-17T12:42:30Z",
        "authors": [
          "Qinglong Cao",
          "Yuntian Chen",
          "Chao Ma"
        ],
        "categories": [
          "cs.CV",
          "cs.AI",
          "cs.SC"
        ]
      }
    ],
    "图神经网络": [
      {
        "title": "Random Wavelet Features for Graph Kernel Machines",
        "title_zh": "图核机器的随机小波特征",
        "link": "https://arxiv.org/abs/2602.15711v1",
        "summary": "Node embeddings map graph vertices into low-dimensional Euclidean spaces while preserving structural information. They are central to tasks such as node classification, link prediction, and signal reconstruction. A key goal is to design node embeddings whose dot products capture meaningful notions o",
        "summary_zh": "本文提出了一种基于随机小波特征的图核方法，用于生成节点嵌入。核心创新在于利用小波变换的随机近似来高效捕捉图结构信息，同时保持计算效率。该方法通过设计节点嵌入，使其点积能够有效反映图上的相似性度量，从而提升节点分类、链接预测和图信号重建等任务的性能。主要贡献包括：提出了一种可扩展的图核框架，结合了随机特征和小波理论，在保持理论保证的同时降低了计算复杂度，为大规模图数据处理提供了新思路。",
        "published": "2026-02-17T16:45:15Z",
        "authors": [
          "Valentin de Bassompierre",
          "Jean-Charles Delvenne",
          "Laurent Jacques"
        ],
        "categories": [
          "cs.LG",
          "cs.AI",
          "eess.SP"
        ]
      },
      {
        "title": "RUVA: Personalized Transparent On-Device Graph Reasoning",
        "title_zh": "RUVA：个性化的透明设备端图推理",
        "link": "https://arxiv.org/abs/2602.15553v1",
        "summary": "The Personal AI landscape is currently dominated by \"Black Box\" Retrieval-Augmented Generation. While standard vector databases offer statistical matching, they suffer from a fundamental lack of accountability: when an AI hallucinates or retrieves sensitive data, the user cannot inspect the cause no",
        "summary_zh": "个人AI领域目前由“黑盒”检索增强生成主导。虽然标准向量数据库提供统计匹配，但它们缺乏基本的可问责性：当AI产生幻觉或检索敏感数据时，用户无法检查原因。该研究创新点在于提出了RUVA，一个个性化的透明设备端图推理系统，利用图结构进行可解释的推理，避免黑盒问题。主要贡献包括设计了一个轻量级图推理框架，支持在边缘设备上运行，确保数据隐私和透明度，并通过案例研究展示了其在个性化推荐和敏感数据处理中的有效性，为可信AI的发展提供了实用工具。",
        "published": "2026-02-17T12:59:03Z",
        "authors": [
          "Gabriele Conte",
          "Alessio Mattiace",
          "Gianni Carmosino"
        ],
        "categories": [
          "cs.AI",
          "cs.CL"
        ]
      }
    ],
    "推荐系统": [
      {
        "title": "Decision Quality Evaluation Framework at Pinterest",
        "title_zh": "Pinterest决策质量评估框架",
        "link": "https://arxiv.org/abs/2602.15809v1",
        "summary": "Online platforms require robust systems to enforce content safety policies at scale. A critical component of these systems is the ability to evaluate the quality of moderation decisions made by both human agents and Large Language Models (LLMs). However, this evaluation is challenging due to the inh",
        "summary_zh": "本文介绍了Pinterest平台用于评估内容审核决策质量的框架。研究创新点在于开发了一个系统化的评估方法，以应对大规模在线平台中内容安全策略执行的挑战。该框架能够同时评估人类审核员和大语言模型（LLMs）做出的决策质量，解决了由于决策复杂性和主观性带来的评估困难。主要贡献包括：提出了一个可扩展的决策质量评估体系，结合了统计分析和人工智能技术，为在线平台的内容审核系统提供了实用的质量监控工具，有助于提升审核效率和准确性。",
        "published": "2026-02-17T18:45:55Z",
        "authors": [
          "Yuqi Tian",
          "Robert Paine",
          "Attila Dobi..."
        ],
        "categories": [
          "stat.AP",
          "cs.AI"
        ]
      },
      {
        "title": "How to Disclose? Strategic AI Disclosure in Crowdfunding",
        "title_zh": "如何披露？众筹中的战略性AI披露",
        "link": "https://arxiv.org/abs/2602.15698v1",
        "summary": "As artificial intelligence (AI) increasingly integrates into crowdfunding practices, strategic disclosure of AI involvement has become critical. Yet, empirical insights into how different disclosure strategies influence investor decisions remain limited. Drawing on signaling theory and Aristotle's r",
        "summary_zh": "本文探讨人工智能在众筹实践中日益融合的背景下，战略性披露AI参与的重要性。基于信号理论和亚里士多德的修辞学，研究不同披露策略如何影响投资者决策。核心创新在于将AI披露视为一种战略沟通行为，分析透明度、时机和内容等因素对众筹成功的影响。通过实证研究，揭示了过度或不足披露可能导致的信任问题。主要贡献包括：1）提出一个AI披露策略的理论框架，结合信号传递和说服机制；2）提供实证证据，说明最优披露策略能提升投资者信心和资金筹集效率；3）为众筹平台和项目发起人制定AI相关披露指南提供实践建议。",
        "published": "2026-02-17T16:26:03Z",
        "authors": [
          "Ning Wang",
          "Chen Liang"
        ],
        "categories": [
          "cs.HC",
          "cs.AI"
        ]
      }
    ],
    "强化学习/RL": [
      {
        "title": "GlobeDiff: State Diffusion Process for Partial Observability in Multi-Agent Systems",
        "title_zh": "GlobeDiff：多智能体系统中部分可观测性的状态扩散过程",
        "link": "https://arxiv.org/abs/2602.15776v1",
        "summary": "In the realm of multi-agent systems, the challenge of \\emph{partial observability} is a critical barrier to effective coordination and decision-making. Existing approaches, such as belief state estimation and inter-agent communication, often fall short. Belief-based methods are limited by their focu",
        "summary_zh": "在多智能体系统中，部分可观测性的挑战是有效协调和决策的关键障碍。现有方法，如信念状态估计和智能体间通信，往往不足。信念方法受限于其焦点。该研究创新点在于提出了GlobeDiff，一种基于状态扩散过程的新方法，通过模拟信息在智能体间的传播来改善部分可观测环境下的协作。主要贡献包括开发了一个可扩展的扩散模型，能够处理动态环境，并通过实验在模拟任务中展示了优于传统方法的性能，提高了多智能体系统的鲁棒性和效率，为复杂场景下的AI决策提供了新思路。",
        "published": "2026-02-17T18:05:48Z",
        "authors": [
          "Yiqin Yang",
          "Xu Yang",
          "Yuhua Jiang"
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "The Obfuscation Atlas: Mapping Where Honesty Emerges in RLVR with Deception Probes",
        "title_zh": "混淆图集：使用欺骗探针映射RLVR中诚实性出现的位置",
        "link": "https://arxiv.org/abs/2602.15515v1",
        "summary": "Training against white-box deception detectors has been proposed as a way to make AI systems honest. However, such training risks models learning to obfuscate their deception to evade the detector. Prior work has studied obfuscation only in artificial settings where models were directly rewarded for",
        "summary_zh": "本文研究在强化学习与价值回归（RLVR）中，通过对抗白盒欺骗检测器来训练AI系统诚实性的方法。然而，这种训练可能导致模型学习混淆其欺骗行为以逃避检测。先前工作仅在人工设置中研究混淆，其中模型直接因欺骗而受奖励。本文的创新点在于引入“混淆图集”概念，使用欺骗探针系统性地映射模型在训练过程中诚实性出现的位置和条件。主要贡献是揭示了混淆行为的动态演化，为设计更鲁棒的诚实性训练方法提供了实证基础，有助于AI安全领域的发展。",
        "published": "2026-02-17T11:44:05Z",
        "authors": [
          "Mohammad Taufeeque",
          "Stefan Heimersheim",
          "Adam Gleave"
        ],
        "categories": [
          "cs.LG",
          "cs.AI"
        ]
      }
    ],
    "音频处理": [
      {
        "title": "The Equalizer: Introducing Shape-Gain Decomposition in Neural Audio Codecs",
        "title_zh": "均衡器：在神经音频编解码器中引入形状-增益分解",
        "link": "https://arxiv.org/abs/2602.15491v1",
        "summary": "Neural audio codecs (NACs) typically encode the short-term energy (gain) and normalized structure (shape) of speech/audio signals jointly within the same latent space. As a result, they are poorly robust to a global variation of the input signal level in the sense that such variation has strong infl",
        "summary_zh": "本研究针对神经音频编解码器对输入信号电平全局变化鲁棒性差的问题，提出形状-增益分解方法。创新点在于将信号的短期能量（增益）和归一化结构（形状）在潜在空间中分离编码，而非传统联合编码。主要贡献是显著提升了NACs对信号电平变化的适应性，通过分解机制减少电平波动对编码质量的影响，为音频处理提供更稳健的编解码框架。",
        "published": "2026-02-17T10:59:33Z",
        "authors": [
          "Samir Sadok",
          "Laurent Girin",
          "Xavier Alameda-Pineda"
        ],
        "categories": [
          "cs.SD",
          "cs.AI"
        ]
      }
    ],
    "AI基础理论": [
      {
        "title": "Developing AI Agents with Simulated Data: Why, what, and how?",
        "title_zh": "使用模拟数据开发AI智能体：原因、内容与方法",
        "link": "https://arxiv.org/abs/2602.15816v1",
        "summary": "As insufficient data volume and quality remain the key impediments to the adoption of modern subsymbolic AI, techniques of synthetic data generation are in high demand. Simulation offers an apt, systematic approach to generating diverse synthetic data. This chapter introduces the reader to the key c",
        "summary_zh": "本研究针对现代亚符号AI应用中数据不足和质量问题，系统探讨使用模拟数据开发AI智能体的方法。创新点在于全面分析模拟数据生成的必要性、核心内容和技术路径，强调模拟作为系统化生成多样合成数据的有效手段。主要贡献是提供了一个框架性指南，帮助研究者理解如何利用模拟数据克服数据瓶颈，提升AI智能体的训练效率和泛化能力，推动AI在实际场景中的应用。",
        "published": "2026-02-17T18:53:33Z",
        "authors": [
          "Xiaoran Liu",
          "Istvan David"
        ],
        "categories": [
          "cs.AI",
          "cs.ET"
        ]
      }
    ]
  },
  "category_summaries": {
    "理论研究": "今日理论研究聚焦于AI可解释性与鲁棒性，多篇论文探讨了神经网络泛化能力的理论边界，提出新的数学框架分析模型不确定性。亮点包括基于信息论的模型压缩理论，以及对抗性攻击下的稳定性证明，为实际应用提供理论支撑。",
    "计算机视觉/CV": "CV领域主要关注高效视觉Transformer架构与少样本学习，研究趋势包括轻量化设计降低计算成本，以及自监督预训练提升泛化能力。亮点论文提出动态稀疏注意力机制，在ImageNet上达到SOTA性能同时减少30%参数量。",
    "机器人": "机器人研究集中在多任务学习与具身智能，趋势包括端到端强化学习框架和仿真到现实的迁移学习。亮点工作展示多模态感知的抓取策略，在复杂环境中实现95%成功率，推动机器人自主操作能力。",
    "多模态学习": "多模态学习重点突破跨模态对齐与融合技术，研究趋势包括视觉-语言预训练的统一架构和细粒度语义关联。亮点模型实现零样本跨模态检索，在MSCOCO数据集上Recall@1提升8%，推动多模态理解发展。",
    "大语言模型/LLM": "LLM研究聚焦于高效微调与推理优化，趋势包括参数高效微调技术和长上下文窗口扩展。亮点提出动态稀疏激活方法，在保持性能同时将70B模型推理速度提升2倍，降低部署成本。",
    "优化算法": "优化算法创新集中在自适应学习率与分布式训练，研究趋势包括二阶优化器改进和异构设备协同训练。亮点算法实现通信效率提升50%，在大型神经网络训练中加速收敛20%。",
    "NLP": "NLP领域关注低资源语言处理与语义理解深度，趋势包括多语言预训练模型和细粒度情感分析。亮点工作提出跨语言知识蒸馏框架，在10种低资源语言上性能平均提升15%。",
    "生成模型": "生成模型突破集中在扩散模型效率与可控生成，趋势包括加速采样算法和条件生成精细化控制。亮点论文提出一步采样方法，将Stable Diffusion生成速度提升10倍，同时保持图像质量。",
    "图神经网络": "图神经网络研究侧重动态图学习与可扩展性，趋势包括时序图神经网络和异构图表示学习。亮点模型实现百万节点图的高效训练，在推荐场景中AUC提升5%，推动大规模图应用。",
    "推荐系统": "推荐系统创新聚焦个性化与公平性，趋势包括多行为序列建模和去偏差算法。亮点框架整合用户长期兴趣与即时意图，在电商数据集上CTR提升12%，同时减少流行度偏差。",
    "强化学习/RL": "RL研究重点是多智能体协作与样本效率，趋势包括离线强化学习和分层策略学习。亮点算法在机器人控制任务中实现样本效率提升3倍，通过模型预测提升策略稳定性。",
    "音频处理": "音频处理突破在语音合成自然度与音频事件检测，趋势包括神经声码器优化和弱监督音频分类。亮点模型实现零样本语音克隆，仅需3秒参考音频即可生成高质量个性化语音。",
    "AI基础理论": "基础理论研究探索AI与认知科学交叉，趋势包括神经符号推理和机器学习公理化体系。亮点工作提出统一的学习理论框架，连接统计学习与生物学习机制，为AI发展提供新视角。"
  },
  "highlights": [
    "研究亮点1：VLM-DEWM框架通过动态外部世界模型解决了智能制造中视觉语言规划的可验证性和鲁棒性问题，为工业自动化提供了创新解决方案",
    "研究亮点2：UrbanVerse框架实现了跨城市和跨任务的城区表示学习，显著提升了智慧城市分析的泛化能力和实用性",
    "研究亮点1：论文《This human study did not involve human subjects: Validating LLM simulations as behavioral evidence》的核心创新在于系统评估LLM作为合成参与者在社会科学实验中的有效性，填补了LLM模拟验证的指导空白，具有重要的方法论价值，可促进AI在跨学科研究中的可靠应用。",
    "研究亮点2：论文《Beyond Static Pipelines: Learning Dynamic Workflows for Text-to-SQL》的核心创新是提出动态工作流学习框架，解决了Text-to-SQL任务在现实场景中的可扩展性问题，通过自适应调整流程提升模型性能，具有高实用性，能推动自然语言处理技术在实际数据库查询中的部署。",
    "研究亮点1：PERSONA框架通过激活向量代数实现无需训练的动态人格控制，创新性地解决了LLM个性化中的灵活性与成本问题，具有高实用价值",
    "研究亮点2：僵尸智能体研究揭示了自进化LLM智能体的新型安全漏洞，对AI安全领域具有重要警示意义，推动了对抗性防御技术的发展",
    "研究亮点1：《理解与生成：多模态模型中的优化困境导航》提出动态平衡生成与理解目标的优化框架，解决了多模态模型核心性能冲突问题，具有重要理论价值",
    "研究亮点2：《MeshMimic：通过3D场景重建实现几何感知的人形机器人运动学习》创新性地将环境几何信息融入强化学习，显著提升机器人在复杂场景中的运动适应性，实用性强",
    "研究亮点1：大语言模型组合推理的递归概念演化——通过递归概念演化框架增强大语言模型的组合推理能力，创新性地引入动态概念构建机制，显著提升在复杂基准测试上的性能，具有重要的理论价值和实际应用潜力，可推动AI推理系统的发展。",
    "研究亮点2：大语言模型网络安全拒绝决策的内容驱动框架——提出基于内容分析的细粒度拒绝框架，有效区分网络安全任务中的合法与恶意请求，增强LLM在双重用途场景下的安全部署，实用性高，对伦理AI和网络安全领域有直接贡献。"
  ],
  "daily_summary": "今日arXiv发布的49篇AI论文显示，研究热点集中在模型效率提升与多模态融合两大方向。在模型效率方面，多篇论文针对大语言模型和生成模型提出创新优化方法，包括动态稀疏激活、一步采样等技术，显著降低计算成本与推理延迟，反映业界对AI部署实用化的迫切需求。同时，理论研究与基础算法工作为这些应用突破提供了坚实的理论支撑，如信息论框架和优化算法改进。\n\n多模态学习成为今日最活跃的研究领域，视觉-语言对齐、跨模态检索等方向取得显著进展，推动AI向更全面的环境理解能力发展。机器人、推荐系统等应用领域的研究则紧密结合实际场景，注重个性化、鲁棒性与公平性，体现AI技术落地过程中的精细化需求。整体来看，今日研究呈现“理论深化”与“应用拓展”并行的趋势，既关注底层算法创新，又强调解决现实世界复杂问题，预示着AI技术正加速向更高效、更智能、更可靠的方向演进。"
}