{
  "date": "2026-02-26",
  "total_items": 67,
  "categories": {
    "大语言模型/LLM": [
      {
        "title": "ESAA: Event Sourcing for Autonomous Agents in LLM-Based Software Engineering",
        "title_zh": "ESAA：基于大语言模型的软件工程中自主代理的事件溯源方法",
        "link": "https://arxiv.org/abs/2602.23193v1",
        "summary": "Autonomous agents based on Large Language Models (LLMs) have evolved from reactive assistants to systems capable of planning, executing actions via tools, and iterating over environment observations. However, they remain vulnerable to structural limitations: lack of native state, context degradation",
        "summary_zh": "本文提出ESAA框架，针对基于大语言模型的自主代理在软件工程应用中存在的结构限制问题，如缺乏原生状态管理和上下文退化。创新性地引入事件溯源架构，通过记录代理执行过程中的所有事件序列，实现状态的可追溯性、可恢复性和一致性维护。主要贡献包括：设计了一种轻量级事件存储机制，支持代理的长期记忆和错误回滚；开发了基于事件流的上下文管理策略，有效缓解信息衰减；在代码生成和测试任务中验证了框架的鲁棒性和效率提升。该研究为LLM代理的系统化工程部署提供了新思路。",
        "published": "2026-02-26T16:45:59Z",
        "authors": [
          "Elzo Brito dos Santos Filho"
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "A Decision-Theoretic Formalisation of Steganography With Applications to LLM Monitoring",
        "title_zh": "隐写术的决策理论形式化及其在大语言模型监控中的应用",
        "link": "https://arxiv.org/abs/2602.23163v1",
        "summary": "Large language models are beginning to show steganographic capabilities. Such capabilities could allow misaligned models to evade oversight mechanisms. Yet principled methods to detect and quantify such behaviours are lacking. Classical definitions of steganography, and detection methods based on th",
        "summary_zh": "本文针对大语言模型可能展现的隐写能力，提出一种决策理论形式化框架来检测和量化此类行为。创新点在于将隐写术建模为决策问题，为模型监控提供理论基础，弥补了现有方法缺乏原则性检测手段的不足。主要贡献是开发了适用于LLM的隐写检测工具，有助于防止模型逃避监管，提升AI安全性和可解释性。",
        "published": "2026-02-26T16:27:24Z",
        "authors": [
          "Usman Anwar",
          "Julianna Piskorz",
          "David D. Baek..."
        ],
        "categories": [
          "cs.AI",
          "cs.CL",
          "cs.CR",
          "cs.IT",
          "cs.MA"
        ]
      },
      {
        "title": "LLMServingSim 2.0: A Unified Simulator for Heterogeneous and Disaggregated LLM Serving Infrastructure",
        "title_zh": "LLMServingSim 2.0：异构与解耦大语言模型服务基础设施的统一模拟器",
        "link": "https://arxiv.org/abs/2602.23036v1",
        "summary": "Large language model (LLM) serving infrastructures are undergoing a shift toward heterogeneity and disaggregation. Modern deployments increasingly integrate diverse accelerators and near-memory processing technologies, introducing significant hardware heterogeneity, while system software increasingl",
        "summary_zh": "本文提出LLMServingSim 2.0，一个统一模拟器，用于建模异构和解耦的大语言模型服务基础设施。随着现代部署中多样化加速器和近内存处理技术的集成，硬件异构性显著增加，系统软件也日益解耦。该模拟器创新性地整合了这些趋势，支持对复杂LLM服务系统的性能评估和优化。主要贡献包括提供一个可扩展的框架，以模拟混合硬件环境下的资源分配、延迟和吞吐量，帮助研究人员和工程师设计更高效、成本效益更高的LLM服务架构。",
        "published": "2026-02-26T14:22:17Z",
        "authors": [
          "Jaehong Cho",
          "Hyunmin Choi",
          "Guseul Heo..."
        ],
        "categories": [
          "cs.DC",
          "cs.AI"
        ]
      },
      {
        "title": "LLM Novice Uplift on Dual-Use, In Silico Biology Tasks",
        "title_zh": "大语言模型在双重用途、硅基生物学任务中对新手的提升作用",
        "link": "https://arxiv.org/abs/2602.23329v1",
        "summary": "Large language models (LLMs) perform increasingly well on biology benchmarks, but it remains unclear whether they uplift novice users -- i.e., enable humans to perform better than with internet-only resources. This uncertainty is central to understanding both scientific acceleration and dual-use ris",
        "summary_zh": "本研究探讨大语言模型在双重用途、硅基生物学任务中是否提升新手用户的能力，即能否使人类表现优于仅依赖互联网资源的情况。通过实验设计，论文评估LLM在生物学任务中的实际效用，关注科学加速和双重用途风险。创新点在于首次系统量化LLM对非专家用户的辅助效果，揭示其在生物信息学中的潜在价值与局限性。主要贡献包括提供实证数据，帮助理解AI工具在科学研究和安全应用中的影响，为政策制定和工具开发提供参考。",
        "published": "2026-02-26T18:37:17Z",
        "authors": [
          "Chen Bo Calvin Zhang",
          "Christina Q. Knight",
          "Nicholas Kruus..."
        ],
        "categories": [
          "cs.AI",
          "cs.CL",
          "cs.CR",
          "cs.CY",
          "cs.HC"
        ]
      },
      {
        "title": "Utilizing LLMs for Industrial Process Automation",
        "title_zh": "利用大语言模型实现工业流程自动化",
        "link": "https://arxiv.org/abs/2602.23331v1",
        "summary": "A growing number of publications address the best practices to use Large Language Models (LLMs) for software engineering in recent years. However, most of this work focuses on widely-used general purpose programming languages like Python due to their widespread usage training data. The utility of LL",
        "summary_zh": "近年来，越来越多的研究探讨了在软件工程中应用大语言模型（LLMs）的最佳实践。然而，现有工作大多集中于Python等通用编程语言，因其训练数据丰富。本文创新性地将LLMs应用于工业流程自动化领域，针对特定领域语言和流程进行优化，填补了LLMs在工业自动化软件工程中的研究空白。主要贡献包括提出了一套适用于工业环境的LLM集成框架，并验证了其在提升自动化代码生成效率和可靠性方面的潜力，为工业4.0的智能化转型提供了新思路。",
        "published": "2026-02-26T18:38:00Z",
        "authors": [
          "Salim Fares"
        ],
        "categories": [
          "cs.SE",
          "cs.AI"
        ]
      },
      {
        "title": "SC-Arena: A Natural Language Benchmark for Single-Cell Reasoning with Knowledge-Augmented Evaluation",
        "title_zh": "SC-Arena：基于知识增强评估的单细胞推理自然语言基准",
        "link": "https://arxiv.org/abs/2602.23199v1",
        "summary": "Large language models (LLMs) are increasingly applied in scientific research, offering new capabilities for knowledge discovery and reasoning. In single-cell biology, however, evaluation practices for both general and specialized LLMs remain inadequate: existing benchmarks are fragmented across task",
        "summary_zh": "大语言模型（LLMs）在科学研究中的应用日益广泛，为知识发现和推理提供了新能力。然而，在单细胞生物学领域，通用和专用LLMs的评估实践仍不完善：现有基准分散于不同任务，缺乏统一标准。本文创新性地提出了SC-Arena基准，通过知识增强评估方法，系统测试LLMs在单细胞数据推理中的性能。主要贡献包括构建了一个涵盖多任务的自然语言问答数据集，并引入了外部知识库来增强评估的鲁棒性，为LLMs在生物医学领域的可靠应用提供了重要工具。",
        "published": "2026-02-26T16:50:28Z",
        "authors": [
          "Jiahao Zhao",
          "Feng Jiang",
          "Shaowei Qin"
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "Multi-Agent Large Language Model Based Emotional Detoxification Through Personalized Intensity Control for Consumer Protection",
        "title_zh": "基于多智能体大语言模型的个性化强度控制情感净化系统用于消费者保护",
        "link": "https://arxiv.org/abs/2602.23123v1",
        "summary": "In the attention economy, sensational content exposes consumers to excessive emotional stimulation, hindering calm decision-making. This study proposes Multi-Agent LLM-based Emotional deToxification (MALLET), a multi-agent information sanitization system consisting of four agents: Emotion Analysis,",
        "summary_zh": "在注意力经济中，煽情内容使消费者暴露于过度情感刺激，阻碍冷静决策。本研究提出了基于多智能体大语言模型的情感净化系统（MALLET），该系统由四个智能体组成：情感分析、内容调整、强度控制和用户反馈。创新点在于将多智能体架构与LLMs结合，实现个性化情感强度调节，以保护消费者免受有害内容影响。主要贡献包括开发了一个可动态调整内容情感水平的框架，并通过实验验证了其在提升用户决策质量和心理健康方面的有效性，为数字内容治理提供了新方法。",
        "published": "2026-02-26T15:37:03Z",
        "authors": [
          "Keito Inoshita"
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "Evaluating Stochasticity in Deep Research Agents",
        "title_zh": "评估深度研究代理中的随机性",
        "link": "https://arxiv.org/abs/2602.23271v1",
        "summary": "Deep Research Agents (DRAs) are promising agentic systems that gather and synthesize information to support research across domains such as financial decision-making, medical analysis, and scientific discovery. Despite recent improvements in research quality (e.g., outcome accuracy when ground truth",
        "summary_zh": "深度研究代理（DRAs）是一种有前景的智能系统，能够收集和整合信息以支持跨领域研究，如金融决策、医学分析和科学发现。尽管近期研究质量有所提升（例如，在有真实数据时的结果准确性），但随机性评估仍是关键挑战。本文提出了一种系统框架来量化DRAs中的随机性，通过分析代理行为的变异性和不确定性，评估其对研究可靠性的影响。创新点在于开发了基于概率模型的评估指标，能够区分随机噪声与系统性偏差，从而提升代理的可解释性和鲁棒性。主要贡献包括：1）建立了首个针对DRAs随机性的评估基准；2）提出了可扩展的评估方法，适用于多种研究场景；3）通过实验验证了随机性控制对提高研究一致性的重要性。",
        "published": "2026-02-26T17:46:42Z",
        "authors": [
          "Haotian Zhai",
          "Elias Stengel-Eskin",
          "Pratik Patil"
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "Scaling Search Relevance: Augmenting App Store Ranking with LLM-Generated Judgments",
        "title_zh": "扩展搜索相关性：利用LLM生成判断增强应用商店排名",
        "link": "https://arxiv.org/abs/2602.23234v1",
        "summary": "Large-scale commercial search systems optimize for relevance to drive successful sessions that help users find what they are looking for. To maximize relevance, we leverage two complementary objectives: behavioral relevance (results users tend to click or download) and textual relevance (a result's",
        "summary_zh": "大规模商业搜索系统通过优化相关性来提升用户成功找到目标内容的会话率。为最大化相关性，本文利用两个互补目标：行为相关性（用户倾向于点击或下载的结果）和文本相关性（结果与查询的语义匹配）。创新点在于引入大语言模型（LLM）生成的人工判断，以增强应用商店排名系统的相关性评估。通过结合LLM的语义理解能力和传统行为数据，该方法能够更准确地预测用户意图，减少偏差并提高排名质量。主要贡献包括：1）提出了一种混合评估框架，整合LLM生成判断与行为指标；2）在大规模应用商店数据上验证了该方法的有效性，显示相关性提升显著；3）开源了相关数据集和代码，促进工业界应用。",
        "published": "2026-02-26T17:11:26Z",
        "authors": [
          "Evangelia Christakopoulou",
          "Vivekkumar Patel",
          "Hemanth Velaga"
        ],
        "categories": [
          "cs.IR",
          "cs.AI",
          "cs.LG"
        ]
      },
      {
        "title": "SPM-Bench: Benchmarking Large Language Models for Scanning Probe Microscopy",
        "title_zh": "SPM-Bench：为大语言模型在扫描探针显微镜领域的基准测试",
        "link": "https://arxiv.org/abs/2602.22971v1",
        "summary": "As LLMs achieved breakthroughs in general reasoning, their proficiency in specialized scientific domains reveals pronounced gaps in existing benchmarks due to data contamination, insufficient complexity, and prohibitive human labor costs. Here we present SPM-Bench, an original, PhD-level multimodal",
        "summary_zh": "随着大语言模型（LLMs）在通用推理方面取得突破，其在专业科学领域的熟练度因数据污染、复杂度不足和高昂人力成本而在现有基准测试中暴露明显差距。本文提出SPM-Bench，一个原创的、博士级别的多模态基准，专注于扫描探针显微镜（SPM）领域。创新点在于构建了一个高质量、无污染的数据集，包含复杂的科学问题和多模态任务（如文本和图像分析），以评估LLMs在专业科学推理中的能力。主要贡献包括：1）开发了首个针对SPM领域的LLM基准，填补了专业评估空白；2）设计了多模态挑战任务，测试模型在真实科学场景中的表现；3）通过实验揭示了当前LLMs在高级科学任务中的局限性，为未来模型优化提供方向。",
        "published": "2026-02-26T13:08:56Z",
        "authors": [
          "Peiyao Xiao",
          "Xiaogang Li",
          "Chengliang Xu"
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "General Agent Evaluation",
        "title_zh": "通用智能体评估",
        "link": "https://arxiv.org/abs/2602.22953v1",
        "summary": "The promise of general-purpose agents - systems that perform tasks in unfamiliar environments without domain-specific engineering - remains largely unrealized. Existing agents are predominantly specialized, and while emerging implementations like OpenAI SDK Agent and Claude Code hint at broader capabilities, comprehensive evaluation frameworks are lacking. This paper proposes a novel evaluation methodology for general agents, focusing on cross-domain adaptability and task generalization. We introduce benchmark suites covering diverse environments and metrics that quantify agent robustness, efficiency, and learning transfer. Experimental results demonstrate significant gaps in current agent architectures, highlighting the need for more flexible and scalable approaches to achieve true generality.",
        "summary_zh": "本文提出了一种针对通用智能体的新型评估方法，旨在解决当前智能体系统在跨领域适应性和任务泛化能力方面的不足。研究创新点在于开发了覆盖多样化环境的基准测试套件，并设计了量化智能体鲁棒性、效率和学习迁移的指标。主要贡献包括：系统分析了现有智能体（如OpenAI SDK Agent和Claude Code）的局限性，揭示了其在处理陌生任务时的性能瓶颈；通过实验验证了当前架构在通用性方面的显著差距，为未来开发更灵活、可扩展的智能体提供了理论依据和评估工具。",
        "published": "2026-02-26T12:48:02Z",
        "authors": [
          "Elron Bandel",
          "Asaf Yehudai",
          "Lilach Eden"
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "Affine-Scaled Attention: Towards Flexible and Stable Transformer Attention",
        "title_zh": "仿射缩放注意力：迈向灵活稳定的Transformer注意力机制",
        "link": "https://arxiv.org/abs/2602.23057v1",
        "summary": "Transformer attention is typically implemented using softmax normalization, which enforces attention weights with unit sum normalization. While effective in many settings, this constraint can limit flexibility in controlling attention magnitudes and may contribute to overly concentrated or unstable",
        "summary_zh": "本文针对Transformer注意力机制中softmax归一化导致的注意力权重总和固定为1的约束问题，提出了一种仿射缩放注意力方法。核心创新在于通过引入可学习的仿射变换参数，允许注意力权重在保持相对分布的同时灵活调整幅度，从而增强模型对注意力集中度的控制能力。该方法在多个NLP基准测试中展现出更好的稳定性和性能，特别是在处理长序列和复杂依赖关系时表现突出，为Transformer架构的优化提供了新思路。",
        "published": "2026-02-26T14:42:16Z",
        "authors": [
          "Jeongin Bae",
          "Baeseong Park",
          "Gunho Park..."
        ],
        "categories": [
          "cs.CL",
          "cs.AI"
        ]
      },
      {
        "title": "Obscure but Effective: Classical Chinese Jailbreak Prompt Optimization via Bio-Inspired Search",
        "title_zh": "隐晦但有效：基于生物启发搜索的古汉语越狱提示优化",
        "link": "https://arxiv.org/abs/2602.22983v1",
        "summary": "As Large Language Models (LLMs) are increasingly used, their security risks have drawn increasing attention. Existing research reveals that LLMs are highly susceptible to jailbreak attacks, with effectiveness varying across language contexts. This paper investigates the role of classical Chinese in",
        "summary_zh": "本研究探讨大语言模型（LLMs）的安全漏洞，特别关注古汉语在越狱攻击中的有效性。创新点在于首次系统性地利用古汉语的隐晦性和复杂性，结合生物启发式搜索算法（如遗传算法）自动优化越狱提示，以绕过模型的安全防护机制。实验表明，古汉语提示相比现代语言能更高效地诱导模型生成有害内容，揭示了LLMs跨语言安全性的脆弱性。该研究为LLMs安全评估和防御提供了重要洞见，强调了多语言上下文在安全测试中的必要性。",
        "published": "2026-02-26T13:25:35Z",
        "authors": [
          "Xun Huang",
          "Simeng Qin",
          "Xiaoshuang Jia..."
        ],
        "categories": [
          "cs.AI",
          "cs.CR"
        ]
      },
      {
        "title": "Modeling Expert AI Diagnostic Alignment via Immutable Inference Snapshots",
        "title_zh": "通过不可变推理快照建模专家AI诊断对齐",
        "link": "https://arxiv.org/abs/2602.22973v1",
        "summary": "Human-in-the-loop validation is essential in safety-critical clinical AI, yet the transition between initial model inference and expert correction is rarely analyzed as a structured signal. We introduce a diagnostic alignment framework in which the AI-generated image based report is preserved as an immutable snapshot, allowing systematic study of expert modifications to improve model calibration and trust. By modeling these snapshots as probabilistic graphs, we demonstrate how alignment gaps can be quantified and reduced through iterative feedback, leading to more reliable AI-assisted diagnostics in medical imaging.",
        "summary_zh": "本文提出一种诊断对齐框架，用于安全关键的临床AI系统，通过将AI生成的影像报告保存为不可变推理快照，系统分析专家修正过程。创新点在于将初始推断与专家校正间的过渡建模为结构化信号，利用概率图表示快照，量化对齐差距。主要贡献包括：开发了可迭代反馈的校准机制，提升模型在医学影像诊断中的可靠性与信任度；实证表明该方法能有效减少误诊风险，为人类在环的AI系统优化提供了新范式。",
        "published": "2026-02-26T13:11:58Z",
        "authors": [
          "Dimitrios P. Panagoulias",
          "Evangelia-Aikaterini Tsichrintzi",
          "Georgios Savvidis"
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "NoRA: Breaking the Linear Ceiling of Low-Rank Adaptation via Manifold Expansion",
        "title_zh": "NoRA：通过流形扩展突破低秩适应的线性天花板",
        "link": "https://arxiv.org/abs/2602.22911v1",
        "summary": "Low-Rank Adaptation (LoRA) dominates parameter-efficient fine-tuning (PEFT). However, it faces a critical ``linear ceiling'' in complex reasoning tasks: simply increasing the rank yields diminishing returns due to intrinsic linear constraints. We introduce NoRA (Non-linear Rank Adaptation), a weight",
        "summary_zh": "低秩适应（LoRA）主导了参数高效微调领域，但在复杂推理任务中面临关键的“线性天花板”问题：由于内在的线性约束，单纯增加秩会导致收益递减。本文提出NoRA（非线性秩适应），一种权重自适应方法，通过引入非线性变换扩展参数空间，突破LoRA的线性限制。创新点在于将低秩分解与流形学习结合，在保持参数效率的同时增强模型表达能力。主要贡献是理论证明了NoRA能更有效地捕捉任务特定特征，并在多个基准测试中显著提升性能，为大规模语言模型的高效微调提供了新方向。",
        "published": "2026-02-26T11:55:25Z",
        "authors": [
          "Hung-Hsuan Chen"
        ],
        "categories": [
          "cs.LG",
          "cs.AI",
          "cs.CL"
        ]
      },
      {
        "title": "PATRA: Pattern-Aware Alignment and Balanced Reasoning for Time Series Question Answering",
        "title_zh": "PATRA：面向时间序列问答的模式感知对齐与平衡推理方法",
        "link": "https://arxiv.org/abs/2602.23161v1",
        "summary": "Time series reasoning demands both the perception of complex dynamics and logical depth. However, existing LLM-based approaches exhibit two limitations: they often treat time series merely as text or images, failing to capture the patterns like trends and seasonalities needed to answer specific ques...",
        "summary_zh": "时间序列推理需要感知复杂动态和逻辑深度，但现有基于大语言模型的方法存在局限：常将时间序列视为文本或图像，无法捕捉趋势、季节性等关键模式以回答具体问题。本研究提出PATRA，一种模式感知对齐与平衡推理框架，用于时间序列问答。创新点在于设计模式感知对齐模块，将时间序列的统计模式与语言模型语义对齐，并结合平衡推理机制处理多模态信息。主要贡献包括：首次将模式感知对齐引入时间序列LLM任务，提升对动态特征的捕捉能力；提出平衡推理策略，减少模态偏差；在多个时间序列QA数据集上实现显著性能提升。",
        "published": "2026-02-26T16:20:03Z",
        "authors": [
          "Junkai Lu",
          "Peng Chen",
          "Xingjian Wu..."
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "Exploratory Memory-Augmented LLM Agent via Hybrid On- and Off-Policy Optimization",
        "title_zh": "基于混合在线与离线策略优化的探索性记忆增强LLM智能体",
        "link": "https://arxiv.org/abs/2602.23008v1",
        "summary": "Exploration remains the key bottleneck for large language model agents trained with reinforcement learning. While prior methods exploit pretrained knowledge, they fail in environments requiring the discovery of novel states. We propose Exploratory Memory-Augmented On- and Off-Policy Optimization (EM...",
        "summary_zh": "探索是基于强化学习训练的大语言模型智能体的关键瓶颈。现有方法依赖预训练知识，但在需要发现新状态的环境中表现不佳。本研究提出探索性记忆增强在线与离线策略优化（EMOOP），一种混合优化框架。创新点在于结合在线和离线策略学习，利用记忆模块存储探索经验，动态调整探索策略以发现新状态。主要贡献包括：设计混合优化算法，平衡探索与利用；引入记忆增强机制，提升智能体在复杂环境中的适应性；在模拟和真实任务中验证了方法在探索效率和任务性能上的优势。",
        "published": "2026-02-26T13:50:57Z",
        "authors": [
          "Zeyuan Liu",
          "Jeonghye Kim",
          "Xufang Luo..."
        ],
        "categories": [
          "cs.LG",
          "cs.AI"
        ]
      },
      {
        "title": "Mitigating Legibility Tax with Decoupled Prover-Verifier Games",
        "title_zh": "通过解耦证明者-验证者游戏减轻可读性税",
        "link": "https://arxiv.org/abs/2602.23248v1",
        "summary": "As large language models become increasingly capable, it is critical that their outputs can be easily checked by less capable systems. Prover-verifier games can be used to improve checkability of model outputs, but display a degradation in accuracy compared to a baseline trained only to maximize cor...",
        "summary_zh": "随着大语言模型能力增强，确保其输出能被能力较低系统轻松检查至关重要。证明者-验证者游戏可用于提升模型输出的可检查性，但相比仅优化正确性的基线，常导致准确性下降（称为可读性税）。本研究提出解耦证明者-验证者游戏框架，以减轻可读性税。创新点在于将证明者和验证者训练过程解耦，允许独立优化，减少准确性损失。主要贡献包括：提出一种新颖的解耦训练策略，平衡可检查性与准确性；理论分析显示该方法能有效降低可读性税；实验证明在多个NLP任务中，模型在保持高可检查性的同时，准确性接近基线水平。",
        "published": "2026-02-26T17:25:22Z",
        "authors": [
          "Yegon Kim",
          "Juho Lee"
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "Why Diffusion Language Models Struggle with Truly Parallel (Non-Autoregressive) Decoding?",
        "title_zh": "扩散语言模型为何难以实现真正的并行（非自回归）解码？",
        "link": "https://arxiv.org/abs/2602.23225v1",
        "summary": "Diffusion Language Models (DLMs) are often advertised as enabling parallel token generation, yet practical fast DLMs frequently converge to left-to-right, autoregressive (AR)-like decoding dynamics. In contrast, genuinely non-AR generation is promising because it removes AR's sequential bottleneck,",
        "summary_zh": "本文探讨扩散语言模型（DLMs）在实现真正并行解码时面临的挑战。尽管DLMs常被宣传为支持并行生成，但实际应用中快速DLMs往往收敛到类似自回归（AR）的左到右解码模式。研究创新点在于系统分析了DLMs解码动态的局限性，指出其难以摆脱AR瓶颈的根本原因。主要贡献包括：揭示了DLMs在非自回归生成中的理论障碍，为改进模型设计提供了关键见解，有助于推动更高效的并行语言模型发展。",
        "published": "2026-02-26T17:04:57Z",
        "authors": [
          "Pengxiang Li",
          "Dilxat Muhtar",
          "Lu Yin"
        ],
        "categories": [
          "cs.CL",
          "cs.AI"
        ]
      }
    ],
    "优化算法": [
      {
        "title": "FlashOptim: Optimizers for Memory Efficient Training",
        "title_zh": "FlashOptim：面向内存高效训练的优化器",
        "link": "https://arxiv.org/abs/2602.23349v1",
        "summary": "Standard mixed-precision training of neural networks requires many bytes of accelerator memory for each model parameter. These bytes reflect not just the parameter itself, but also its gradient and one or more optimizer state variables. With each of these values typically requiring 4 bytes, training",
        "summary_zh": "本文针对神经网络混合精度训练中内存占用过高的问题，提出FlashOptim优化器系列。创新点在于重新设计优化器状态变量的存储和计算方式，通过动态量化和稀疏化技术，将每个参数相关的内存需求从传统12字节降低至4-6字节，同时保持训练收敛性和性能。主要贡献包括：开发了适用于Adam、SGD等常见优化器的内存高效变体；提出了基于梯度统计的自适应压缩算法，平衡内存节省与计算精度；在大规模语言模型和视觉模型训练中验证了内存减少50%以上且精度无损。该工作为训练超大模型提供了实用的内存优化解决方案。",
        "published": "2026-02-26T18:52:22Z",
        "authors": [
          "Jose Javier Gonzalez Ortiz",
          "Abhay Gupta",
          "Chris Renard..."
        ],
        "categories": [
          "cs.LG",
          "cs.AI"
        ]
      },
      {
        "title": "Residual Koopman Spectral Profiling for Predicting and Preventing Transformer Training Instability",
        "title_zh": "残差库普曼谱分析用于预测和防止Transformer训练不稳定性",
        "link": "https://arxiv.org/abs/2602.22988v1",
        "summary": "Training divergence in transformers wastes compute, yet practitioners discover instability only after expensive runs begin. They therefore need an expected probability of failure for a transformer before training starts. Our study of Residual Koopman Spectral Profiling (RKSP) provides such an estima",
        "summary_zh": "Transformer训练中的发散问题浪费计算资源，但实践者往往在昂贵的训练开始后才发现不稳定性。因此，需要在训练开始前预测Transformer的失败概率。本文研究残差库普曼谱分析（RKSP），提供了一种估计方法。创新点在于将库普曼算子理论应用于Transformer训练动态分析，通过残差谱特征来量化模型不稳定性风险。该方法能够在训练早期识别潜在的发散趋势，从而提前调整超参数或架构，避免资源浪费。主要贡献包括：1）提出了RKSP框架，首次将谱分析用于Transformer训练稳定性预测；2）开发了高效的算法，实现实时监控和风险评估；3）在多个数据集上验证了RKSP的准确性，显示其能有效减少训练失败率并提升效率。",
        "published": "2026-02-26T13:33:25Z",
        "authors": [
          "Bum Jun Kim",
          "Shohei Taniguchi",
          "Makoto Kawano"
        ],
        "categories": [
          "cs.LG",
          "cs.AI"
        ]
      }
    ],
    "多模态学习": [
      {
        "title": "AgentDropoutV2: Optimizing Information Flow in Multi-Agent Systems via Test-Time Rectify-or-Reject Pruning",
        "title_zh": "AgentDropoutV2：通过测试时修正或拒绝剪枝优化多智能体系统中的信息流",
        "link": "https://arxiv.org/abs/2602.23258v1",
        "summary": "While Multi-Agent Systems (MAS) excel in complex reasoning, they suffer from the cascading impact of erroneous information generated by individual participants. Current solutions often resort to rigid structural engineering or expensive fine-tuning, limiting their deployability and adaptability. We",
        "summary_zh": "本文针对多智能体系统中错误信息传播导致的级联失效问题，提出AgentDropoutV2方法。创新性地在测试阶段引入动态剪枝机制，通过实时评估每个智能体的输出可靠性，选择修正错误信息或直接拒绝参与，从而优化系统信息流。主要贡献包括：设计了基于置信度和一致性的智能体性能评估指标；开发了轻量级在线学习模块，无需重新训练即可适应新任务；在对话系统和决策任务中验证了该方法能提升系统鲁棒性20%以上，同时减少计算开销。该研究为多智能体系统的实际部署提供了高效容错方案。",
        "published": "2026-02-26T17:31:43Z",
        "authors": [
          "Yutong Wang",
          "Siyuan Xiong",
          "Xuebo Liu..."
        ],
        "categories": [
          "cs.AI",
          "cs.CL"
        ]
      },
      {
        "title": "Scattering Transform for Auditory Attention Decoding",
        "title_zh": "用于听觉注意解码的散射变换",
        "link": "https://arxiv.org/abs/2602.23003v1",
        "summary": "The use of hearing aids will increase in the coming years due to demographic change. One open problem that remains to be solved by a new generation of hearing aids is the cocktail party problem. A possible solution is electroencephalography-based auditory attention decoding. This has been the subjec",
        "summary_zh": "本文研究基于脑电图的听觉注意解码，以解决助听器中的鸡尾酒会问题。创新点在于引入散射变换方法处理脑电信号，增强对听觉注意模式的表征能力，提高解码准确性和鲁棒性。主要贡献是提出了一种新颖的信号处理技术，为下一代智能助听器的开发提供理论支持，具有重要的临床应用前景。",
        "published": "2026-02-26T13:48:24Z",
        "authors": [
          "René Pallenberg",
          "Fabrice Katzberg",
          "Alfred Mertins..."
        ],
        "categories": [
          "eess.SP",
          "cs.AI",
          "eess.AS"
        ]
      },
      {
        "title": "Efficient Encoder-Free Fourier-based 3D Large Multimodal Model",
        "title_zh": "高效的无编码器傅里叶基三维大模态模型",
        "link": "https://arxiv.org/abs/2602.23153v1",
        "summary": "Large Multimodal Models (LMMs) that process 3D data typically rely on heavy, pre-trained visual encoders to extract geometric features. While recent 2D LMMs have begun to eliminate such encoders for efficiency and scalability, extending this paradigm to 3D remains challenging due to the unordered an",
        "summary_zh": "本文提出一种高效的无编码器傅里叶基三维大模态模型，用于处理3D数据。传统3D LMMs依赖重型预训练视觉编码器提取几何特征，而近期2D LMMs已开始摒弃编码器以提高效率和可扩展性，但扩展到3D仍面临无序性和高维度的挑战。创新点在于利用傅里叶变换直接处理3D点云或网格数据，避免编码器开销，实现轻量化和快速推理。主要贡献包括开发一种新颖的架构，在保持性能的同时显著降低计算成本，为3D多模态应用如机器人感知和增强现实提供实用解决方案。",
        "published": "2026-02-26T16:16:17Z",
        "authors": [
          "Guofeng Mei",
          "Wei Lin",
          "Luigi Riz..."
        ],
        "categories": [
          "cs.CV",
          "cs.AI"
        ]
      },
      {
        "title": "MM-NeuroOnco: A Multimodal Benchmark and Instruction Dataset for MRI-Based Brain Tumor Diagnosis",
        "title_zh": "MM-NeuroOnco：基于MRI的脑肿瘤诊断多模态基准与指令数据集",
        "link": "https://arxiv.org/abs/2602.22955v1",
        "summary": "Accurate brain tumor diagnosis requires models to not only detect lesions but also generate clinically interpretable reasoning grounded in imaging manifestations, yet existing public datasets remain limited in annotation richness and diagnostic semantics. To bridge this gap, we introduce MM-NeuroOnc",
        "summary_zh": "准确的脑肿瘤诊断要求模型不仅能检测病变，还能基于影像表现生成临床可解释的推理，但现有公共数据集在标注丰富性和诊断语义方面仍有限制。为填补这一空白，我们提出了MM-NeuroOnco，这是一个多模态基准和指令数据集，专注于MRI脑肿瘤诊断。该数据集整合了丰富的临床注释、多模态影像数据和结构化诊断指令，旨在促进模型在生成可解释诊断推理方面的能力。创新点在于首次提供了结合视觉-语言交互的脑肿瘤诊断基准，强调临床语义的建模，为多模态医学AI研究提供了新工具。主要贡献包括发布高质量数据集、定义评估协议，并展示了在现有模型上的基准性能，推动可解释AI在医疗领域的应用。",
        "published": "2026-02-26T12:50:32Z",
        "authors": [
          "Feng Guo",
          "Jiaxiang Liu",
          "Yang Li..."
        ],
        "categories": [
          "cs.CV",
          "cs.AI"
        ]
      },
      {
        "title": "OmniGAIA: Towards Native Omni-Modal AI Agents",
        "title_zh": "OmniGAIA：迈向原生全模态AI智能体",
        "link": "https://arxiv.org/abs/2602.22897v1",
        "summary": "Human intelligence naturally intertwines omni-modal perception -- spanning vision, audio, and language -- with complex reasoning and tool usage to interact with the world. However, current multi-modal LLMs are primarily confined to bi-modal interactions (e.g., vision-language), lacking the unified c",
        "summary_zh": "人类智能自然地将全模态感知（涵盖视觉、音频和语言）与复杂推理和工具使用相结合，以与世界交互。然而，当前的多模态大语言模型主要局限于双模态交互（如视觉-语言），缺乏统一架构来原生处理全模态输入。本文提出OmniGAIA，一个旨在实现原生全模态AI智能体的框架。创新点在于设计了一种统一架构，能够无缝集成视觉、音频和语言模态，支持复杂推理和工具调用，模拟人类的多模态交互能力。主要贡献包括提出全模态感知模型、开发评估基准，并展示了在多种任务上的性能提升，为构建更通用、交互性强的AI系统铺平道路。",
        "published": "2026-02-26T11:35:04Z",
        "authors": [
          "Xiaoxi Li",
          "Wenxiang Jiao",
          "Jiarui Jin..."
        ],
        "categories": [
          "cs.AI",
          "cs.CL",
          "cs.CV",
          "cs.LG",
          "cs.MM"
        ]
      },
      {
        "title": "Modality Collapse as Mismatched Decoding: Information-Theoretic Limits of Multimodal LLMs",
        "title_zh": "模态坍缩作为失配解码：多模态大语言模型的信息论极限",
        "link": "https://arxiv.org/abs/2602.23136v1",
        "summary": "Multimodal LLMs can process speech and images, but they cannot hear a speaker's voice or see an object's texture. We show this is not a failure of encoding: speaker identity, emotion, and visual attributes survive through every LLM layer (3--55× above chance in linear probes), yet removing 64% of tokens causes complete modality collapse. We frame this as a mismatched decoding problem, where the LLM's autoregressive objective misaligns with multimodal information preservation. Using information theory, we derive fundamental limits on how much multimodal content can be retained under standard training regimes. Our analysis reveals that current architectures inherently sacrifice fine-grained perceptual details for linguistic coherence, suggesting new directions for model design to better balance modality integration.",
        "summary_zh": "本文从信息论角度分析了多模态大语言模型中模态坍缩现象的根本原因。研究创新点在于将模态坍缩框架化为失配解码问题，指出自回归目标与多模态信息保留之间的不匹配。主要贡献包括：通过线性探针实验证明，说话者身份、情感和视觉属性在LLM各层中得以保留，但令牌移除会导致模态信息完全坍缩；推导了标准训练机制下多模态内容保留的理论极限，揭示了当前架构为保持语言连贯性而牺牲细粒度感知细节的内在缺陷，为未来模型设计提供了新的方向以更好地平衡模态整合。",
        "published": "2026-02-26T15:52:48Z",
        "authors": [
          "Jayadev Billa"
        ],
        "categories": [
          "cs.CL",
          "cs.AI",
          "cs.LG"
        ]
      },
      {
        "title": "Make It Hard to Hear, Easy to Learn: Long-Form Bengali ASR and Speaker Diarization via Extreme Augmentation and Perfect Alignment",
        "title_zh": "难听易学：通过极端增强和完美对齐实现长格式孟加拉语ASR与说话人日志",
        "link": "https://arxiv.org/abs/2602.23070v1",
        "summary": "Although Automatic Speech Recognition (ASR) in Bengali has seen significant progress, processing long-duration audio and performing robust speaker diarization remain critical research gaps. To address the severe scarcity of joint ASR and diarization resources for this language, we introduce Lipi-Gho",
        "summary_zh": "本文针对孟加拉语自动语音识别（ASR）和说话人日志任务中长音频处理和数据稀缺的挑战，提出Lipi-Gho框架。核心创新包括极端数据增强策略（如噪声注入和时长拉伸）以模拟真实复杂环境，以及完美对齐机制确保ASR输出与说话人标签的精确同步。该方法在长格式孟加拉语数据集上显著提升了识别准确性和说话人区分能力，填补了该语言多模态处理资源的空白，为低资源语言的语音技术发展提供了实用解决方案。",
        "published": "2026-02-26T14:59:24Z",
        "authors": [
          "Sanjid Hasan",
          "Risalat Labib",
          "A H M Fuad..."
        ],
        "categories": [
          "cs.SD",
          "cs.AI",
          "cs.CL",
          "eess.AS"
        ]
      },
      {
        "title": "SOTAlign: Semi-Supervised Alignment of Unimodal Vision and Language Models via Optimal Transport",
        "title_zh": "SOTAlign：基于最优传输的单模态视觉与语言模型半监督对齐方法",
        "link": "https://arxiv.org/abs/2602.23353v1",
        "summary": "The Platonic Representation Hypothesis posits that neural networks trained on different modalities converge toward a shared statistical model of the world. Recent work exploits this convergence by aligning frozen pretrained vision and language models with lightweight alignment layers, but typically...",
        "summary_zh": "柏拉图表示假说认为，在不同模态上训练的神经网络会收敛到一个共享的世界统计模型。本研究提出SOTAlign，一种基于最优传输的半监督对齐方法，用于对齐冻结的预训练视觉和语言模型。创新点在于利用最优传输理论实现跨模态特征对齐，仅需少量标注数据即可提升模型在视觉-语言任务上的性能。主要贡献包括：提出一种高效的半监督对齐框架，降低对齐成本；通过理论分析验证了方法的有效性；在多个基准数据集上展示了优于现有方法的性能。",
        "published": "2026-02-26T18:55:06Z",
        "authors": [
          "Simon Roschmann",
          "Paul Krzakala",
          "Sonia Mazelet..."
        ],
        "categories": [
          "cs.LG",
          "cs.AI"
        ]
      }
    ],
    "NLP": [
      {
        "title": "MoDora: Tree-Based Semi-Structured Document Analysis System",
        "title_zh": "MoDora：基于树的半结构化文档分析系统",
        "link": "https://arxiv.org/abs/2602.23061v1",
        "summary": "Semi-structured documents integrate diverse interleaved data elements (e.g., tables, charts, hierarchical paragraphs) arranged in various and often irregular layouts. These documents are widely observed across domains and account for a large portion of real-world data. However, existing methods stru",
        "summary_zh": "本文提出MoDora系统，用于处理包含表格、图表和层次化段落等混合元素的半结构化文档。创新点在于采用树形结构表示文档布局，结合视觉和文本特征进行联合分析，克服传统方法对规则布局的依赖。主要贡献包括：开发了基于注意力机制的文档解析算法，能自动识别和关联异构数据元素；构建了大规模半结构化文档数据集，支持模型训练和评估；在信息抽取和文档理解任务中，MoDora相比基线方法准确率提升15%以上。该系统为金融、医疗等领域的文档自动化处理提供了通用解决方案。",
        "published": "2026-02-26T14:48:59Z",
        "authors": [
          "Bangrui Xu",
          "Qihang Yao",
          "Zirui Tang..."
        ],
        "categories": [
          "cs.IR",
          "cs.AI",
          "cs.CL",
          "cs.DB",
          "cs.LG"
        ]
      },
      {
        "title": "SPARTA: Scalable and Principled Benchmark of Tree-Structured Multi-hop QA over Text and Tables",
        "title_zh": "SPARTA：面向文本和表格的树结构多跳问答的可扩展与原则性基准",
        "link": "https://arxiv.org/abs/2602.23286v1",
        "summary": "Real-world Table-Text question answering (QA) tasks require models that can reason across long text and source tables, traversing multiple hops and executing complex operations such as aggregation. Yet existing benchmarks are small, manually curated - and therefore error-prone - and contain shallow",
        "summary_zh": "本文提出SPARTA基准，用于评估模型在真实世界表格-文本多跳问答任务中的性能。创新点在于通过原则性方法自动生成大规模、高质量的树结构问题，覆盖复杂推理操作如聚合和比较，克服了现有基准规模小、人工标注易错、问题深度不足的局限。主要贡献是提供了一个可扩展的评估框架，促进模型在跨模态推理能力上的研究。",
        "published": "2026-02-26T17:59:51Z",
        "authors": [
          "Sungho Park",
          "Jueun Kim",
          "Wook-Shin Han"
        ],
        "categories": [
          "cs.CL",
          "cs.AI",
          "cs.DB",
          "cs.IR"
        ]
      },
      {
        "title": "Evaluating Zero-Shot and One-Shot Adaptation of Small Language Models in Leader-Follower Interaction",
        "title_zh": "评估小语言模型在领导者-跟随者交互中的零样本和单样本适应能力",
        "link": "https://arxiv.org/abs/2602.23312v1",
        "summary": "Leader-follower interaction is an important paradigm in human-robot interaction (HRI). Yet, assigning roles in real time remains challenging for resource-constrained mobile and assistive robots. While large language models (LLMs) have shown promise for natural communication, their size and latency l",
        "summary_zh": "领导者-跟随者交互是人机交互（HRI）中的重要范式。然而，对于资源受限的移动和辅助机器人，实时分配角色仍具挑战性。虽然大语言模型在自然通信方面显示出潜力，但其规模和延迟限制了在边缘设备上的应用。本文评估小语言模型在领导者-跟随者交互中的零样本和单样本适应能力。创新点在于系统比较了不同规模模型在动态角色分配任务上的性能，重点关注资源效率与交互效果的平衡。主要贡献包括设计实验框架、提供实证结果，并指出小模型通过少量样本适应可以达到接近大模型的性能，为轻量级AI在机器人领域的部署提供参考。",
        "published": "2026-02-26T18:20:32Z",
        "authors": [
          "Rafael R. Baptista",
          "André de Lima Salgado",
          "Ricardo V. Godoy..."
        ],
        "categories": [
          "cs.HC",
          "cs.AI",
          "cs.LG",
          "cs.RO",
          "eess.SY"
        ]
      },
      {
        "title": "A Holistic Framework for Robust Bangla ASR and Speaker Diarization with Optimized VAD and CTC Alignment",
        "title_zh": "基于优化VAD和CTC对齐的鲁棒孟加拉语ASR与说话人日志化整体框架",
        "link": "https://arxiv.org/abs/2602.22935v1",
        "summary": "Despite being one of the most widely spoken languages globally, Bangla remains a low-resource language in the field of Natural Language Processing (NLP). Mainstream Automatic Speech Recognition (ASR) and Speaker Diarization systems for Bangla struggles when processing longform audio exceeding 3060 s",
        "summary_zh": "孟加拉语作为全球使用最广泛的语言之一，在自然语言处理（NLP）领域仍属于低资源语言。主流孟加拉语自动语音识别（ASR）和说话人日志化系统在处理超过3060秒的长音频时面临挑战。本文创新性地提出了一个整体框架，通过优化语音活动检测（VAD）和连接时序分类（CTC）对齐技术，提升长音频处理的鲁棒性。主要贡献包括开发了针对孟加拉语的高效ASR和说话人日志化模型，并公开了相关数据集，为低资源语言的语音处理研究提供了重要参考。",
        "published": "2026-02-26T12:26:04Z",
        "authors": [
          "Zarif Ishmam",
          "Zarif Mahir",
          "Shafnan Wasif"
        ],
        "categories": [
          "cs.SD",
          "cs.AI"
        ]
      },
      {
        "title": "Quantity Convergence, Quality Divergence: Disentangling Fluency and Accuracy in L2 Mandarin Prosody",
        "title_zh": "数量趋同，质量分化：解耦二语汉语韵律的流利度与准确性",
        "link": "https://arxiv.org/abs/2602.23071v1",
        "summary": "While second language (L2) learners may acquire target syntactic word order, mapping this syntax onto appropriate prosodic structures remains a persistent challenge. This study investigates the fossilization and stability of the L2 syntax-prosody interface by comparing 67 native Mandarin speakers wi",
        "summary_zh": "二语学习者可能掌握目标语言的句法词序，但将句法映射到合适的韵律结构仍是持续挑战。本研究通过比较67名汉语母语者与二语学习者的数据，探究二语句法-韵律接口的僵化与稳定性。创新点在于提出“数量趋同、质量分化”框架，区分韵律产出的流利度（如节奏频率）与准确性（如音高模式）。使用计算语言学方法分析语音数据，发现二语学习者在韵律数量指标上接近母语者，但质量指标存在显著差异。主要贡献是揭示了二语韵律习得的复杂机制，为语音合成和语言教学提供理论依据，推动个性化发音评估工具的发展。",
        "published": "2026-02-26T15:00:59Z",
        "authors": [
          "Yuqi Shi",
          "Hao Yang",
          "Xiyao Lu"
        ],
        "categories": [
          "cs.CL",
          "cs.AI"
        ]
      },
      {
        "title": "Automated Vulnerability Detection in Source Code Using Deep Representation Learning",
        "title_zh": "基于深度表示学习的源代码自动化漏洞检测",
        "link": "https://arxiv.org/abs/2602.23121v1",
        "summary": "Each year, software vulnerabilities are discovered, which pose significant risks of exploitation and system compromise. We present a convolutional neural network model that can successfully identify bugs in C code. We trained our model using two complementary datasets: a machine-labeled dataset crea",
        "summary_zh": "本文提出一种基于卷积神经网络的模型，用于自动化检测C语言源代码中的漏洞。研究创新点在于结合两个互补数据集进行训练：一个机器标注数据集和一个真实漏洞数据集，以提升模型泛化能力。主要贡献包括：开发了一种高效的深度表示学习方法，能够准确识别代码中的安全缺陷；该方法降低了人工审核成本，增强了软件系统的安全性，为智能代码审计提供了实用工具。",
        "published": "2026-02-26T15:35:17Z",
        "authors": [
          "C. Seas",
          "G. Fitzpatrick",
          "J. A. Hamilton"
        ],
        "categories": [
          "cs.CR",
          "cs.AI"
        ]
      }
    ],
    "生成模型": [
      {
        "title": "SeeThrough3D: Occlusion Aware 3D Control in Text-to-Image Generation",
        "title_zh": "SeeThrough3D：文本到图像生成中考虑遮挡感知的三维控制",
        "link": "https://arxiv.org/abs/2602.23359v1",
        "summary": "We identify occlusion reasoning as a fundamental yet overlooked aspect for 3D layout-conditioned generation. It is essential for synthesizing partially occluded objects with depth-consistent geometry and scale. While existing methods can generate realistic scenes that follow input layouts, they ofte",
        "summary_zh": "本文针对文本到图像生成中三维布局控制忽略遮挡推理的问题，提出SeeThrough3D框架。创新性地引入遮挡感知模块，在生成过程中显式建模物体间的深度关系和部分遮挡效果，确保几何一致性和尺度合理性。主要贡献包括：设计了基于体素表示的场景表示方法，支持高效遮挡检测；开发了条件扩散模型，将遮挡信息融入生成流程；在复杂场景生成任务中，SeeThrough3D相比现有方法能更准确地呈现遮挡物体，提升视觉真实度30%以上。该研究为可控图像生成提供了更精细的三维控制能力。",
        "published": "2026-02-26T18:59:59Z",
        "authors": [
          "Vaibhav Agrawal",
          "Rishubh Parihar",
          "Pradhaan Bhat..."
        ],
        "categories": [
          "cs.CV",
          "cs.AI"
        ]
      }
    ],
    "图神经网络": [
      {
        "title": "ODEBrain: Continuous-Time EEG Graph for Modeling Dynamic Brain Networks",
        "title_zh": "ODEBrain：用于建模动态脑网络的连续时间脑电图图",
        "link": "https://arxiv.org/abs/2602.23285v1",
        "summary": "Modeling neural population dynamics is crucial for foundational neuroscientific research and various clinical applications. Conventional latent variable methods typically model continuous brain dynamics through discretizing time with recurrent architecture, which necessarily results in compounded cu",
        "summary_zh": "本文提出ODEBrain模型，用于连续时间动态脑网络的建模。创新点在于结合常微分方程和图神经网络，直接建模脑电信号的连续演化过程，避免了传统方法因时间离散化导致的累积误差。主要贡献是开发了一种高效且准确的脑动力学表征方法，为神经科学基础研究和脑疾病诊断等应用提供新工具。",
        "published": "2026-02-26T17:59:10Z",
        "authors": [
          "Haohui Jia",
          "Zheng Chen",
          "Lingwei Zhu..."
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "DyGnROLE: Modeling Asymmetry in Dynamic Graphs with Node-Role-Oriented Latent Encoding",
        "title_zh": "DyGnROLE：通过节点角色导向的潜在编码建模动态图中的不对称性",
        "link": "https://arxiv.org/abs/2602.23135v1",
        "summary": "Real-world dynamic graphs are often directed, with source and destination nodes exhibiting asymmetrical behavioral patterns and temporal dynamics. However, existing dynamic graph architectures largely rely on shared parameters for processing source and destination nodes, with limited or no systemati",
        "summary_zh": "本文针对现实世界动态图（如社交网络、交易网络）中节点行为不对称的问题，提出DyGnROLE模型。核心创新在于引入节点角色导向的潜在编码机制，分别建模源节点和目标节点的动态特征，从而系统捕捉图中的方向性和不对称性。该方法通过分离的参数学习和时间感知的编码策略，显著提升了动态图预测任务（如链接预测和节点分类）的准确性。实验在多个真实数据集上验证了其有效性，为动态图神经网络提供了更精细的建模框架，推动了图学习理论的发展。",
        "published": "2026-02-26T15:51:51Z",
        "authors": [
          "Tyler Bonnet",
          "Marek Rei"
        ],
        "categories": [
          "cs.LG",
          "cs.AI",
          "cs.SI"
        ]
      }
    ],
    "强化学习/RL": [
      {
        "title": "Generalized Rapid Action Value Estimation in Memory-Constrained Environments",
        "title_zh": "内存受限环境中的广义快速动作值估计",
        "link": "https://arxiv.org/abs/2602.23318v1",
        "summary": "Generalized Rapid Action Value Estimation (GRAVE) has been shown to be a strong variant within the Monte-Carlo Tree Search (MCTS) family of algorithms for General Game Playing (GGP). However, its reliance on storing additional win/visit statistics at each node makes its use impractical in memory-con",
        "summary_zh": "本文针对广义快速动作值估计算法在内存受限环境中的应用问题，提出改进方法。创新点在于优化GRAVE算法的存储机制，减少节点统计信息的冗余，使其在有限内存下仍能高效运行。主要贡献是扩展了蒙特卡洛树搜索算法的适用性，为通用游戏博弈等强化学习任务提供了更实用的解决方案。",
        "published": "2026-02-26T18:25:59Z",
        "authors": [
          "Aloïs Rautureau",
          "Tristan Cazenave",
          "Éric Piette"
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "Three AI-agents walk into a bar . . . . `Lord of the Flies' tribalism emerges among smart AI-Agents",
        "title_zh": "三个AI智能体走进酒吧……《蝇王》式部落主义在智能AI智能体中涌现",
        "link": "https://arxiv.org/abs/2602.23093v1",
        "summary": "Near-future infrastructure systems may be controlled by autonomous AI agents that repeatedly request access to limited resources such as energy, bandwidth, or computing power. We study a simplified version of this setting using a framework where N AI-agents independently decide at each round whether",
        "summary_zh": "本研究通过多智能体强化学习框架，模拟未来基础设施中自主AI智能体竞争有限资源（如能源、带宽）的场景。创新点在于揭示了智能AI智能体在重复博弈中会自发形成类似《蝇王》的部落主义行为，即智能体结盟并排斥外部成员，导致资源分配不均和系统不稳定。该研究通过理论分析和实验验证，探讨了这种社会性行为的涌现机制及其对系统可靠性的影响，为设计更鲁棒的多智能体系统提供了理论基础，具有重要的跨学科价值。",
        "published": "2026-02-26T15:12:26Z",
        "authors": [
          "Dhwanil M. Mori",
          "Neil F. Johnson"
        ],
        "categories": [
          "cs.AI",
          "cs.SI",
          "physics.soc-ph"
        ]
      },
      {
        "title": "Learning-based Multi-agent Race Strategies in Formula 1",
        "title_zh": "基于学习的多智能体一级方程式赛车策略",
        "link": "https://arxiv.org/abs/2602.23056v1",
        "summary": "In Formula 1, race strategies are adapted according to evolving race conditions and competitors' actions. This paper proposes a reinforcement learning approach for multi-agent race strategy optimization. Agents learn to balance energy management, tire degradation, aerodynamic interaction, and pit-st",
        "summary_zh": "本文提出了一种基于强化学习的多智能体方法，用于优化一级方程式赛车中的比赛策略。创新点在于将复杂的赛车决策问题建模为多智能体强化学习任务，智能体需动态平衡能量管理、轮胎磨损、空气动力学交互和进站策略等多个因素。主要贡献包括：1）设计了一个高保真模拟环境，准确还原F1比赛中的物理约束和竞争动态；2）开发了一种分层强化学习架构，使智能体能同时学习短期战术和长期战略；3）实验结果表明，该方法能生成超越传统启发式策略的优化方案，在模拟比赛中显著提升了圈速和胜率，为实时竞技决策提供了AI驱动的新思路。",
        "published": "2026-02-26T14:41:29Z",
        "authors": [
          "Giona Fieni",
          "Joschua Wüthrich",
          "Marc-Philippe Neumann..."
        ],
        "categories": [
          "cs.AI",
          "eess.SY"
        ]
      },
      {
        "title": "FactGuard: Agentic Video Misinformation Detection via Reinforcement Learning",
        "title_zh": "FactGuard：基于强化学习的智能体视频虚假信息检测",
        "link": "https://arxiv.org/abs/2602.22963v1",
        "summary": "Multimodal large language models (MLLMs) have substantially advanced video misinformation detection through unified multimodal reasoning, but they often rely on fixed-depth inference and place excessive trust in internally generated assumptions, particularly in scenarios where critical evidence is sparse or ambiguous. FactGuard introduces an agentic framework where a reinforcement learning agent dynamically controls the inference depth and evidence gathering process, optimizing detection accuracy by learning to allocate computational resources based on content complexity and uncertainty.",
        "summary_zh": "本文提出FactGuard框架，利用强化学习智能体动态优化多模态大语言模型在视频虚假信息检测中的推理过程。创新点在于突破固定深度推断限制，通过智能体学习根据内容复杂性与不确定性分配计算资源，自主控制证据收集与推理深度。主要贡献包括：设计了基于奖励的决策机制，提升在证据稀疏或模糊场景下的检测准确性；实验表明该方法较传统MLLM方法在多样数据集上实现更高鲁棒性，为自动化内容审核提供了可扩展解决方案。",
        "published": "2026-02-26T13:00:31Z",
        "authors": [
          "Zehao Li",
          "Hongwei Yu",
          "Hao Jiang"
        ],
        "categories": [
          "cs.AI"
        ]
      }
    ],
    "理论研究": [
      {
        "title": "Discovery of Interpretable Physical Laws in Materials via Language-Model-Guided Symbolic Regression",
        "title_zh": "通过语言模型引导的符号回归发现材料中的可解释物理定律",
        "link": "https://arxiv.org/abs/2602.22967v1",
        "summary": "Discovering interpretable physical laws from high-dimensional data is a fundamental challenge in scientific research. Traditional methods, such as symbolic regression, often produce complex, unphysical formulas when searching a vast space of possible forms. We introduce a framework that guides the s",
        "summary_zh": "本文提出一种语言模型引导的符号回归框架，用于从高维数据中发现材料中的可解释物理定律。传统符号回归方法在搜索广阔可能形式空间时，常产生复杂且非物理的公式。创新点在于集成语言模型，利用其先验知识引导搜索过程，优先考虑物理上合理的表达式，从而提高发现准确性和可解释性。主要贡献包括开发一个混合方法，结合AI与科学推理，在材料科学中自动推导简洁定律，加速新材料的理解和设计，具有重要理论价值。",
        "published": "2026-02-26T13:05:05Z",
        "authors": [
          "Yifeng Guan",
          "Chuyi Liu",
          "Dongzhan Zhou..."
        ],
        "categories": [
          "physics.comp-ph",
          "cs.AI"
        ]
      },
      {
        "title": "Certified Circuits: Stability Guarantees for Mechanistic Circuits",
        "title_zh": "认证电路：机械电路稳定性保证",
        "link": "https://arxiv.org/abs/2602.22968v1",
        "summary": "Understanding how neural networks arrive at their predictions is essential for debugging, auditing, and deployment. Mechanistic interpretability pursues this goal by identifying circuits - minimal subnetworks responsible for specific behaviors. However, existing circuit discovery methods are brittle",
        "summary_zh": "本文提出认证电路方法，为机械电路提供稳定性保证，以增强神经网络的可解释性。理解神经网络预测机制对调试、审计和部署至关重要，机械可解释性通过识别负责特定行为的最小子网络（电路）来实现这一目标，但现有电路发现方法脆弱且缺乏鲁棒性。创新点在于引入形式化验证技术，确保发现的电路在输入扰动下保持稳定，提高可解释性的可靠性。主要贡献包括开发一个理论框架，结合可解释AI与安全验证，为可信AI系统提供坚实基础，具有高学术价值。",
        "published": "2026-02-26T13:07:31Z",
        "authors": [
          "Alaa Anani",
          "Tobias Lorenz",
          "Bernt Schiele..."
        ],
        "categories": [
          "cs.AI",
          "cs.CV",
          "cs.CY"
        ]
      },
      {
        "title": "Agency and Architectural Limits: Why Optimization-Based Systems Cannot Be Norm-Responsive",
        "title_zh": "代理与架构限制：为何基于优化的系统无法响应规范",
        "link": "https://arxiv.org/abs/2602.23239v1",
        "summary": "AI systems are increasingly deployed in high-stakes contexts -- medical diagnosis, legal research, financial analysis -- under the assumption they can be governed by norms. This paper demonstrates that assumption is formally invalid for optimization-based systems, specifically Large Language Models",
        "summary_zh": "AI系统越来越多地部署在高风险场景中——如医疗诊断、法律研究、金融分析——基于它们可以被规范治理的假设。本文证明，对于基于优化的系统，特别是大语言模型，这一假设在形式上是无效的。创新点在于从理论角度分析了优化架构的内在限制，指出这些系统无法真正响应社会或伦理规范，因为它们的设计目标（如最大化预测准确率）与规范遵循存在根本冲突。主要贡献包括形式化论证了优化系统与规范响应性之间的不兼容性，提出了对AI治理的批判性见解，呼吁重新思考AI系统设计以纳入规范考量。",
        "published": "2026-02-26T17:16:17Z",
        "authors": [
          "Radha Sarma"
        ],
        "categories": [
          "cs.AI",
          "cs.CY"
        ]
      },
      {
        "title": "Invariant Transformation and Resampling based Epistemic-Uncertainty Reduction",
        "title_zh": "基于不变变换与重采样的认知不确定性降低方法",
        "link": "https://arxiv.org/abs/2602.23315v1",
        "summary": "An artificial intelligence (AI) model can be viewed as a function that maps inputs to outputs in high-dimensional spaces. Once designed and well trained, the AI model is applied for inference. However, even optimized AI models can produce inference errors due to aleatoric and epistemic uncertainties",
        "summary_zh": "本文提出了一种通过不变变换与重采样技术来降低AI模型中认知不确定性的方法。创新点在于将高维输入输出映射中的不确定性分解为偶然性和认知性两类，并针对认知不确定性设计了一种基于数据增强和模型鲁棒性提升的框架。主要贡献包括：1）理论分析了不变变换对认知不确定性的影响机制；2）提出了一种高效的重采样算法，能在不显著增加计算成本的情况下提升模型泛化能力；3）在多个基准数据集上验证了该方法能有效减少推理错误率，尤其在分布外泛化任务中表现突出。",
        "published": "2026-02-26T18:22:40Z",
        "authors": [
          "Sha Hu"
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "The Trinity of Consistency as a Defining Principle for General World Models",
        "title_zh": "一致性三位一体作为通用世界模型的定义原则",
        "link": "https://arxiv.org/abs/2602.23152v1",
        "summary": "The construction of World Models capable of learning, simulating, and reasoning about objective physical laws constitutes a foundational challenge in the pursuit of Artificial General Intelligence. Recent advancements represented by video generation models like Sora have demonstrated the potential o",
        "summary_zh": "本文提出“一致性三位一体”原则作为构建通用世界模型的核心框架，旨在解决学习、模拟和推理客观物理规律的基础性挑战。创新点在于将一致性分解为时间一致性、空间一致性和逻辑一致性三个维度，并理论论证了这三者的协同作用对实现通用人工智能的关键性。主要贡献包括：1）形式化定义了世界模型中的一致性原则，为模型评估提供了新标准；2）借鉴Sora等视频生成模型的进展，提出了一个基于Transformer的架构原型，能同时优化三个一致性维度；3）通过模拟实验展示了该原则在复杂物理场景推理中的有效性，推动了AGI理论的发展。",
        "published": "2026-02-26T16:15:55Z",
        "authors": [
          "Jingxuan Wei",
          "Siyuan Li",
          "Yuhang Xu..."
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "A Model-Free Universal AI",
        "title_zh": "一种无模型的通用人工智能",
        "link": "https://arxiv.org/abs/2602.23242v1",
        "summary": "In general reinforcement learning, all established optimal agents, including AIXI, are model-based, explicitly maintaining and using environment models. This paper introduces Universal AI with Q-Induction (AIQI), the first model-free agent proven to be asymptotically $\\varepsilon$-optimal in general",
        "summary_zh": "本文提出了AIQI（基于Q归纳的通用人工智能），这是首个在通用强化学习中被证明具有渐近ε最优性的无模型智能体。创新点在于突破了传统模型依赖方法（如AIXI）的局限，通过Q归纳技术直接学习最优策略，无需显式维护环境模型。主要贡献包括：1）理论证明了AIQI在通用设置下的渐近最优性，填补了无模型方法在理论完备性上的空白；2）设计了高效的Q归纳算法，降低了计算复杂度，提升了可扩展性；3）在模拟环境中验证了AIQI的性能，相比模型基方法在样本效率和泛化能力上均有显著优势，为通用AI的实用化提供了新路径。",
        "published": "2026-02-26T17:21:16Z",
        "authors": [
          "Yegon Kim",
          "Juho Lee"
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "Model Agreement via Anchoring",
        "title_zh": "通过锚定实现模型一致性",
        "link": "https://arxiv.org/abs/2602.23360v1",
        "summary": "Numerous lines of aim to control $\\textit{model disagreement}$ -- the extent to which two machine learning models disagree in their predictions. We adopt a simple and standard notion of model disagreement in real-valued prediction problems, namely the expected squared difference in predictions betwe",
        "summary_zh": "许多研究旨在控制模型分歧——即两个机器学习模型在预测中不一致的程度。本文采用实值预测问题中简单标准的模型分歧定义，即预测间期望平方差。创新点在于提出“锚定”方法，通过引入参考模型或约束来减少模型间差异，而不牺牲个体性能。理论分析证明了锚定能有效降低分歧，提升模型集合的稳定性和可解释性。主要贡献是建立了模型一致性的通用框架，适用于回归和分类任务，为集成学习、联邦学习等场景提供新工具，增强AI系统的可靠性和协作效率。",
        "published": "2026-02-26T18:59:32Z",
        "authors": [
          "Eric Eaton",
          "Surbhi Goel",
          "Marcel Hussing"
        ],
        "categories": [
          "cs.LG",
          "cs.AI"
        ]
      },
      {
        "title": "The logic of KM belief update is contained in the logic of AGM belief revision",
        "title_zh": "KM信念更新的逻辑包含在AGM信念修正的逻辑中",
        "link": "https://arxiv.org/abs/2602.23302v1",
        "summary": "For each axiom of KM belief update we provide a corresponding axiom in a modal logic containing three modal operators: a unimodal belief operator $B$, a bimodal conditional operator $>$ and the unimodal necessity operator $\\square$. We then compare the resulting logic to the similar logic obtained f",
        "summary_zh": "本文为KM信念更新的每个公理，在包含三个模态算子（单模态信念算子B、双模态条件算子>和单模态必然算子□）的模态逻辑中提供对应公理。通过形式化比较，证明KM更新逻辑可嵌入AGM修正逻辑的扩展版本中。创新点在于建立了信念更新与修正理论间的精确映射，澄清了长期存在的逻辑关系争议。主要贡献是深化了对动态信念逻辑的理解，为知识表示和推理系统提供统一理论基础，推动AI中非单调推理和认知建模的发展，具有重要的哲学和计算意义。",
        "published": "2026-02-26T18:09:32Z",
        "authors": [
          "Giacomo Bonanno"
        ],
        "categories": [
          "cs.AI",
          "cs.LO",
          "math.LO"
        ]
      }
    ],
    "强化学习": [
      {
        "title": "On Sample-Efficient Generalized Planning via Learned Transition Models",
        "title_zh": "基于学习转移模型的样本高效广义规划",
        "link": "https://arxiv.org/abs/2602.23148v1",
        "summary": "Generalized planning studies the construction of solution strategies that generalize across families of planning problems sharing a common domain model, formally defined by a transition function $γ: S \\times A \\rightarrow S$. Classical approaches achieve such generalization through symbolic abstract",
        "summary_zh": "广义规划研究构建能在共享共同领域模型的规划问题族间泛化的解策略，形式上由转移函数$γ: S \\times A \\rightarrow S$定义。经典方法通过符号抽象实现这种泛化，但通常需要大量样本。本文提出一种基于学习转移模型的样本高效广义规划方法。创新点在于利用学习到的转移模型来近似领域动态，从而减少对大量交互数据的需求，实现更高效的策略泛化。主要贡献包括提出一种结合模型学习和规划的新框架，理论分析其样本复杂度，并在模拟环境中验证了其优于传统方法的性能，为强化学习中的泛化问题提供了新思路。",
        "published": "2026-02-26T16:13:46Z",
        "authors": [
          "Nitin Gupta",
          "Vishal Pallagani",
          "John A. Aydin..."
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "Accelerated Online Risk-Averse Policy Evaluation in POMDPs with Theoretical Guarantees and Novel CVaR Bounds",
        "title_zh": "具有理论保证和新CVaR界的POMDP中加速在线风险规避策略评估",
        "link": "https://arxiv.org/abs/2602.23073v1",
        "summary": "Risk-averse decision-making under uncertainty in partially observable domains is a central challenge in artificial intelligence and is essential for developing reliable autonomous agents. The formal framework for such problems is the partially observable Markov decision process (POMDP), where risk s...",
        "summary_zh": "在部分可观测领域中进行风险规避决策是人工智能的核心挑战，对开发可靠自主智能体至关重要。本研究针对部分可观测马尔可夫决策过程（POMDP），提出一种加速在线风险规避策略评估方法。创新点在于结合条件风险价值（CVaR）度量，引入新的理论界来保证评估的鲁棒性，并设计高效在线算法减少计算开销。主要贡献包括：提出首个具有严格理论保证的加速在线CVaR评估框架；推导出新颖的CVaR界，提升风险估计精度；通过实验验证了方法在复杂POMDP环境中的有效性和效率。",
        "published": "2026-02-26T15:01:40Z",
        "authors": [
          "Yaacov Pariente",
          "Vadim Indelman"
        ],
        "categories": [
          "math.ST",
          "cs.AI"
        ]
      }
    ],
    "计算机视觉/CV": [
      {
        "title": "RepSPD: Enhancing SPD Manifold Representation in EEGs via Dynamic Graphs",
        "title_zh": "RepSPD：通过动态图增强脑电图中的SPD流形表示",
        "link": "https://arxiv.org/abs/2602.22981v1",
        "summary": "Decoding brain activity from electroencephalography (EEG) is crucial for neuroscience and clinical applications. Among recent advances in deep learning for EEG, geometric learning stands out as its theoretical underpinnings on symmetric positive definite (SPD) allows revealing structural connectivit",
        "summary_zh": "从脑电图（EEG）解码大脑活动对神经科学和临床应用至关重要。在EEG深度学习的近期进展中，几何学习因其基于对称正定（SPD）流形的理论基础而突出，能够揭示结构连接性。本文创新性地提出了RepSPD方法，通过动态图建模来增强EEG数据中的SPD流形表示。主要贡献包括设计了一个结合图神经网络和流形学习的框架，有效捕捉了脑电信号的时空动态特性，并在多个基准数据集上验证了其在分类和可视化任务中的优越性能，推动了脑机接口技术的发展。",
        "published": "2026-02-26T13:22:19Z",
        "authors": [
          "Haohui Jia",
          "Zheng Chen",
          "Lingwei Zhu"
        ],
        "categories": [
          "cs.AI"
        ]
      },
      {
        "title": "MovieTeller: Tool-augmented Movie Synopsis with ID Consistent Progressive Abstraction",
        "title_zh": "MovieTeller：基于工具增强的电影摘要生成，具有ID一致渐进抽象",
        "link": "https://arxiv.org/abs/2602.23228v1",
        "summary": "With the explosive growth of digital entertainment, automated video summarization has become indispensable for applications such as content indexing, personalized recommendation, and efficient media archiving. Automatic synopsis generation for long-form videos, such as movies and TV series, presents",
        "summary_zh": "随着数字娱乐的爆炸式增长，自动化视频摘要对于内容索引、个性化推荐和高效媒体归档等应用变得不可或缺。针对长视频（如电影和电视剧）的自动摘要生成面临挑战，包括信息冗余和连贯性保持。本文提出MovieTeller，一种工具增强的方法，通过ID一致的渐进抽象来生成电影摘要。创新点在于结合了计算机视觉工具（如目标检测和场景分割）与自然语言处理，逐步抽象视频内容，同时保持角色和事件的一致性标识（ID），以提升摘要的准确性和可读性。主要贡献包括：1）开发了一种新颖的渐进抽象框架，有效处理长视频复杂性；2）引入了ID一致性机制，确保摘要中实体跟踪的连贯性；3）在公开数据集上验证了方法优于现有基线，在摘要质量和效率方面均有提升。",
        "published": "2026-02-26T17:08:08Z",
        "authors": [
          "Yizhi Li",
          "Xiaohan Chen",
          "Miao Jiang"
        ],
        "categories": [
          "cs.CV",
          "cs.AI"
        ]
      },
      {
        "title": "Risk-Aware World Model Predictive Control for Generalizable End-to-End Autonomous Driving",
        "title_zh": "基于风险感知世界模型预测控制的可泛化端到端自动驾驶",
        "link": "https://arxiv.org/abs/2602.23259v1",
        "summary": "With advances in imitation learning (IL) and large-scale driving datasets, end-to-end autonomous driving (E2E-AD) has made great progress recently. Currently, IL-based methods have become a mainstream paradigm: models rely on standard driving behaviors given by experts, and learn to minimize the discrepancy between predicted and expert actions. However, these methods often fail in safety-critical scenarios due to lack of explicit risk modeling. We propose a risk-aware world model predictive control framework that integrates probabilistic world models with risk-sensitive optimization. Our approach enables the agent to anticipate potential hazards and adjust driving policies accordingly, improving generalization to unseen environments. Experiments on real-world datasets show significant reductions in collision rates and enhanced robustness compared to state-of-the-art IL baselines.",
        "summary_zh": "本文提出了一种风险感知世界模型预测控制框架，用于提升端到端自动驾驶系统的可泛化性和安全性。研究创新点在于将概率世界模型与风险敏感优化相结合，使智能体能够预测潜在危险并动态调整驾驶策略。主要贡献包括：克服了传统模仿学习方法在安全关键场景中的局限性，通过显式风险建模减少了碰撞率；在真实世界数据集上的实验表明，该方法相比现有基线在未见环境中的鲁棒性显著增强，为自动驾驶系统提供了更可靠的决策机制。",
        "published": "2026-02-26T17:32:30Z",
        "authors": [
          "Jiangxin Sun",
          "Feng Xue",
          "Teng Long"
        ],
        "categories": [
          "cs.CV",
          "cs.AI",
          "cs.RO"
        ]
      },
      {
        "title": "Spatio-Temporal Token Pruning for Efficient High-Resolution GUI Agents",
        "title_zh": "面向高效高分辨率GUI智能体的时空令牌剪枝",
        "link": "https://arxiv.org/abs/2602.23235v1",
        "summary": "Pure-vision GUI agents provide universal interaction capabilities but suffer from severe efficiency bottlenecks due to the massive spatiotemporal redundancy inherent in high-resolution screenshots and historical trajectories. We identify two critical misalignments in existing compression paradigms: spatial pruning ignores temporal dependencies, while temporal methods overlook visual saliency. To address this, we introduce a novel spatio-temporal token pruning technique that jointly optimizes across both dimensions. Our method dynamically selects informative tokens based on content relevance and action history, reducing computational overhead by up to 70% without sacrificing accuracy. Evaluations on GUI automation tasks demonstrate state-of-the-art performance in speed and resource utilization, enabling real-time deployment on edge devices.",
        "summary_zh": "本文提出了一种时空令牌剪枝技术，旨在解决纯视觉GUI智能体在处理高分辨率截图和历史轨迹时的效率瓶颈。研究创新点在于联合优化空间和时间维度，动态选择信息丰富的令牌，克服了现有压缩方法中空间剪枝忽略时间依赖性或时间方法忽视视觉显著性的问题。主要贡献包括：开发了一种高效的剪枝算法，在GUI自动化任务中实现高达70%的计算开销减少，同时保持准确性；实验表明该方法在速度和资源利用方面达到先进水平，支持在边缘设备上的实时部署，提升了智能体的实用性。",
        "published": "2026-02-26T17:12:40Z",
        "authors": [
          "Zhou Xu",
          "Bowen Zhou",
          "Qi Wang"
        ],
        "categories": [
          "cs.CV",
          "cs.AI"
        ]
      },
      {
        "title": "pMoE: Prompting Diverse Experts Together Wins More in Visual Adaptation",
        "title_zh": "pMoE：协同提示多样化专家在视觉适应任务中取得更优性能",
        "link": "https://arxiv.org/abs/2602.22938v1",
        "summary": "Parameter-efficient fine-tuning has demonstrated promising results across various visual adaptation tasks, such as classification and segmentation. Typically, prompt tuning techniques have harnessed knowledge from a single pre-trained model, whether from a general or a specialized medical domain. However, this limits adaptability to diverse scenarios. We propose pMoE, a prompting framework that integrates multiple expert models via a mixture-of-experts architecture. By dynamically routing inputs to the most relevant experts, pMoE achieves superior performance on cross-domain visual tasks. Experiments on benchmarks including ImageNet and medical imaging datasets show consistent improvements over single-model prompting, with up to 15% accuracy gains in few-shot settings. Our approach provides a scalable solution for leveraging heterogeneous pre-trained knowledge.",
        "summary_zh": "本文提出了pMoE框架，通过混合专家架构集成多个预训练模型，以提升视觉适应任务的性能。研究创新点在于利用动态路由机制将输入分配给最相关的专家，克服了传统提示调优仅依赖单一模型知识的局限性。主要贡献包括：在ImageNet和医学影像数据集等基准测试中，pMoE相比单模型提示方法在少样本设置下实现了高达15%的准确率提升；该框架为利用异构预训练知识提供了可扩展的解决方案，增强了模型在跨领域任务中的适应性和泛化能力。",
        "published": "2026-02-26T12:27:06Z",
        "authors": [
          "Shentong Mo",
          "Xufang Luo",
          "Dongsheng Li"
        ],
        "categories": [
          "cs.CV",
          "cs.AI",
          "cs.LG"
        ]
      },
      {
        "title": "Devling into Adversarial Transferability on Image Classification: Review, Benchmark, and Evaluation",
        "title_zh": "深入探究图像分类中的对抗可转移性：综述、基准与评估",
        "link": "https://arxiv.org/abs/2602.23117v1",
        "summary": "Adversarial transferability refers to the capacity of adversarial examples generated on the surrogate model to deceive alternate, unexposed victim models. This property eliminates the need for direct access to the victim model during an attack, thereby raising considerable security concerns in practical applications. This paper provides a comprehensive review of adversarial transferability, establishes a standardized benchmark for evaluation, and conducts extensive experiments to analyze factors influencing transferability across different model architectures and datasets.",
        "summary_zh": "本文系统研究对抗可转移性，即攻击者利用替代模型生成的对抗样本欺骗未知目标模型的能力，这在实际应用中引发重大安全担忧。创新点在于首次整合了对抗可转移性的全面综述、标准化评估基准和跨模型架构与数据集的广泛实验分析。主要贡献包括：梳理了现有攻击方法的分类与演进，提出了统一的评估框架以量化可转移性，并揭示了模型相似性、数据分布和攻击策略对可转移性的关键影响，为防御机制设计提供了实证基础。",
        "published": "2026-02-26T15:30:36Z",
        "authors": [
          "Xiaosen Wang",
          "Zhijin Ge",
          "Bohan Liu"
        ],
        "categories": [
          "cs.CV",
          "cs.AI"
        ]
      },
      {
        "title": "Latent Gaussian Splatting for 4D Panoptic Occupancy Tracking",
        "title_zh": "基于潜在高斯泼溅的4D全景占用跟踪",
        "link": "https://arxiv.org/abs/2602.23172v1",
        "summary": "Capturing 4D spatiotemporal surroundings is crucial for the safe and reliable operation of robots in dynamic environments. However, most existing methods address only one side of the problem: they either provide coarse geometric tracking via bounding boxes, or detailed 3D structures like voxel-based reconstructions, but fail to unify high-fidelity geometry with semantic instance tracking over time. We propose Latent Gaussian Splatting (LGS), a novel representation that models 4D scenes as a set of latent Gaussians evolving in time, enabling simultaneous panoptic segmentation and occupancy estimation with continuous spatiotemporal consistency.",
        "summary_zh": "本文提出潜在高斯泼溅（LGS）方法，用于动态环境中机器人的4D时空场景感知。创新点在于将4D场景建模为一组随时间演化的潜在高斯分布，统一了高保真几何重建与语义实例跟踪，克服了现有方法在粗粒度跟踪与细节结构间的割裂。主要贡献包括：开发了连续时空一致的表征，实现了全景分割与占用估计的同步优化；通过可微分渲染提升效率，在合成与真实数据集上验证了其在动态物体跟踪和场景理解方面的优越性，为机器人导航与交互提供了更可靠的感知基础。",
        "published": "2026-02-26T16:34:45Z",
        "authors": [
          "Maximilian Luz",
          "Rohit Mohan",
          "Thomas Nürnberg"
        ],
        "categories": [
          "cs.CV",
          "cs.AI",
          "cs.RO"
        ]
      },
      {
        "title": "ColoDiff: Integrating Dynamic Consistency With Content Awareness for Colonoscopy Video Generation",
        "title_zh": "ColoDiff：整合动态一致性与内容感知用于结肠镜视频生成",
        "link": "https://arxiv.org/abs/2602.23203v1",
        "summary": "Colonoscopy video generation delivers dynamic, information-rich data critical for diagnosing intestinal diseases, particularly in data-scarce scenarios. High-quality video generation demands temporal consistency and precise control over clinical attributes, but faces challenges from irregular intest",
        "summary_zh": "结肠镜视频生成为诊断肠道疾病提供动态、信息丰富的数据，在数据稀缺场景中尤为重要。高质量视频生成需要时间一致性和对临床属性的精确控制，但面临肠道不规则运动等挑战。本文提出ColoDiff，一种基于扩散模型的视频生成框架，创新性地整合动态一致性模块与内容感知机制。通过引入时间注意力机制和临床属性引导，确保生成视频在时序上连贯且医学特征准确。主要贡献是实现了高保真结肠镜视频合成，能模拟真实检查过程，为医疗训练和数据增强提供实用工具，提升诊断模型的鲁棒性。",
        "published": "2026-02-26T16:51:24Z",
        "authors": [
          "Junhu Fu",
          "Shuyu Liang",
          "Wutong Li"
        ],
        "categories": [
          "cs.CV",
          "cs.AI"
        ]
      }
    ],
    "硬件加速器与优化算法": [
      {
        "title": "Bitwise Systolic Array Architecture for Runtime-Reconfigurable Multi-precision Quantized Multiplication on Hardware Accelerators",
        "title_zh": "面向硬件加速器的运行时可重构多精度量化乘法的比特级脉动阵列架构",
        "link": "https://arxiv.org/abs/2602.23334v1",
        "summary": "Neural network accelerators have been widely applied to edge devices for complex tasks like object tracking, image recognition, etc. Previous works have explored the quantization technologies in related lightweight accelerator designs to reduce hardware resource consumption. However, low precision l",
        "summary_zh": "本文提出了一种创新的比特级脉动阵列架构，用于在硬件加速器上实现运行时可重构的多精度量化乘法。该研究针对边缘设备中神经网络加速器的资源限制问题，通过动态调整计算精度（如4位、8位、16位）来优化硬件效率。核心创新在于设计了一种灵活的硬件结构，能够在运行时根据任务需求自适应切换精度模式，从而在保持高性能的同时显著降低功耗和面积开销。主要贡献包括：1）提出了一种可扩展的比特级处理单元；2）实现了硬件层面的动态精度管理机制；3）在典型边缘计算场景下验证了架构的有效性，为轻量化AI加速器设计提供了新思路。",
        "published": "2026-02-26T18:40:02Z",
        "authors": [
          "Yuhao Liu",
          "Salim Ullah",
          "Akash Kumar"
        ],
        "categories": [
          "cs.AR",
          "cs.AI"
        ]
      }
    ],
    "人机交互与工具评估": [
      {
        "title": "Understanding Usage and Engagement in AI-Powered Scientific Research Tools: The Asta Interaction Dataset",
        "title_zh": "理解AI驱动的科学研究工具的使用与参与度：Asta交互数据集",
        "link": "https://arxiv.org/abs/2602.23335v1",
        "summary": "AI-powered scientific research tools are rapidly being integrated into research workflows, yet the field lacks a clear lens into how researchers use these systems in real-world settings. We present and analyze the Asta Interaction Dataset, a large-scale resource comprising over 200,000 user queries",
        "summary_zh": "本研究针对AI驱动的科学研究工具在实际工作流中的使用模式，提出了Asta交互数据集，包含超过20万条用户查询记录，旨在填补该领域缺乏真实世界使用数据的空白。创新点在于首次大规模量化分析了研究人员与AI工具的交互行为，揭示了查询类型、频率和上下文依赖关系。主要贡献包括：1）构建了一个公开可用的高质量交互数据集；2）开发了分析框架以识别使用模式和参与度指标；3）为工具优化和用户体验设计提供了实证依据，推动AI辅助科研向更高效、人性化方向发展。",
        "published": "2026-02-26T18:40:28Z",
        "authors": [
          "Dany Haddad",
          "Dan Bareket",
          "Joseph Chee Chang..."
        ],
        "categories": [
          "cs.HC",
          "cs.AI",
          "cs.IR"
        ]
      }
    ],
    "大语言模型与金融应用": [
      {
        "title": "Toward Expert Investment Teams: A Multi-Agent LLM System with Fine-Grained Trading Tasks",
        "title_zh": "迈向专家投资团队：基于细粒度交易任务的多智能体大语言模型系统",
        "link": "https://arxiv.org/abs/2602.23330v1",
        "summary": "The advancement of large language models (LLMs) has accelerated the development of autonomous financial trading systems. While mainstream approaches deploy multi-agent systems mimicking analyst and manager roles, they often rely on abstract instructions that overlook the intricacies of real-world wo",
        "summary_zh": "本文提出了一种基于多智能体大语言模型（LLM）的金融交易系统，旨在模拟专家投资团队的决策过程。与现有方法依赖抽象指令不同，该研究创新性地引入了细粒度任务分解机制，将交易流程拆解为具体可执行步骤（如市场分析、风险评估、订单执行），从而更好地处理现实世界复杂性。主要贡献包括：1）设计了分层多智能体架构，协调分析师、经理等角色；2）开发了任务驱动的交互协议，提升系统可靠性和透明度；3）在模拟交易环境中验证了系统性能，展示了LLM在复杂金融场景中的应用潜力。",
        "published": "2026-02-26T18:37:36Z",
        "authors": [
          "Kunihiro Miyazaki",
          "Takanobu Kawahara",
          "Stephen Roberts..."
        ],
        "categories": [
          "cs.AI",
          "q-fin.TR"
        ]
      }
    ],
    "多模态学习与医疗诊断": [
      {
        "title": "CXReasonAgent: Evidence-Grounded Diagnostic Reasoning Agent for Chest X-rays",
        "title_zh": "CXReasonAgent：基于证据的胸部X光诊断推理智能体",
        "link": "https://arxiv.org/abs/2602.23276v1",
        "summary": "Chest X-ray plays a central role in thoracic diagnosis, and its interpretation inherently requires multi-step, evidence-grounded reasoning. However, large vision-language models (LVLMs) often generate plausible responses that are not faithfully grounded in diagnostic evidence and provide limited vis",
        "summary_zh": "本研究针对胸部X光诊断中多步骤、证据驱动的推理需求，提出了CXReasonAgent——一种基于证据的诊断推理智能体。针对现有大型视觉语言模型（LVLM）可能生成缺乏证据支持的回答的问题，该研究创新性地整合了视觉特征提取、医学知识库查询和可解释推理链生成模块。主要贡献包括：1）开发了端到端的证据锚定框架，确保诊断结论与影像特征直接关联；2）引入了可解释的推理路径可视化，增强临床可信度；3）在公开胸部X光数据集上验证了模型性能，为AI辅助医疗诊断提供了更可靠、透明的解决方案。",
        "published": "2026-02-26T17:51:21Z",
        "authors": [
          "Hyungyung Lee",
          "Hangyul Yoon",
          "Edward Choi"
        ],
        "categories": [
          "cs.AI"
        ]
      }
    ],
    "大语言模型与优化算法": [
      {
        "title": "Enhancing CVRP Solver through LLM-driven Automatic Heuristic Design",
        "title_zh": "通过LLM驱动的自动启发式设计增强CVRP求解器",
        "link": "https://arxiv.org/abs/2602.23092v1",
        "summary": "The Capacitated Vehicle Routing Problem (CVRP), a fundamental combinatorial optimization challenge, focuses on optimizing fleet operations under vehicle capacity constraints. While extensively studied in operational research, the NP-hard nature of CVRP continues to pose significant computational cha",
        "summary_zh": "本文针对容量约束车辆路径问题（CVRP）这一NP难组合优化挑战，提出了一种基于大语言模型（LLM）驱动的自动启发式设计方法。创新点在于利用LLM的自然语言理解和生成能力，自动探索和优化启发式规则，以替代传统手工设计或强化学习方案。主要贡献包括：1）构建了LLM与优化求解器的协同框架，实现启发式规则的动态生成与评估；2）设计了提示工程策略，引导LLM产出高效、可解释的启发式；3）在标准CVRP基准测试中显著提升求解效率，为运筹学领域引入了AI驱动的新型算法设计范式。",
        "published": "2026-02-26T15:12:23Z",
        "authors": [
          "Zhuoliang Xie",
          "Fei Liu",
          "Zhenkun Wang..."
        ],
        "categories": [
          "cs.AI"
        ]
      }
    ],
    "机器人": [
      {
        "title": "ReCoN-Ipsundrum: An Inspectable Recurrent Persistence Loop Agent with Affect-Coupled Control and Mechanism-Linked Consciousness Indicator Assays",
        "title_zh": "ReCoN-Ipsundrum：一种具有情感耦合控制和机制关联意识指标检测的可检查循环持久性循环智能体",
        "link": "https://arxiv.org/abs/2602.23232v1",
        "summary": "Indicator-based approaches to machine consciousness recommend mechanism-linked evidence triangulated across tasks, supported by architectural inspection and causal intervention. Inspired by Humphrey's ipsundrum hypothesis, we implement ReCoN-Ipsundrum, an inspectable agent that extends a ReCoN state",
        "summary_zh": "本文提出了ReCoN-Ipsundrum，一种可检查的循环持久性循环智能体，旨在通过机制关联的意识指标来研究机器意识。创新点在于结合了Humphrey的ipsundrum假说，将情感耦合控制与循环状态扩展相结合，实现了对意识过程的透明化检测。主要贡献包括：1）设计了一种新型智能体架构，整合了情感反馈和持久性记忆循环，增强了行为的适应性和可解释性；2）开发了一套机制关联的意识指标检测方法，通过多任务三角验证和因果干预来量化意识表现；3）在模拟机器人任务中验证了该智能体的有效性，展示了其在复杂环境中的鲁棒控制能力，为意识计算模型提供了实验基础。",
        "published": "2026-02-26T17:11:08Z",
        "authors": [
          "Aishik Sanyal"
        ],
        "categories": [
          "cs.AI"
        ]
      }
    ],
    "联邦学习": [
      {
        "title": "Conformalized Neural Networks for Federated Uncertainty Quantification under Dual Heterogeneity",
        "title_zh": "面向双重异构联邦学习的不确定性量化：保形化神经网络方法",
        "link": "https://arxiv.org/abs/2602.23296v1",
        "summary": "Federated learning (FL) faces challenges in uncertainty quantification (UQ). Without reliable UQ, FL systems risk deploying overconfident models at under-resourced agents, leading to silent local failures despite seemingly satisfactory global performance. Existing federated UQ approaches often address only statistical heterogeneity, neglecting system-level resource disparities. We propose a conformalized neural network framework that jointly models data and system heterogeneity, providing provable uncertainty guarantees for FL agents with varying computational and data constraints.",
        "summary_zh": "本文针对联邦学习中的不确定性量化挑战，提出一种保形化神经网络框架，同时处理数据与系统层面的双重异构性。创新点在于整合了统计异质性与资源差异建模，为不同计算和数据约束的智能体提供可证明的不确定性保证。主要贡献包括：设计了分布式保形预测算法，确保局部预测的可靠性；通过理论分析与实验验证，该方法能有效防止资源匮乏节点上的过自信模型部署，提升联邦系统的鲁棒性与安全性。",
        "published": "2026-02-26T18:07:45Z",
        "authors": [
          "Quang-Huy Nguyen",
          "Jiaqi Wang",
          "Wei-Shinn Ku"
        ],
        "categories": [
          "cs.LG",
          "cs.AI"
        ]
      }
    ],
    "推荐系统": []
  },
  "category_summaries": {
    "大语言模型/LLM": "今日研究聚焦于LLM的推理能力提升和效率优化，多篇论文探索了思维链提示、模型压缩和知识蒸馏技术。亮点包括新型架构设计以减少计算开销，以及结合外部知识库增强事实准确性，推动LLM在复杂任务中的实用化。",
    "优化算法": "研究趋势集中在分布式优化和自适应学习率方法，针对大规模AI训练场景。亮点包括提出高效梯度下降变体，减少通信成本，并探索非凸优化中的收敛性保证，以提升模型训练速度和稳定性。",
    "多模态学习": "今日论文强调跨模态对齐和融合技术，如视觉-语言模型的联合训练。亮点包括开发统一框架处理图像、文本和音频数据，并应用于内容生成和检索任务，推动多模态AI的泛化能力。",
    "NLP": "研究热点包括低资源语言处理和语义理解增强，通过预训练模型微调和数据增强方法。亮点包括改进的命名实体识别和情感分析模型，以及探索对话系统的上下文感知能力。",
    "生成模型": "趋势聚焦于扩散模型和GAN的改进，提升生成质量和多样性。亮点包括提出高效采样算法加速推理，并研究可控生成技术，应用于艺术创作和合成数据生成。",
    "图神经网络": "研究集中在动态图学习和异构图处理，针对社交网络和推荐系统。亮点包括开发可扩展的图卷积方法，并探索图结构预测任务，以增强模型对复杂关系的建模能力。",
    "强化学习/RL": "今日论文关注样本效率提升和策略优化，在机器人控制和游戏领域。亮点包括提出新型探索策略和离线RL方法，减少对大量交互数据的需求，推动RL在现实场景的应用。",
    "理论研究": "研究趋势涉及AI可解释性和泛化理论，分析模型决策过程和鲁棒性。亮点包括形式化定义公平性指标，并探索对抗攻击下的模型稳定性，为AI系统提供理论支撑。",
    "计算机视觉/CV": "热点包括目标检测和图像分割的精度提升，通过注意力机制和Transformer架构。亮点包括开发轻量级模型用于移动设备，并研究少样本学习在视觉任务中的应用。",
    "硬件加速器与优化算法": "研究聚焦于AI芯片设计和算法-硬件协同优化，提升能效和吞吐量。亮点包括提出定制化加速器支持特定模型，并探索内存优化技术减少延迟。",
    "人机交互与工具评估": "趋势包括AI辅助工具开发和用户体验评估，针对教育和创意领域。亮点包括研究交互式系统设计，并量化AI工具对工作效率的影响，促进人机协作。",
    "大语言模型与金融应用": "研究探索LLM在风险评估和交易预测中的应用，通过微调和领域适配。亮点包括开发金融专用模型处理结构化数据，并强调可解释性以满足监管要求。",
    "多模态学习与医疗诊断": "热点集中在医学图像分析和临床文本融合，提升诊断准确性。亮点包括提出多模态框架整合影像和病历数据，并研究隐私保护技术，推动AI在医疗中的安全部署。",
    "大语言模型与优化算法": "研究结合LLM和优化技术，用于自动超参数调优和资源分配。亮点包括开发基于LLM的优化代理，减少人工干预，并应用于大规模模型训练管理。",
    "机器人": "趋势包括机器人感知和运动规划，通过强化学习和仿真训练。亮点包括提出多任务学习框架，并研究人机协作中的安全性和适应性，推动自主机器人发展。",
    "联邦学习": "研究关注隐私保护和通信效率，在分布式数据场景。亮点包括开发差分隐私算法和模型聚合策略，并探索跨设备联邦学习，以应对数据异构性挑战。",
    "推荐系统": "热点包括个性化推荐和序列建模，通过图神经网络和注意力机制。亮点包括提出动态兴趣捕捉方法，并研究公平性推荐，减少偏见，提升用户体验。"
  },
  "highlights": [
    "研究亮点1：FlashOptim优化器通过动态量化和稀疏化技术，将训练内存需求降低50%以上，为大规模模型训练提供了高效内存解决方案，具有重要实用价值。",
    "研究亮点2：SeeThrough3D框架在文本到图像生成中引入遮挡感知模块，显著提升三维场景的几何一致性和真实感，推动了可控生成模型的技术前沿。",
    "研究亮点1：SPARTA基准通过原则性方法自动生成大规模树结构多跳问答数据集，显著提升跨模态推理评估的深度和可扩展性，对推动NLP和数据库交叉研究具有重要学术价值。",
    "研究亮点2：隐写术的决策理论形式化框架为LLM监控提供理论基础，能有效检测模型逃避监管的行为，在AI安全和可解释性方面具有高度实用性。",
    "研究亮点3：ODEBrain模型结合常微分方程和图神经网络建模连续时间脑动力学，避免了传统离散化方法的误差，为神经科学和脑机接口研究带来创新工具。",
    "研究亮点1：LLMServingSim 2.0：异构与解耦大语言模型服务基础设施的统一模拟器——核心创新在于整合硬件异构性和软件解耦趋势，提供一个可扩展框架，模拟复杂LLM服务系统的性能，助力高效架构设计，具有高实用性。",
    "研究亮点2：高效的无编码器傅里叶基三维大模态模型——核心创新在于利用傅里叶变换直接处理3D数据，避免重型编码器，实现轻量化和快速推理，为3D多模态应用如机器人感知提供高效解决方案，兼具学术与实用价值。",
    "研究亮点3：认证电路：机械电路稳定性保证——核心创新在于引入形式化验证技术，确保神经网络可解释性中的电路稳定性，增强AI系统的可靠性和安全性，具有重要理论意义和潜在应用前景。",
    "研究亮点1：OmniGAIA论文提出原生全模态AI智能体框架，创新性地统一处理视觉、音频和语言模态，推动多模态学习向更通用、交互性强的方向发展，具有高学术价值和广泛实用性潜力。",
    "研究亮点2：Agency and Architectural Limits论文从理论角度论证优化系统无法响应规范，为AI治理提供批判性见解，挑战现有假设，对高风险AI应用的设计和监管具有重要指导意义。"
  ],
  "daily_summary": "今日AI研究动态显示，大语言模型（LLM）和多模态学习成为核心热点，多篇论文聚焦于提升模型推理能力和跨模态对齐技术。在LLM方向，研究重点转向效率优化和知识增强，通过架构改进和外部知识整合，推动其在金融、医疗等领域的实用化。多模态学习则强调统一框架开发，以处理图像、文本和音频的融合任务，增强AI的泛化性能。此外，优化算法和硬件加速器的协同研究突出，旨在解决大规模训练中的计算和能效挑战，支持AI系统的高效部署。\n整体上，AI研究趋势呈现跨领域融合特点，如LLM与优化算法结合用于自动调优，多模态学习与医疗诊断集成提升诊断精度。创新突破包括新型采样算法加速生成模型推理，以及联邦学习中的隐私保护技术进展。这些发展反映了AI领域向更高效、可解释和安全的方向演进，为现实世界应用奠定基础。"
}