{
  "title": "What do people want to fact-check?",
  "link": "https://arxiv.org/abs/2602.10935v1",
  "published": "2026-02-11T15:14:54Z",
  "updated": "2026-02-11T15:14:54Z",
  "summary": "Research on misinformation has focused almost exclusively on supply, asking what falsehoods circulate, who produces them, and whether corrections work. A basic demand-side question remains unanswered. When ordinary people can fact-check anything they want, what do they actually ask about? We provide the first large-scale evidence on this question by analyzing close to 2{,}500 statements submitted by 457 participants to an open-ended AI fact-checking system. Each claim is classified along five semantic dimensions (domain, epistemic form, verifiability, target entity, and temporal reference), producing a behavioral map of public verification demand. Three findings stand out. First, users range widely across topics but default to a narrow epistemic repertoire, overwhelmingly submitting simple descriptive claims about present-day observables. Second, roughly one in four requests concerns statements that cannot be empirically resolved, including moral judgments, speculative predictions, and subjective evaluations, revealing a systematic mismatch between what users seek from fact-checking tools and what such tools can deliver. Third, comparison with the FEVER benchmark dataset exposes sharp structural divergences across all five dimensions, indicating that standard evaluation corpora encode a synthetic claim environment that does not resemble real-world verification needs. These results reframe fact-checking as a demand-driven problem and identify where current AI systems and benchmarks are misaligned with the uncertainty people actually experience.",
  "id": "http://arxiv.org/abs/2602.10935v1",
  "authors": [
    "Bijean Ghafouri",
    "Dorsaf Sallami",
    "Luca Luceri",
    "Taylor Lynn Curtis",
    "Jean-Francois Godbout",
    "Emilio Ferrara",
    "Reihaneh Rabbany"
  ],
  "categories": [
    "cs.HC",
    "cs.AI"
  ],
  "pdf_link": "https://arxiv.org/pdf/2602.10935v1"
}