{
  "title": "Unresponsive Buttons on My Fastest Hardware Ever",
  "link": "https://blog.jim-nielsen.com/2026/unresponsive-buttons/",
  "published": "Wed, 11 Feb 2026 19:00:00 GMT",
  "summary": "<p>This is one of those small things that drives me nuts.</p>\n<p>Why? I don’t know. I think it has something to do with the fact that I have a computer that is faster than any computer I’ve ever used in my entire life — and yet, clicking on buttons results in slight but perceptible delays.</p>\n<p>Let me explain.</p>\n<p>Imagine a button that looks like this:</p>\n<pre><code class=\"language language-jsx\">&lt;<span class=\"hljs-title class_\">Button</span>\n  onClick={<span class=\"hljs-title function_\">async</span> () =&gt; {\n    <span class=\"hljs-keyword\">const</span> data = <span class=\"hljs-keyword\">await</span> <span class=\"hljs-title function_\">getSessionUrlFromStripe</span>(id);\n    <span class=\"hljs-variable language_\">window</span>.<span class=\"hljs-property\">location</span> = data.<span class=\"hljs-property\">url</span>;\n  }\n&gt;<span class=\"hljs-title class_\">Upgrade</span> to <span class=\"hljs-title class_\">Pro</span>&lt;/<span class=\"hljs-title class_\">Button</span>&gt;\n</code></pre>\n<p>For SPA apps, when the user clicks that button it takes a split second (even on a fast connection) for anything to happen because:</p>\n<ul>\n<li>The browser makes a request to the server</li>\n<li>The server talks to Stripe to get a session</li>\n<li>The server responds with the session data to the client</li>\n<li>The client redirects</li>\n</ul>\n<p>When clicking on that button, even on a fast connection, my brain glitches for a second, my thought process going something like:</p>\n<ul>\n<li>I click</li>\n<li>[nothing happens]</li>\n<li>I think “Did that work?”</li>\n<li>Just as I’m about to click again, I see the URL bar change</li>\n<li>I think, “Oh, ok, it’s doing <em>something</em>.”</li>\n<li>I stop myself from clicking again while I wait for the UI to redraw</li>\n</ul>\n<p>Granted those thoughts occur in my brain in under a second, but I hate that pause of indetermination.</p>\n<p>I clicked, I want (perceptibly) <em>instant</em> feedback. If something is happening, tell me!</p>\n<p>For SPA apps, you could put some state in there, like:</p>\n<pre><code class=\"language language-jsx\"><span class=\"hljs-keyword\">const</span> [isLoading, setIsLoading] = <span class=\"hljs-title function_\">useState</span>(<span class=\"hljs-literal\">false</span>);\n\n<span class=\"hljs-keyword\">return</span> (\n  <span class=\"language-xml\"><span class=\"hljs-tag\">&lt;<span class=\"hljs-name\">Button</span>\n  <span class=\"hljs-attr\">onClick</span>=<span class=\"hljs-string\">{async</span> () =&gt;</span> {\n    setIsLoading(true);\n    const data = await getSessionUrlFromStripe(id);\n    window.location = data.url;\n  }\n  &gt;{isLoading ? &#x27;Upgrading...&#x27; : &#x27;Upgrade to Pro&#x27;}<span class=\"hljs-tag\">&lt;/<span class=\"hljs-name\">Button</span>&gt;</span></span>\n)\n</code></pre>\n<p>This would provide more immediate feedback. But it also raises a whole set of other questions:</p>\n<ul>\n<li>Is that actually the interaction you want, where the text changes? That’s probably gonna shift layout. Maybe you want something different, like a spinner in place of the text. How do you handle that?</li>\n<li>What if you have multiple places to upgrade? Do you have to implement <code>isLoading</code> state in all those places too? What if the trigger in each place is slightly different? A button here, some text there, and icon over yonder? How do you handle all of those different interactions in a standard, immediate way?</li>\n<li>Errors. What if it fails? Well, we already weren’t handling that in the first code example were we? But maybe we should…</li>\n</ul>\n<p>Oh boy, this is getting complicated isn’t it?</p>\n<p>This is why, I assume, lots of apps just don’t deal with it. </p>\n<p>They accept there will be a slight delay in the responsiveness of the UI (and that it might error, but the user can just click again) and justify that it’s really not that big of a deal if there’s a slight, almost imperceptible delay between clicking a button and seeing the UI respond.</p>\n<p>“We’ve got bigger fish to fry.”</p>\n<p>And it makes sense. I mean, a slight delay in UI responsiveness, is that why people will or won’t buy your thing? Seems like a small detail. Who’s got the time to spend on details like this?Who cares? </p>\n<p>I care. That’s why I’m writing this post.</p>\n<p>To my original point, every piece of hardware I currently own is the fastest version of that device I’ve ever had in my life. And yet, everywhere I go I encounter lag. <a href=\"https://world.hey.com/jason/the-big-regression-da7fc60d\">Lag everywhere.</a></p>\n<p>And I’m grumpy about it, hence this post.</p>\n\n    <hr />\n    \n\n    <p>\n      Reply via:\n      \n\n      <a href=\"mailto:jimniels%2Bblog@gmail.com?subject=Re:%20blog.jim-nielsen.com/2026/unresponsive-buttons/\">Email</a>\n      · <a href=\"https://mastodon.social/@jimniels\">Mastodon</a> ·\n\n      <a href=\"https://bsky.app/profile/jim-nielsen.com\">Bluesky</a>\n    </p>",
  "id": "https://blog.jim-nielsen.com/2026/unresponsive-buttons/"
}