{
  "title": "Unusual circuits in the Intel 386's standard cell logic",
  "link": "http://www.righto.com/2025/11/unusual-386-standard-cell-circuits.html",
  "published": "2025-11-22T08:15:00.000-08:00",
  "summary": "<p>I've been studying the standard cell circuitry in the Intel 386 processor recently.\nThe 386, introduced in 1985, was Intel's most complex processor at the time, containing 285,000 transistors.\nIntel's existing design techniques couldn't handle this complexity and the chip began to fall behind schedule.\nTo meet the schedule, the 386 team started using a technique called standard cell logic.\nInstead of laying out each transistor manually, the layout process was performed by a computer.</p>\n<p>The idea behind standard cell logic is to create standardized circuits (standard cells) for each type of logic element, such\nas an inverter, NAND gate, or latch.\nYou feed your circuit description into software that selects the necessary cells, \npositions these cells into columns, and then routes the wiring between the cells.\nThis \"automatic place and route\" process creates the chip layout much faster than manual layout.\nHowever, switching to standard cells was a risky decision since if the software couldn't create a\ndense enough layout, the chip couldn't be manufactured.\nBut in the end, the 386 finished ahead of schedule, an almost unheard-of accomplishment.<span id=\"fnref:oral-history\"><a class=\"ref\" href=\"#fn:oral-history\">1</a></span></p>\n<p>The 386's standard cell circuitry contains a few circuits that I didn't expect.\nIn this blog post, I'll take a quick look at some of these circuits:\nsurprisingly large multiplexers, a transistor that doesn't fit into the standard cell layout,\nand inverters that turned out not to be inverters.\n(If you want more background on standard cells in the 386, see my earlier post,\n\"<a href=\"https://www.righto.com/2024/01/intel-386-standard-cells.html\">Reverse engineering standard cell logic in the Intel 386 processor</a>\".)</p>\n<p>The photo below shows the 386 die with the automatic-place-and-route regions highlighted; I'm focusing\non the red region in the lower right.\nThese blocks of logic have cells arranged in rows, giving them a characteristic striped appearance.\nThe dark stripes are the transistors that make up the logic gates, while the lighter regions between the stripes are the\n\"routing channels\" that hold the wiring that connects the cells.\nIn comparison,\nfunctional blocks\nsuch as the datapath on the left\nand the microcode ROM in the lower right\nwere designed manually to optimize density and performance, giving them a more solid appearance.</p>\n<p><a href=\"https://static.righto.com/images/386-curiosities/die-labeled.jpg\"><img alt=\"The 386 die with the standard-cell regions highlighted.\" class=\"hilite\" height=\"530\" src=\"https://static.righto.com/images/386-curiosities/die-labeled-w500.jpg\" title=\"The 386 die with the standard-cell regions highlighted.\" width=\"500\" /></a><div class=\"cite\">The 386 die with the standard-cell regions highlighted.</div></p>\n<p>As for other features on the chip,\nthe black circles around the border are bond wire connections that go to the chip's external pins.\nThe chip has two metal layers, a small number by modern\nstandards, but a jump from the single metal layer of earlier processors such as the 286.\n(Providing two layers of metal made automated routing practical: one layer can hold horizontal wires while the other layer\ncan hold vertical wires.)\nThe metal appears white in larger areas, but\npurplish where circuitry underneath roughens its surface.\nThe underlying silicon and the polysilicon wiring are obscured by the metal layers.</p>\n<h2>The giant multiplexers</h2>\n<p>The standard cell circuitry that I'm examining (red box above) is part of the control logic that selects registers\nwhile executing an instruction.\nYou might think that it is easy to select which registers take part in an instruction, but\ndue to the complexity of the x86 architecture, it is more difficult.\nOne problem is that a 32-bit register such as EAX can also be treated as the 16-bit register AX,\nor two 8-bit registers AH and AL.\nA second problem is that some instructions include a \"direction\" bit that switches the source and\ndestination registers.\nMoreover, sometimes the register is specified by bits in the instruction, but in other cases,\nthe register is specified by the microcode.\nDue to these factors, selecting the registers for an operation is a complicated process with many\ncases, using control bits from the instruction, from the microcode, and from other sources.</p>\n<p>Three registers need to be selected for an operation&mdash;two source registers and a destination register&mdash;and there\nare about 17 cases that need to be handled.\nRegisters are specified with 7-bit control signals that select one of the 30 registers and control\nwhich part of the register is accessed.\nWith three control signals, each 7 bits wide, and about 17 cases for each, you can see that\nthe register control logic is large and complicated.\n(I wrote more about the 386's registers <a href=\"https://www.righto.com/2025/05/intel-386-register-circuitry.html\">here</a>.)</p>\n<p>I'm still reverse engineering the register control logic, so I won't go into details.\nInstead, I'll discuss how the register control circuit uses multiplexers, implemented with standard cells.\nA multiplexer is a circuit that combines multiple\ninput signals into a single output by selecting one of the inputs.<span id=\"fnref:one-hot\"><a class=\"ref\" href=\"#fn:one-hot\">2</a></span>\nA multiplexer can be implemented with logic gates, for instance, by ANDing each input with the\ncorresponding control line, and then ORing the results together.\nHowever, the 386 uses a different approach&mdash;CMOS switches&mdash;that avoids a large AND/OR gate.</p>\n<p><a href=\"https://static.righto.com/images/386-curiosities/cmos-switch.jpg\"><img alt=\"Schematic of a CMOS switch.\" class=\"hilite\" height=\"169\" src=\"https://static.righto.com/images/386-curiosities/cmos-switch-w200.jpg\" title=\"Schematic of a CMOS switch.\" width=\"200\" /></a><div class=\"cite\">Schematic of a CMOS switch.</div></p>\n<p>The schematic above shows how a CMOS switch is constructed from two MOS transistors.\nWhen the two transistors are on, the output is connected to the input, but when the two transistors are\noff, the output is isolated.\nAn NMOS transistor is turned on when its input is high, but a PMOS transistor is turned on when its\ninput is <em>low</em>. Thus, the switch uses two control inputs, one inverted.\nThe motivation for using two transistors is that an NMOS transistor is better at pulling the output\nlow, while a PMOS transistor is better at pulling the output high, so combining them yields the best performance.<span id=\"fnref:6502\"><a class=\"ref\" href=\"#fn:6502\">3</a></span>\nUnlike a logic gate, the CMOS switch has no amplification, so a signal is weakened as it passes through the switch.\nAs will be seen below, inverters can be used to amplify the signal.</p>\n<p>The image below shows how CMOS switches appear under the microscope.\nThis image is very hard to interpret because the two layers of metal on the 386 are packed together densely, but you\ncan see that some wires run horizontally and others run vertically.\nThe bottom layer of metal (called M1) runs vertically in the routing area, as well as providing internal\nwiring for a cell.\nThe top layer of metal (M2) runs horizontally; unlike M1, the M2 wires can cross a cell.\nThe large circles are vias that connect the M1 and M2 layers, while the small circles are connections\nbetween M1 and polysilicon or M1 and silicon.\nThe central third of the image is a column of standard cells with two CMOS switches outlined in green.\nThe cells are bordered by the vertical ground rail and\n+5V rail that power the cells. \nThe routing areas are on either side of the cells, holding the wiring that connects the cells.</p>\n<p><a href=\"https://static.righto.com/images/386-curiosities/switch-metal.jpg\"><img alt=\"Two CMOS switches, highlighted in green. The lower switch is flipped vertically compared to the upper switch.\" class=\"hilite\" height=\"465\" src=\"https://static.righto.com/images/386-curiosities/switch-metal-w400.jpg\" title=\"Two CMOS switches, highlighted in green. The lower switch is flipped vertically compared to the upper switch.\" width=\"400\" /></a><div class=\"cite\">Two CMOS switches, highlighted in green. The lower switch is flipped vertically compared to the upper switch.</div></p>\n<p>Removing the metal layers reveals the underlying silicon with a layer of polysilicon wiring on top.\nThe doped silicon regions show up as dark outlines.\nI've drawn the polysilicon in green; it forms a transistor (brighter green) when it crosses doped silicon.\nThe metal ground and power lines are shown in blue and red, respectively, with other metal wiring in purple.\nThe black dots are vias between layers.\nNote how metal wiring (purple) and polysilicon wiring (green) are combined to route signals within\nthe cell.\nAlthough this standard cell is complicated, the important thing is that it only needs to be designed once.\nThe standard cells for different functions are all designed to have the same width, so the cells can be arranged in\ncolumns, snapped together like Lego bricks.</p>\n<p><a href=\"https://static.righto.com/images/386-curiosities/switch-diagram.jpg\"><img alt=\"A diagram showing the silicon for a standard-cell switch. The polysilicon is shown in green. The bottom metal is shown in blue, red, and purple.\" class=\"hilite\" height=\"289\" src=\"https://static.righto.com/images/386-curiosities/switch-diagram-w400.jpg\" title=\"A diagram showing the silicon for a standard-cell switch. The polysilicon is shown in green. The bottom metal is shown in blue, red, and purple.\" width=\"400\" /></a><div class=\"cite\">A diagram showing the silicon for a standard-cell switch. The polysilicon is shown in green. The bottom metal is shown in blue, red, and purple.</div></p>\n<p>To summarize, this switch circuit allows the input to be connected to the output or disconnected, controlled by the select signal.\nThis switch is more complicated than the earlier schematic because it includes two inverters to amplify\nthe signal.\nThe data input and the two select lines are connected to the polysilicon (green); the cell is designed so\nthese connections can be made on either side.\nAt the top, the input goes through a standard two-transistor inverter.\nThe lower left has two transistors, combining the NMOS half of an inverter with the NMOS half of the switch.\nA similar circuit on the right combines the PMOS part of an inverter and switch.\nHowever, because PMOS transistors are weaker, this part of the circuit is duplicated.</p>\n<p>A multiplexer is constructed by combining multiple switches, one for each input.\nTurning on one switch will select the corresponding input.\nFor instance, a four-to-one multiplexer has four switches, so it can select one of the four inputs.</p>\n<p><a href=\"https://static.righto.com/images/386-curiosities/mux4.jpg\"><img alt=\"A four-way multiplexer constructed from CMOS switches and individual transistors.\" class=\"hilite\" height=\"430\" src=\"https://static.righto.com/images/386-curiosities/mux4-w200.jpg\" title=\"A four-way multiplexer constructed from CMOS switches and individual transistors.\" width=\"200\" /></a><div class=\"cite\">A four-way multiplexer constructed from CMOS switches and individual transistors.</div></p>\n<p>The schematic above shows a hypothetical multiplexer with four inputs.\nOne optimization is that if an input is always 0, the PMOS transistor can be omitted. Likewise,\nif an input is always 1, the NMOS transistor can be omitted.\nOne set of select lines is activated at a time to select the corresponding input.\nThe pink circuit selects 1,\ngreen selects input A, yellow selects input B, and blue selects 0.\nThe multiplexers in the 386 are similar, but have more inputs.</p>\n<p>The diagram below shows how much circuitry is devoted to multiplexers in this block of standard cells.\nThe green, purple, and red cells correspond to the multiplexers driving the three register control\noutputs.\nThe yellow cells are inverters that generate the inverted control signals for the CMOS switches.\nThis diagram also shows how the automatic layout of cells results in a layout that appears random.</p>\n<p><a href=\"https://static.righto.com/images/386-curiosities/muxes.jpg\"><img alt=\"A block of standard-cell logic with multiplexers highlighted. The metal and polysilicon layers were removed for this photo, revealing the silicon transistors.\" class=\"hilite\" height=\"452\" src=\"https://static.righto.com/images/386-curiosities/muxes-w400.jpg\" title=\"A block of standard-cell logic with multiplexers highlighted. The metal and polysilicon layers were removed for this photo, revealing the silicon transistors.\" width=\"400\" /></a><div class=\"cite\">A block of standard-cell logic with multiplexers highlighted. The metal and polysilicon layers were removed for this photo, revealing the silicon transistors.</div></p>\n<h2>The misplaced transistor</h2>\n<p>The idea of standard-cell logic is that standardized cells are arranged in columns.\nThe space between the cells is the \"routing channel\", holding the wiring that links the cells.\nThe 386 circuitry follows this layout, except for one single transistor, sitting between two columns\nof cells.</p>\n<p><a href=\"https://static.righto.com/images/386-curiosities/extra-transistor.jpg\"><img alt=\"The &quot;misplaced&quot; transistor, indicated by the arrow. The irregular green regions are oxide that was incompletely removed.\" class=\"hilite\" height=\"433\" src=\"https://static.righto.com/images/386-curiosities/extra-transistor-w500.jpg\" title=\"The &quot;misplaced&quot; transistor, indicated by the arrow. The irregular green regions are oxide that was incompletely removed.\" width=\"500\" /></a><div class=\"cite\">The \"misplaced\" transistor, indicated by the arrow. The irregular green regions are oxide that was incompletely removed.</div></p>\n<p>I wrote some software tools to help me analyze the standard cells. Unfortunately, my tools\nassumed that all the cells were in columns, so this one wayward transistor caused me considerable inconvenience.</p>\n<p>The transistor turns out to be a PMOS transistor, pulling a signal high as part of a multiplexer.\nBut why is this transistor out of place?\nMy hypothesis is that the transistor is a bug fix.\nRegenerating the cell layout was very costly, taking many hours on an IBM mainframe computer.\nPresumably, someone found that they could just stick the necessary transistor into an unused spot in the\nrouting channel, manually add the necessary wiring, and avoid the delay of regenerating all the cells.</p>\n<h2>The fake inverter</h2>\n<p>The simplest CMOS gate is the inverter, with an NMOS transistor to pull the output low and a\nPMOS transistor to pull the output high.\nThe standard cell circuitry that I examined contains over a hundred inverters of various\nsizes.\n(Performance is improved by using inverters that aren't too small but also aren't\nlarger than necessary for a particular circuit. Thus, the standard cell library includes inverters of multiple sizes.)</p>\n<p>The image below shows a medium-sized standard-cell inverter under the microscope.\nFor this image, I removed the two metal layers with acid to show the underlying polysilicon\n(bright green) and silicon (gray).\nThe quality of this image is\npoor&mdash;it is difficult to remove the metal without destroying the polysilicon&mdash;but the diagram below\nshould clarify the circuit.\nThe inverter has two transistors: a PMOS transistor connected to +5 volts to pull the output high when\nthe input is 0, and an NMOS transistor connected to ground to pull the output low when the input is 1.\n(The PMOS transistor needs to be larger because PMOS transistors don't function as well as NMOS transistors due to\nsilicon physics.)</p>\n<p><a href=\"https://static.righto.com/images/386-curiosities/inverter-diagram.jpg\"><img alt=\"An inverter as seen on the die. The corresponding standard cell is shown below.\" class=\"hilite\" height=\"347\" src=\"https://static.righto.com/images/386-curiosities/inverter-diagram-w450.jpg\" title=\"An inverter as seen on the die. The corresponding standard cell is shown below.\" width=\"450\" /></a><div class=\"cite\">An inverter as seen on the die. The corresponding standard cell is shown below.</div></p>\n<p>The polysilicon input line plays a key role: where it crosses the doped silicon, a transistor gate is\nformed.\nTo make the standard cell more flexible, the input to the inverter\ncan be connected on either the left or the right; in this case, the input\nis connected on the right and there is no connection on the left.\nThe inverter's output can be taken from the polysilicon on the upper left or the right, but in this case, it\nis taken from the upper metal layer (not shown).\nThe power, ground, and output lines are in the lower metal layer, which I have represented by\nthe thin red, blue, and yellow lines. The black circles are connections between the metal layer and\nthe underlying silicon.</p>\n<p>This inverter appears dozens of times in the circuitry.\nHowever, I came across a few inverters that didn't make sense. The problem was\nthat the inverter's output was connected to the output of a multiplexer.\nSince an inverter is either on or off, its value would clobber the output of the multiplexer.<span id=\"fnref:latch\"><a class=\"ref\" href=\"#fn:latch\">4</a></span>\nThis didn't make any sense.\nI double- and triple-checked the wiring to make sure I hadn't messed up.\nAfter more investigation, I found another problem: the input to a \"bad\" inverter didn't make sense\neither. The input consisted of two signals shorted together, which doesn't work.</p>\n<p>Finally, I realized what was going on. A \"bad inverter\" has the exact silicon layout of an inverter,\nbut it wasn't an inverter: it was independent NMOS and PMOS transistors with separate inputs.\nNow it all made sense.\nWith two inputs, the input signals were independent, not shorted together.\nAnd since the transistors were controlled separately, the NMOS transistor could pull the output\nlow in some circumstances, the PMOS transistor could pull the output high in other circumstances,\nor both transistors could be off, allowing the multiplexer's output to be used undisturbed.\nIn other words, the \"inverter\" was just two more cases for the multiplexer.</p>\n<p><a href=\"https://static.righto.com/images/386-curiosities/transistors-die.jpg\"><img alt=\"The &quot;bad&quot; inverter. (Image is flipped vertically for comparison with the previous inverter.)\" class=\"hilite\" height=\"177\" src=\"https://static.righto.com/images/386-curiosities/transistors-die-w450.jpg\" title=\"The &quot;bad&quot; inverter. (Image is flipped vertically for comparison with the previous inverter.)\" width=\"450\" /></a><div class=\"cite\">The \"bad\" inverter. (Image is flipped vertically for comparison with the previous inverter.)</div></p>\n<p>If you compare the \"bad inverter\" cell below with the previous cell, they look <em>almost</em> the same, but\nthere are subtle differences.\nFirst, the gates of the two transistors are connected in the real inverter, but disconnected\nby a small gap in the transistor pair.\nI've indicated this gap in the photo above; it is hard to tell if the gap is real or just an imaging\nartifact, so I didn't spot it.\nThe second difference is that the \"fake\" inverter has two input connections, one to each transistor,\nwhile the inverter has a single input connection.\nUnfortunately, I assumed that the two connections were just a trick to route the signal across\nthe inverter without requiring an extra wire.\nIn total, this cell was used 32 times as a real inverter and 9 times\nas independent transistors.</p>\n<h2>Conclusions</h2>\n<p>Standard cell logic and automatic place and route have a long history before the 386,\nback to the early 1970s, so this isn't an Intel invention.<span id=\"fnref:standard-cell-history\"><a class=\"ref\" href=\"#fn:standard-cell-history\">5</a></span>\nNonetheless, the 386 team deserves the credit for deciding to use this technology at a time when it\nwas a risky decision.\nThey needed to develop custom software for their placing and routing needs, so this wasn't a trivial undertaking.\nThis choice paid off and they completed the 386 ahead of schedule.\nThe 386 ended up being a huge success for Intel, moving the x86 architecture to 32 bits and defining the dominant computer\narchitecture for the rest of the 20th century.</p>\n<p>If you're interested in standard cell logic, I also wrote about <a href=\"https://www.righto.com/2021/03/reverse-engineering-standard-cell-logic.html\">standard cell logic in an IBM chip</a>.\nI plan to write more about the 386, so \nfollow me on\n<a href=\"https://oldbytes.space/@kenshirriff\">Mastodon</a>, <a href=\"https://bsky.app/profile/righto.com\">Bluesky</a>,\nor RSS for updates.\nThanks to Pat Gelsinger and Roxanne Koester for providing helpful papers.</p>\n<p>For more on the 386 and other chips, follow me on\nMastodon (<a href=\"https://oldbytes.space/@kenshirriff\">@kenshirriff@oldbytes.space</a>),\nBluesky (<a href=\"https://bsky.app/profile/righto.com\">@righto.com</a>),\nor <a href=\"http://www.righto.com/feeds/posts/default\">RSS</a>.  (I've given up on Twitter.)\nIf you want to read more about the 386, I've written about the <a href=\"https://www.righto.com/2023/11/intel-386-clock-circuit.html\">clock pin</a>,\n<a href=\"https://www.righto.com/2025/05/386-prefetch-circuitry-reverse-engineered.html\">prefetch queue</a>, <a href=\"https://www.righto.com/2023/10/intel-386-die-versions.html\">die versions</a>, <a href=\"https://www.righto.com/2025/08/intel-386-package-ct-scan.html\">packaging</a>, and <a href=\"https://www.righto.com/2025/08/static-latchup-metastability-386.html\">I/O circuits</a>.</p>\n<h2>Notes and references</h2>\n<div class=\"footnote\">\n<ol>\n<li id=\"fn:oral-history\">\n<p>The decision to use automatic place and route is described on page 13 of the <a href=\"https://archive.computerhistory.org/resources/text/Oral_History/Intel_386_Design_and_Dev/102702019.05.01.acc.pdf#page=13\">Intel 386 Microprocessor Design and Development Oral History Panel</a>, a very interesting document on the 386 with discussion from\nsome of the people involved in its development.&#160;<a class=\"footnote-backref\" href=\"#fnref:oral-history\" title=\"Jump back to footnote 1 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:one-hot\">\n<p>Multiplexers often take a binary control signal to select the desired input.\nFor instance, an 8-to-1 multiplexer selects one of 8 inputs, so a 3-bit control signal\ncan specify the desired input.\nThe 386's multiplexers use a different approach with one control signal per input.\nOne of the 8 control signals is activated to select the desired input.\nThis approach is called a \"one-hot encoding\" since one control line is activated (hot)\nat a time.&#160;<a class=\"footnote-backref\" href=\"#fnref:one-hot\" title=\"Jump back to footnote 2 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:6502\">\n<p>Some chips, such as the MOS Technology 6502 processor, are built with NMOS technology, without PMOS transistors.\nMultiplexers in the 6502 use a single NMOS transistor, rather than the two transistors in the CMOS switch.\nHowever, the performance of the switch is worse.&#160;<a class=\"footnote-backref\" href=\"#fnref:6502\" title=\"Jump back to footnote 3 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:latch\">\n<p>One very common circuit in the 386 is a latch constructed from an inverter loop and a switch/multiplexer.\nThe inverter's output and the switch's output are connected together.\nThe trick, however, is that the inverter is constructed from special weak transistors.\nWhen the switch is disabled, the inverter's weak output is sufficient to drive the loop.\nBut to write a value into the latch, the switch is enabled and its output overpowers the weak\ninverter.</p>\n<p>The point of this is that there <em>are</em> circuits where an inverter and a multiplexer have their\noutputs connected. However, the inverter must be constructed with special weak transistors, which is not the situation\nthat I'm discussing.&#160;<a class=\"footnote-backref\" href=\"#fnref:latch\" title=\"Jump back to footnote 4 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:standard-cell-history\">\n<p>I'll provide more history on standard cells in this footnote.\n RCA <a href=\"https://patents.google.com/patent/US3573488A\">patented</a> a bipolar standard cell in 1971,\n but this was a fixed arrangement of transistors and resistors, more of a gate array than a modern\n standard cell.\n Bell Labs researched standard cell layout techniques in the early 1970s, calling them Polycells, including\n a <a href=\"https://dl.acm.org/doi/10.1145/62882.62886\">1973 paper</a> by Brian Kernighan.\n By 1979, <a href=\"http://www.bitsavers.org/pdf/xerox/parc/techReports/SSL-79-7_A_Guide_to_LSI_Implementation_Second_Edition.pdf\">A Guide to LSI Implementation</a> discussed the standard cell approach and\n it was described as well-known in <a href=\"https://patents.google.com/patent/US4319396A\">this patent application</a>.\n Even so, <a href=\"https://www.worldradiohistory.com/Archive-Electronics/80s/80/Electronics-1980-07-31.pdf#page=77\">Electronics</a> called these design methods \"futuristic\" in 1980.</p>\n<p>Standard cells became popular in the mid-1980s as faster computers and improved design software made\n it practical to produce semi-custom designs that used standard cells.\n Standard cells made it to the cover of <a href=\"http://www.bitsavers.org/magazines/Digital_Design/Digital_Design_V15_N08_198508.pdf\">Digital Design</a> in August 1985, and the article inside described numerous vendors and products.\n Companies like <a href=\"https://www.worldradiohistory.com/Archive-Electronics/80s/83/Electronics-1983-03-10.pdf#page=151\">Zymos</a> and <a href=\"http://www.bitsavers.org/components/vti/tools/1988_VTI_Cell-Based_Design_Users_Guide.pdf\">VLSI Technology</a> (VTI) focused on standard cells.\n Traditional companies such as <a href=\"http://www.bitsavers.org/components/ti/_dataBooks/1986_TI_2-um_CMOS_Standard_Cell_Data_Book.pdf\">Texas Instruments</a>, NCR, GE/RCA, <a href=\"https://www.worldradiohistory.com/Archive-Electronics/80s/87/Electronics-1987-06-25.pdf#page=82\">Fairchild</a>, Harris, <a href=\"https://www.worldradiohistory.com/Archive-ITT/80s/ITT-1983-58-No-4.pdf\">ITT</a>, and Thomson introduced lines of standard cell products in\n the mid-1980s.\n <!-- https://www.worldradiohistory.com/Archive-Electronics/80s/87/Electronics-1987-05-28.pdf -->\n <!--\n The mid-1980s saw enough interest in standard cells that a <a href=\"https://books.google.com/books/about/Gate_Array_and_Standard_Cell_IC_Vendor_D.html?id=0kwsAQAAIAAJ\">vendor guide</a> was published.\n -->&#160;<a class=\"footnote-backref\" href=\"#fnref:standard-cell-history\" title=\"Jump back to footnote 5 in the text\">&#8617;</a></p>\n</li>\n</ol>\n</div>",
  "id": "tag:blogger.com,1999:blog-6264947694886887540.post-3467012800646079318"
}