{
  "title": "A few retrobits updates on Floodgap",
  "link": "https://oldvcr.blogspot.com/2025/04/a-few-retrobits-updates-on-floodgap.html",
  "published": "2025-04-22T14:01:00.000-07:00",
  "summary": "Just a brief programming note. Before this blog there was <a href=\"http://www.floodgap.com/retrobits/\">Floodgap Retrobits</a>, and I still maintain those pages. One of the earliest was my Tomy Tutor-specific page devoted to <a href=\"/2024/03/after-41-years-my-first-assembly.html\">my very first computer</a> which we got in 1983. Relatives of the Texas Instruments home computers and closely patterned after the unreleased TI 99/8, the history of the Japanese models is relatively well-known and there are a number of Japanese enthusiasts that specialize in the Pyuuta, the Tutor's ancestor system. On the other hand, hardly anybody knows anything about the <em>British</em> version. That system is the Grandstand Tutor:\n\n<div class=\"separator\" style=\"clear: both;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjL4TBs8QmA3x1iW830ZQHspSIubDkw3WXgiVacW9RCxAFXS5GIpy-Lfw4aqfkVT7CX-o1o0RPc9yUOJUapy0GmhyphenhyphenUJVpQ7IiqPrauvFdJvxKvdQanbgzNWuc5wAIjV12v0CrAccJd4713_FzOEZBHtB_7SPiTLHZQoL9EWdRKFqkvSPP92kUa3G36O3jU/s2139/grandstand-p1.png\" style=\"display: block; padding: 1em 0; text-align: center;\"><img alt=\"\" border=\"0\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjL4TBs8QmA3x1iW830ZQHspSIubDkw3WXgiVacW9RCxAFXS5GIpy-Lfw4aqfkVT7CX-o1o0RPc9yUOJUapy0GmhyphenhyphenUJVpQ7IiqPrauvFdJvxKvdQanbgzNWuc5wAIjV12v0CrAccJd4713_FzOEZBHtB_7SPiTLHZQoL9EWdRKFqkvSPP92kUa3G36O3jU/s320/grandstand-p1.png\" width=\"320\" /></a></div>\n\nThe only good photographs of this machine, which may never actually have been released to the public, and the only known information on its history appear in <i>Your Computer</i> October 1983, at that time one of the major home computer magazines in the UK. The original form of this machine was very similar to the Pyuuta, which emphasized its TMS9918A-based built-in paint program and due to its specialization on graphics only implements a very simplified animation-oriented dialect of BASIC called GBASIC. Adam Imports rebadged many Asian and some American toys and games for the UK (and, for some period of time, New Zealand) and had a particularly close relationship with Tomy. In fact, the relationship was close enough that Adam in fact <em>rejected</em> this initial version as uncompetitive with other home computers and sent it back to Tomy for a more upgraded BASIC. Tomy provided this by modifying TI Extended BASIC, calling it Tomy BASIC and implementing it as a second mode accessible from the system's menu-based interface. The absence of Tomy BASIC places the earliest Grandstand Tutor prior to the American Tomy Tutor, which also has the upgraded Tomy BASIC. Tomy subsequently sold this upgrade in at least two forms as an option for the Japanese machines as well.\n<p>\nThe interesting part is that while PAL Tutors have been documented to exist (the American Tutor is obviously NTSC), no one yet has reported finding a Grandstand. It wouldn't be hard to distinguish one &mdash; the photograph has obvious Grandstand branding on its silver badge. It's possible they were never released at all because even accounting for publishing delays, the second Grandstand would have emerged late in 1983, hitting in the wake of the video game crash and against heavier hitters like the Commodore VIC-20 and Commodore 64 as well as (in the UK) the ZX Spectrum. Adam may have simply concluded it wasn't a strong enough competitor even with the upgraded BASIC to sell.\n\n<div class=\"separator\" style=\"clear: both;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjBF8hesbSC2cVIZ0zVsr1gZUi0QXg684UQXq7tMKSeA5fsBqvGop7mf13P6lsU7jyUntk4qt5vwgV4x_vM8LTXgBJDASsavlkfZQzQMGrY1AR7rmnWfk656wAsMV_3uOkzxlt9_AHaPnkd3DPwfJbrp2DEQBvCHNXccX82Y0q_xBEnRHVmHvcWO2lO5Bs/s3275/ttucyana.jpg\" style=\"display: block; padding: 1em 0; text-align: center;\"><img alt=\"\" border=\"0\" height=\"320\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjBF8hesbSC2cVIZ0zVsr1gZUi0QXg684UQXq7tMKSeA5fsBqvGop7mf13P6lsU7jyUntk4qt5vwgV4x_vM8LTXgBJDASsavlkfZQzQMGrY1AR7rmnWfk656wAsMV_3uOkzxlt9_AHaPnkd3DPwfJbrp2DEQBvCHNXccX82Y0q_xBEnRHVmHvcWO2lO5Bs/s320/ttucyana.jpg\" /></a></div>\n\nI also finally got off my pasty white tuckus and scanned and OCRed the rest of the Tomy Tutor User Group newsletters in my possession (I also redid #2 and #9 with OCR). The TTUG is a great example, in my humble opinion, of the variety and importance of computer user groups in the early home computer years. Our family got one of these flyers as a registered user; Gene Dinovo, the president of the club, sent out over two thousand of them to everyone on Tomy's mailing list. Just like any user group would have done in those days, the newsletter collected type-in programs, news, tutorials, high score tables, and software and peripherals for sale, including original software written by the user group's own members. Especially for orphaned systems, and there were a lot back then besides the Tutor, the reassurance that \"you are not alone\" went a long way to helping people still make the most out of an expensive purchase that would otherwise have become a gilded doorstop.\n<p>\nFinally, and almost anticlimatically, I've added updates to the Solbourne Solace with various details and corrections submitted by former Solbourne engineer Dworkin M&uuml;ller. Solbourne Computer was a relatively early SPARC licensee and one of Sun's most important competitors in the first few years of the 1990s, possessing an initially formidable lead in the performance sector due to their special multiprocessing sauce. OS/MP, Solbourne's bug-compatible licensed version of SunOS 4, let Solbourne buyers run their SunOS-compatible software out of the box with little or no compromises, <a href=\"/2022/10/if-one-guis-not-enough-for-your-sparc.html\">including SunView</a>. Later their IDT workstations, though uniprocessor, competed directly with and even could squeak by contemporary SPARCstations, at least in the beginning. Solbourne eventually ran out of money when they hit engineering limits with their own CPU and could never reclaim the throughput crown, abandoning the computer hardware market in 1994. We might be adding more remembrances as other Solbourne engineers are contacted.\n<p>\nYou can see these updates at <a href=\"http://www.floodgap.com/retrobits/tomy/\">The Little Orphan Tomy Tutor</a> as well as <a href=\"/search/label/tomy%20tutor\">past Old VCR Tomy articles</a>, and <a href=\"http://www.floodgap.com/retrobits/solace/\">The Solbourne Solace</a> as well as <a href=\"/search/label/solbourne\">past Old VCR Solbourne-specific articles</a>. Naturally, if you have anything to add, feel free to post in the comments or drop me E-mail at ckaiser at floodgap dawt com.",
  "id": "tag:blogger.com,1999:blog-8349470052336612452.post-3750053916882705463"
}