{
  "title": "Inside the Apollo \"8-Ball\" FDAI (Flight Director / Attitude Indicator)",
  "link": "http://www.righto.com/2025/06/inside-apollo-fdai.html",
  "published": "2025-06-13T20:12:00.000-07:00",
  "summary": "<p>During the Apollo flights to the Moon, the astronauts observed the spacecraft's orientation on a special instrument\ncalled the FDAI (Flight Director / Attitude Indicator).\nThis instrument showed the spacecraft's attitude&mdash;its orientation&mdash;by rotating a ball.\nThis ball was nicknamed the \"8-ball\" because it was black (albeit only on one side).\nThe instrument also acted as a flight director, using three yellow needles to indicate how the astronauts should maneuver\nthe spacecraft. Three more pointers showed how fast the spacecraft was rotating.</p>\n<p><a href=\"https://static.righto.com/images/fdai/fdai-opened.jpg\"><img alt=\"An Apollo FDAI (Flight Director/Attitude Indicator) with the case removed. This FDAI is on its side to avoid crushing the needles.\" class=\"hilite\" height=\"511\" src=\"https://static.righto.com/images/fdai/fdai-opened-w500.jpg\" title=\"An Apollo FDAI (Flight Director/Attitude Indicator) with the case removed. This FDAI is on its side to avoid crushing the needles.\" width=\"500\" /></a><div class=\"cite\">An Apollo FDAI (Flight Director/Attitude Indicator) with the case removed. This FDAI is on its side to avoid crushing the needles.</div></p>\n<p>Since the spacecraft rotates along three axes (roll, pitch, and yaw), the ball also rotates along three axes.\nIt's not obvious how the ball can rotate to an arbitrary orientation while remaining attached.\nIn this article, I look inside an FDAI from Apollo that was repurposed for a Space Shuttle simulator<span id=\"fnref:simulator\"><a class=\"ref\" href=\"#fn:simulator\">1</a></span> and explain how it operates. (Spoiler: the ball mechanism is firmly attached\nat the \"equator\" and rotates in two axes. What you see is two hollow shells around the ball mechanism that spin around the third axis.)</p>\n<h2>The FDAI in Apollo</h2>\n<p>For the missions to the Moon, the Lunar Module had two FDAIs, as shown below: one on the left for the Commander (Neil Armstrong in Apollo 11) and\none on the right for the Lunar Module Pilot (Buzz Aldrin in Apollo 11).\nWith their size and central positions, the FDAIs dominate the instrument panel, a sign of their importance.\n(The Command Module for Apollo also had two FDAIs, but with a different design; I won't discuss them here.<span id=\"fnref:honeywell\"><a class=\"ref\" href=\"#fn:honeywell\">2</a></span>)</p>\n<p><a href=\"https://static.righto.com/images/fdai/lm-panel.jpg\"><img alt=\"The instrument panel in the Lunar Module. From Apollo 15 Lunar Module, NASA, S71-40761. If you're looking for the DSKY, it is in the bottom center, just out of the picture.\" class=\"hilite\" height=\"500\" src=\"https://static.righto.com/images/fdai/lm-panel-w600.jpg\" title=\"The instrument panel in the Lunar Module. From Apollo 15 Lunar Module, NASA, S71-40761. If you're looking for the DSKY, it is in the bottom center, just out of the picture.\" width=\"600\" /></a><div class=\"cite\">The instrument panel in the Lunar Module. From <a href=\"https://archive.org/details/S71-40761\">Apollo 15 Lunar Module</a>, NASA, S71-40761. If you're looking for the DSKY, it is in the bottom center, just out of the picture.</div></p>\n<p>Each Lunar Module FDAI could display inputs from multiple sources, selected by switches on the panel.<span id=\"fnref:lm-fdai\"><a class=\"ref\" href=\"#fn:lm-fdai\">3</a></span> The ball could display attitude from either the\nInertial Measurement Unit\nor from the backup Abort Guidance System, selected by the \"ATTITUDE MON\" toggle switch next to either FDAI.\nThe pitch attitude could also be supplied by an electromechanical unit called ORDEAL (Orbital Rate Display Earth And Lunar)\nthat simulates a circular orbit.\nThe error indications came from the Apollo Guidance Computer, the Abort Guidance System, the landing radar,\nor the rendezvous radar (controlled by the \"RATE/ERROR MON\" switches).\nThe pitch, roll, and yaw rate displays were driven by the Rate Gyro Assembly (RGA).\nThe rate indications were scaled by a switch below the FDAI, selecting 25&deg;/sec or 5&deg;/sec.</p>\n<h2>The FDAI mechanism</h2>\n<p>The ball inside the indicator shows rotation around three axes.\nI'll first explain these axes in the context of an aircraft, since the axes of a spacecraft are more arbitrary.<span id=\"fnref:axes\"><a class=\"ref\" href=\"#fn:axes\">4</a></span>\nThe roll axis indicates the aircraft's angle if it rolls side-to-side along its axis of flight, raising one wing\nand lowering the other.\nThus, the indicator shows the tilt of the horizon as the aircraft rolls.\nThe pitch axis indicates the aircraft's angle if it pitches up or down, with the indicator showing the horizon\nmoving down or up in response.\nFinally, the yaw axis indicates the compass direction that the aircraft is heading,\nchanging as the aircraft turns left or right.\n(A typical aircraft attitude indicator omits yaw.)</p>\n<p>I'll illustrate how the FDAI rotates the ball in three axes, using an orange as an example.\nImagine pinching the horizontal axis between two fingers with your arm extended.\nRotating your arm will roll the ball counter-clockwise or clockwise (red arrow).\nIn the FDAI, this rotation is accomplished by a motor turning the frame that holds the ball.\nFor pitch, the ball rotates forward or backward around the horizontal axis (yellow arrow).\nThe FDAI has a motor inside the ball to produce this rotation.\nYaw is a bit more difficult to envision: imagine hemisphere-shaped shells attached to the top and bottom shafts.\nWhen a motor rotates these shells (green arrow), the hemispheres will rotate, even though\nthe ball mechanism (the orange) remains stationary.</p>\n<p><a href=\"https://static.righto.com/images/fdai/orange.jpg\"><img alt=\"A sphere, showing the three axes.\" class=\"hilite\" height=\"334\" src=\"https://static.righto.com/images/fdai/orange-w400.jpg\" title=\"A sphere, showing the three axes.\" width=\"400\" /></a><div class=\"cite\">A sphere, showing the three axes.</div></p>\n<p>The diagram below shows the mechanism inside the FDAI.\nThe indicator uses three motors to move the ball.\nThe roll motor is attached to the FDAI's frame, while the pitch and yaw motors are inside the ball.\nThe roll motor rotates the roll gimbal through gears, causing the ball to rotate clockwise or counterclockwise.\nThe roll gimbal is attached to the ball mechanism at two points along the \"equator\";\nthese two points define the pitch axis.\nNumerous wires on the roll gimbal enter the ball along the pitch axis.\nThe roll control transformer provides position feedback, as will be explained below.</p>\n<p><a href=\"https://static.righto.com/images/fdai/fdai-internals-labeled.jpg\"><img alt=\"The main components inside the FDAI.\" class=\"hilite\" height=\"399\" src=\"https://static.righto.com/images/fdai/fdai-internals-labeled-w700.jpg\" title=\"The main components inside the FDAI.\" width=\"700\" /></a><div class=\"cite\">The main components inside the FDAI.</div></p>\n<p>Removing the hemispherical shells reveals the \nmechanism inside the ball.\nWhen the roll gimbal is rotated, this mechanism rotates with it.\nThe pitch motor causes the ball mechanism to rotate around the pitch axis.\nThe yaw motor and control transformer are not visible in this photo; they are behind the pitch components, oriented\nperpendicularly.\nThe yaw motor turns the vertical shaft, with\nthe two hemisphere shells attached to the top and bottom of the shaft.\nThus, the yaw motor rotates the ball shells around the yaw axis, while the mechanism itself\nremains stationary.\nThe control transformers for pitch and yaw provide position feedback.</p>\n<p><a href=\"https://static.righto.com/images/fdai/ball-labeled.jpg\"><img alt=\"The components inside the ball of the FDAI.\" class=\"hilite\" height=\"479\" src=\"https://static.righto.com/images/fdai/ball-labeled-w550.jpg\" title=\"The components inside the ball of the FDAI.\" width=\"550\" /></a><div class=\"cite\">The components inside the ball of the FDAI.</div></p>\n<p>Why doesn't the wiring get tangled up as the ball rotates?\nThe solution is two sets of slip rings to implement the electrical connections.\nThe photo below shows the first slip ring assembly, which handles rotation around the roll axis.\nThese slip rings connect the stationary part of the FDAI to the\nrotating roll gimbal.\nThe vertical metal brushes are stationary; there are 23 pairs of brushes, one for each connection to the ball mechanism.\nEach pair of brushes contacts one metal ring on the striped shaft, maintaining contact as the shaft rotates.\nInside the shaft, 23 wires connect the circular metal contacts to the roll gimbal.</p>\n<p><a href=\"https://static.righto.com/images/fdai/sliprings.jpg\"><img alt=\"The slip ring assembly in the FDAI.\" class=\"hilite\" height=\"447\" src=\"https://static.righto.com/images/fdai/sliprings-w450.jpg\" title=\"The slip ring assembly in the FDAI.\" width=\"450\" /></a><div class=\"cite\">The slip ring assembly in the FDAI.</div></p>\n<p>A second set of slip rings inside the ball handles rotation around the pitch axis.\nThese rings provide the electrical connection between the\nwiring on the roll gimbal and the ball mechanism.\nThe yaw axis does not use slip rings since only the hemisphere shells rotate around the yaw axis;\nno wires are involved.</p>\n<h2>Synchros and the servo loop</h2>\n<p>In this section, I'll explain how the FDAI is controlled by synchros and servo loops.\nIn the 1950s and 1960s, the standard technique for transmitting a rotational signal electrically was through a synchro.\nSynchros were used for everything from rotating an instrument indicator in avionics to rotating the gun on a navy battleship.\nA synchro produces an output that depends on the shaft's rotational position, and transmits this output signal\non three wires.\nIf you connect these wires to a second synchro, you can use the first synchro to control the second one:\nthe shaft of the second synchro will rotate to the same angle as\nthe first shaft.\nThus, synchros are a convenient way to send a control signal electrically.</p>\n<p>The photo below shows a typical synchro, with the input shaft on the top and five wires\nat the bottom: two for power and three for the output.</p>\n<p><a href=\"https://static.righto.com/images/fdai/synchro.jpg\"><img alt=\"A synchro transmitter.\" class=\"hilite\" height=\"324\" src=\"https://static.righto.com/images/fdai/synchro-w200.jpg\" title=\"A synchro transmitter.\" width=\"200\" /></a><div class=\"cite\">A synchro transmitter.</div></p>\n<p>Internally, the synchro has a rotating winding called the rotor that is driven with 400 Hz AC.\nThree fixed stator windings provide the three AC output signals. As the shaft rotates, the voltages of the\noutput signals change, indicating the angle.\n(A synchro resembles a transformer with three variable secondary windings.)\nIf two connected synchros have different angles, the magnetic fields create a torque that rotates the shafts into alignment.</p>\n<p><a href=\"https://static.righto.com/images/fdai/synchro-schematic.png\"><img alt=\"The schematic symbol for a synchro transmitter or receiver.\" class=\"hilite\" height=\"192\" src=\"https://static.righto.com/images/fdai/synchro-schematic-w200.png\" title=\"The schematic symbol for a synchro transmitter or receiver.\" width=\"200\" /></a><div class=\"cite\">The schematic symbol for a synchro transmitter or receiver.</div></p>\n<p>The downside of synchros is that they don't produce a lot of torque.\nThe solution is to use a more powerful motor, controlled by the synchro and a feedback loop called a servo loop.\nThe servo loop drives the motor in the appropriate direction to eliminate the error between the desired position and the\ncurrent position.</p>\n<p>The diagram below shows how the servo loop is constructed from a combination of electronics and mechanical components.\nThe goal is to rotate the output shaft to an angle that exactly matches the input angle,\nspecified by the three synchro wires.\nThe control transformer compares the input angle and the output shaft position, producing an error signal.\nThe amplifier uses this error signal to drive the motor in the appropriate direction until the error signal drops to zero.\nTo improve the dynamic response of the servo loop, the tachometer signal is used as a negative feedback voltage.\nThe feedback slows the motor as the system gets closer to the right position, so the motor doesn't overshoot the position and oscillate.\n(This is sort of like a PID controller.)</p>\n<p><a href=\"https://static.righto.com/images/fdai/servo-diagram.jpg\"><img alt=\"This diagram shows the structure of the servo loop, with a feedback loop ensuring that the rotation angle of the output shaft matches the input angle.\" class=\"hilite\" height=\"228\" src=\"https://static.righto.com/images/fdai/servo-diagram-w600.jpg\" title=\"This diagram shows the structure of the servo loop, with a feedback loop ensuring that the rotation angle of the output shaft matches the input angle.\" width=\"600\" /></a><div class=\"cite\">This diagram shows the structure of the servo loop, with a feedback loop ensuring that the rotation angle of the output shaft matches the input angle.</div></p>\n<p>A control transformer\nis similar to a synchro in appearance and construction, but the rotating shaft operates as an input, not the output.\nIn a control transformer, the three stator windings receive the inputs and the rotor winding provides the error output.\nIf the rotor angle of the synchro transmitter and control transformer are the same, the signals cancel out and there is\nno error voltage.\nBut as the difference between the two shaft angles increases, the rotor winding produces an error signal. The phase of the\nerror signal indicates the direction of the error.</p>\n<p>In the FDAI, the motor is a special <a href=\"https://www.righto.com/2024/02/bendix-cadc-servomotor-tachometer.html\">motor/tachometer</a>, a device that was often used in avionics servo loops.\nThis motor is more complicated than a regular electric motor.\nThe motor is powered by 115 volts AC at 400 hertz, but this won't spin the motor on its own.\nThe motor also has two low-voltage control windings. Energizing the control windings with the proper phase causes the\nmotor to spin in one direction or the other.\nThe motor/tachometer unit also contains a tachometer to measure its speed for the feedback loop.\nThe tachometer is driven by another 115-volt AC winding and generates a low-voltage AC signal that is proportional\nto the motor's rotational speed.</p>\n<p><a href=\"https://static.righto.com/images/fdai/motor-disassembled.jpg\"><img alt=\"A motor/tachometer similar (but not identical) to the one in the FDAI.\" class=\"hilite\" height=\"262\" src=\"https://static.righto.com/images/fdai/motor-disassembled-w500.jpg\" title=\"A motor/tachometer similar (but not identical) to the one in the FDAI.\" width=\"500\" /></a><div class=\"cite\">A motor/tachometer similar (but not identical) to the one in the FDAI.</div></p>\n<p>The photo above shows a motor/tachometer with the rotor removed.\nThe unit has many wires because of its multiple windings.\nThe rotor has two drums. The drum on the left, with the spiral stripes, is for the motor. This drum is a \"squirrel-cage rotor\",\nwhich spins due to induced currents.\n(There are no electrical connections to the rotor; the drums interact with the windings through magnetic fields.)\nThe drum on the right is the tachometer rotor; it induces a signal in the output winding proportional to the speed due to eddy currents.\nThe tachometer signal is at 400 Hz like the driving signal, either in phase or 180º out of phase, depending on the direction\nof rotation.\nFor more information on how a motor/tachometer works, see my <a href=\"https://www.righto.com/2024/02/bendix-cadc-servomotor-tachometer.html\">teardown</a>.</p>\n<h2>The amplifiers</h2>\n<p>The FDAI has three servo loops&mdash;one for each axis&mdash;and each servo loop has a separate control transformer, motor, and amplifier.\nThe photo below shows one of the three amplifier boards. The construction is unusual and somewhat chaotic,\nwith some components stacked on top of others to save space.\nSome of the component leads are long and protected with clear plastic sleeves.<span id=\"fnref:pcb\"><a class=\"ref\" href=\"#fn:pcb\">5</a></span>\nThe cylindrical pulse transformer in the middle has five colorful wires coming out of it.\nAt the left are the two transistors that drive the motor's control windings, with two capacitors between them.\nThe transistors are mounted on a heat sink that is screwed down to the case of the amplifier assembly for cooling.\nEach amplifier is connected to the FDAI through seven wires with pins that\nplug into the sockets on the right of the board.<span id=\"fnref:jumpers\"><a class=\"ref\" href=\"#fn:jumpers\">6</a></span></p>\n<p><a href=\"https://static.righto.com/images/fdai/amplifier-board.jpg\"><img alt=\"One of the three amplifier boards. At the right front of the board, you can see a capacitor stacked on top of a resistor. The board is shiny because it is covered with conformal coating.\" class=\"hilite\" height=\"351\" src=\"https://static.righto.com/images/fdai/amplifier-board-w600.jpg\" title=\"One of the three amplifier boards. At the right front of the board, you can see a capacitor stacked on top of a resistor. The board is shiny because it is covered with conformal coating.\" width=\"600\" /></a><div class=\"cite\">One of the three amplifier boards. At the right front of the board, you can see a capacitor stacked on top of a resistor. The board is shiny because it is covered with conformal coating.</div></p>\n<p>The function of the board is to amplify the error signal so the motor rotates in the appropriate direction.\nThe amplifier also uses the tachometer output from the motor unit to slow the motor as the error signal decreases, preventing\novershoot.\nThe inputs to the amplifier are 400 hertz AC signals, with the magnitude indicating the amount of error or speed and the\nphase indicating the direction.\nThe two outputs from the amplifier drive the two control windings of the motor, determining which direction the motor rotates.</p>\n<p>The schematic for the amplifier board is below. <span id=\"fnref:zener\"><a class=\"ref\" href=\"#fn:zener\">7</a></span>\nThe two transistors on the left amplify the error and tachometer signals, driving the pulse transformer.\nThe outputs of the pulse transformer will have opposite phases, driving the output transistors for opposite halves of\nthe 400 Hz cycle.\nThis activates the motor control winding, causing the motor to spin in the desired direction.<span id=\"fnref:control\"><a class=\"ref\" href=\"#fn:control\">8</a></span></p>\n<p><a href=\"https://static.righto.com/images/fdai/amplifier-schematic.jpg\"><img alt=\"The schematic of an amplifier board.\" class=\"hilite\" height=\"262\" src=\"https://static.righto.com/images/fdai/amplifier-schematic-w500.jpg\" title=\"The schematic of an amplifier board.\" width=\"500\" /></a><div class=\"cite\">The schematic of an amplifier board.</div></p>\n<h2>History of the FDAI</h2>\n<p>Bill Lear, born in 1902, was a prolific inventor with over 150 patents,\ncreating everything from the 8-track tape to the Learjet, the iconic\nprivate plane of the 1960s.\nHe created multiple companies in the 1920s as well as inventing one of the first car radios for Motorola before starting Lear Avionics,\na company that specialized in aerospace instruments.<span id=\"fnref:lear\"><a class=\"ref\" href=\"#fn:lear\">9</a></span>\nLear produced innovative aircraft instruments and flight control systems such as\nthe <a href=\"https://archive.org/details/sim_flight-operations_1951-01_35_1/page/38/\">F-5 automatic pilot</a>, which received a trophy as the \"greatest aviation achievement in America\" for 1950.</p>\n<p>Bill Lear went on to solve an indicator problem for the Air Force:\nthe supersonic F-102 Delta Dagger interceptor (1953) could climb at steep angles, but existing\nattitude indicators could not handle nearly vertical flight. \nLear developed a remote two-gyro platform that drove the cockpit indicator while avoiding \"gimbal lock\" during vertical\nflight.\nFor the experimental X-15 rocket-powered aircraft (1959), Lear improved this indicator to handle three axes:\nroll, pitch, and yaw.</p>\n<p>Meanwhile, the Siegler Corporation started in 1950 to manufacture space heaters for homes. A few years later, Siegler was acquired\nby John Brooks, an entrepreneur who was enthusiastic about acquisitions. In 1961, Lear Avionics became his latest acquisition, and\nthe merged company was called Lear Siegler Incorporated, often known as LSI.\n(Older programmers may know Lear Siegler through the <a href=\"https://en.wikipedia.org/wiki/ADM-3A\">ADM-3A</a>, an inexpensive video display terminal from 1976 that \nhoused the display and keyboard in a stylish white case.)</p>\n<p>The X-15's attitude indicator became the basis of the indicator for the F-4 fighter plane\n(the <a href=\"https://www.righto.com/2024/09/f4-attitude-indicator.html\">ARU/11-A</a>).\nThen, after \"<a href=\"https://ntrs.nasa.gov/api/citations/19680016105/downloads/19680016105.pdf#page=120\">a minimum of modification</a>\",\nthe attitude-director indicator was used in the Gemini space program.\nIn total, Lear Siegler provided 11 instruments in the Gemini instrument panel, with the attitude director the most important.\nNext, Gemini's indicator was modified to become the FDAI (flight director-attitude indicator) in the Lunar Module for Apollo.<span id=\"fnref:parts\"><a class=\"ref\" href=\"#fn:parts\">10</a></span>\nLear Siegler provided numerous components for the Apollo program, from a directional gyro for the Lunar Rover\nto the electroluminescent display for the Apollo Guidance Computer's Display/Keyboard (DSKY).</p>\n<p><a href=\"https://static.righto.com/images/fdai/lsi-instruments.jpg\"><img alt=\"An article titled &quot;LSI Instruments Aid in Moon Landing&quot; from LSI's internal LSI Log publication, July 1969. (Click for a larger version.)\" class=\"hilite\" height=\"385\" src=\"https://static.righto.com/images/fdai/lsi-instruments-w600.jpg\" title=\"An article titled &quot;LSI Instruments Aid in Moon Landing&quot; from LSI's internal LSI Log publication, July 1969. (Click for a larger version.)\" width=\"600\" /></a><div class=\"cite\">An article titled \"LSI Instruments Aid in Moon Landing\" from LSI's internal LSI Log publication, July 1969. (Click for a larger version.)</div></p>\n<p>In 1974, Lear Siegler obtained a contract to develop the Attitude-Director Indicator (ADI) for the Space Shuttle, producing\na dozen ADI units for the Space Shuttle.\nHowever, by this time, Lear Siegler was losing enthusiasm for low-volume space avionics.\nThe Instrument Division president said that \"the business that we were in was an engineering business and engineers\nlove a challenge.\"\nHowever, manufacturing refused to deal with the special procedures required for space manufacturing,\nso the Shuttle units were built by the engineering department.\nLear Siegler didn't bid on later Space Shuttle avionics and the Shuttle ADI became its last space product.\nIn the early 2000s, the Space Shuttle's instruments were upgraded to a \"glass cockpit\" with 11 flat-panel displays known\nas the Multi-function Electronic Display System (MEDS).\nThe MEDS was produced by Lear Siegler's long-term competitor, Honeywell.</p>\n<p>Getting back to Bill Lear, he wanted to manufacture aircraft, not just aircraft instruments, so\nhe created the Learjet, the first mass-produced business jet.\nThe first Learjet flew in 1963, with over 3000 eventually delivered.\nIn the early 1970s, Lear designed a steam turbine automobile engine. Rather than water, the turbine\nused a secret fluorinated hydrocarbon called \"Learium\". Lear had visions of thousands of low-pollution \"<a href=\"https://www.nytimes.com/1971/04/04/archives/bill-lear-thinks-hell-have-the-last-laugh.html\">Learmobiles</a>\", but the engine failed\nto catch on. \nLear had been on the verge of bankruptcy in the 1960s; one of his VPs explained that\n\"the great creative minds can't be bothered with withholding taxes and investment credits and all this crap\".\nBut by the time of his death in 1978, Lear had a fortune estimated at $75 million.</p>\n<h2>Comparing the ARU/11-A and the FDAI</h2>\n<p>Looking inside our FDAI sheds more details on the evolution of Lear Siegler's attitude directors.\nThe photo below compares the Apollo FDAI (top) to the earlier ARU/11-A used in the F-4 aircraft (bottom).\nWhile the basic mechanism and the electronic amplifiers are the same between the two indicators, there are\nalso substantial changes.</p>\n<p><a href=\"https://static.righto.com/images/fdai/aru-vs-fdai.jpg\"><img alt=\"Comparison of an FDAI (top) with an ARU-11/A (bottom). The amplifier boards and needles have been removed from the FDAI.\" class=\"hilite\" height=\"482\" src=\"https://static.righto.com/images/fdai/aru-vs-fdai-w600.jpg\" title=\"Comparison of an FDAI (top) with an ARU-11/A (bottom). The amplifier boards and needles have been removed from the FDAI.\" width=\"600\" /></a><div class=\"cite\">Comparison of an FDAI (top) with an ARU-11/A (bottom). The amplifier boards and needles have been removed from the FDAI.</div></p>\n<p>The biggest difference between the ARU-11/A indicator and the FDAI is that the electronics for the ARU-11/A \nare in a separate module that was plugged into the back of the indicator, while the FDAI includes the electronics\ninternally, with boards mounted on the instrument frame.\nSpecifically, the ARU-11/A has a separate unit containing a multi-winding transformer, a power supply board,\nand three amplifier boards (one for each axis), while the FDAI contains these components internally.\nThe amplifier boards in the ARU-11/A and the FDAI are identical, constructed from germanium transistors rather than\nsilicon.<span id=\"fnref:amplifiers\"><a class=\"ref\" href=\"#fn:amplifiers\">11</a></span>\nThe unusual 11-pin transformers are also the same.\nHowever, the power supply boards are different, probably because the boards also contain scaling resistors\nthat vary between the units.<span id=\"fnref:resistors\"><a class=\"ref\" href=\"#fn:resistors\">12</a></span>\nThe power supply boards are also different shapes to fit the available space.</p>\n<p>The ball assemblies of the ARU/11-A and the FDAI are almost the same, with the same motor assemblies and slip ring\nmechanism. \nThe gearing has minor changes. In particular, the FDAI has two plastic gears, while the ARU/11-A uses\nexclusively metal gears.</p>\n<p>The ARU/11-A has a <a href=\"https://patents.google.com/patent/US2941305A\">patented</a> pitch trim feature that was\nmostly&mdash;but not entirely&mdash;removed from the Apollo FDAI.\nThe motivation for this feature is that an aircraft in level flight will be pitched up a few degrees, the \"angle of attack\".\nIt is desirable for the attitude indicator to show the aircraft as horizontal, so a pitch trim knob allows the\nangle of attack to be canceled out on the display.\nThe problem is that if you fly your fighter plane vertically, you want the indicator to show precisely\nvertical flight, rather than applying the pitch trim adjustment.\nThe solution in the ARU-11/A is a special 8-zone potentiometer on the pitch axis that will apply the pitch trim\nadjustment in level flight but not in vertical flight, while providing a smooth transition between the regions.\nThis special potentiometer is mounted inside the ball of the ARU-11/A.\nHowever, this pitch trim adjustment is meaningless for a spacecraft, so it is not implemented in the Apollo\nor Space Shuttle instruments.\nSurprisingly, the shell of the potentiometer still exists in our FDAI, but without the potentiometer itself or the\nwiring.\nPerhaps it remained to preserve the balance of the ball.\nIn the photo below, the cylindrical potentiometer shell is indicated by an arrow. Note the holes in the front\nof the shell; in the ARU-11/A, the potentiometer's wiring terminals protrude through these holes, but in the \nFDAI, the holes are covered with tape.</p>\n<p><a href=\"https://static.righto.com/images/fdai/potentiometer.jpg\"><img alt=\"Inside the ball of the FDAI. The potentiometer shell is indicated with an arrow.\" class=\"hilite\" height=\"354\" src=\"https://static.righto.com/images/fdai/potentiometer-w400.jpg\" title=\"Inside the ball of the FDAI. The potentiometer shell is indicated with an arrow.\" width=\"400\" /></a><div class=\"cite\">Inside the ball of the FDAI. The potentiometer shell is indicated with an arrow.</div></p>\n<p>Finally, the mounting of the ball hemispheres is slightly different.\nThe ARU/11-A uses four screws at the pole of each hemisphere.\nOur FDAI, however, uses a single screw at each pole; the screw is tightened with a Bristol Key, causing the\nshaft to expand and hold the hemisphere in place.</p>\n<p>To summarize, the Apollo FDAI occupies a middle ground: while it isn't simply a repurposed ARU-11/A, neither is\nit a complete redesign.\nInstead, it preserves the old design where possible, while stripping out undesired features such as pitch trim.\nThe separate amplifier and mechanical units of the ARU/11-A were combined to form the larger FDAI.</p>\n<h2>Differences from Apollo</h2>\n<p>The FDAI that we examined is a special unit:\nit was originally built for Apollo but was repurposed for a Space Shuttle simulator.\nOur FDAI is labeled Model 4068F, which is a Lunar Module part number.\nMoreover, the FDAI is internally stamped with the date \"Apr. 22 1968\", over a year before the first Moon landing.</p>\n<p>However, a closer look shows that several key components were modified to make the Apollo FDAI work in the Shuttle Simulator.<span id=\"fnref:systems-handbook\"><a class=\"ref\" href=\"#fn:systems-handbook\">14</a></span>\nThe Apollo FDAI (and the Shuttle ADI) used resolvers as inputs to control the ball, while our FDAI uses synchros.\n(Resolvers and synchros are similar, except resolvers use sine and cosine inputs, 90&deg; apart, on two wire pairs, while\nsynchros use three inputs, 120&deg; apart, on three wires.)\nNASA must have replaced the three resolver control transformers in the FDAI with synchro control transformers for use\nin the simulator.</p>\n<p>The Apollo FDAI used electroluminescent lighting for the display, while ours uses eight small incandescent bulbs.\nThe metal case of our FDAI has a Dymo <a href=\"https://en.wikipedia.org/wiki/Embossing_tape\">embossed tape</a> label \"INCANDESCENT\nLIGHTING\", alerting users to the change from Apollo's illumination.\nOur FDAI also contains a step-down transformer to convert the 115 VAC input into 5 VAC to power the bulbs,\nwhile the Shuttle powered its ADI illumination directly from <a href=\"https://airandspace.si.edu/collection-media/NASM-49BE0A798E632_006\">5 volts</a>.</p>\n<p>The dial of our FDAI was repainted to match the dial of the Shuttle FDAI.\nThe Apollo FDAI had red bands on the left and right of the dial.\nA close examination of our dial shows that black paint was carefully applied over the red paint, but a few specks of\nred paint are still visible (below).\nMoreover, the edges of the lines and the lozenge show slight unevenness from the repainting.\nSecond, the Apollo FDAI had the text \"ROLL RATE\", \"PITCH RATE\", and \"YAW RATE\" in white next to the needle scales.\nIn our FDAI, this text has been hidden by black paint to match the Shuttle display.<span id=\"fnref:panel\"><a class=\"ref\" href=\"#fn:panel\">13</a></span>\nThird, the Apollo LM FDAI had a crosshair in the center of the instrument, while our FDAI has a white U-shaped \nindicator, the same as the Shuttle (and the Command Module's FDAI).\nFinally, the ball of the Apollo FDAI has red circular regions at the poles to warn of orientations that can cause\ngimbal lock. Our FDAI (like the Shuttle) does not have these circles. We couldn't see any evidence that these\nregions were repainted, so we suspect that our FDAI has Shuttle hemispheres on the ball.</p>\n<p><a href=\"https://static.righto.com/images/fdai/repaint.jpg\"><img alt=\"A closeup of the dial on our FDAI shows specks of red paint around the dial markings. The color is probably Switzer DayGlo Rocket Red.\" class=\"hilite\" height=\"279\" src=\"https://static.righto.com/images/fdai/repaint-w400.jpg\" title=\"A closeup of the dial on our FDAI shows specks of red paint around the dial markings. The color is probably Switzer DayGlo Rocket Red.\" width=\"400\" /></a><div class=\"cite\">A closeup of the dial on our FDAI shows specks of red paint around the dial markings. The color is probably Switzer DayGlo Rocket Red.</div></p>\n<p>Our FDAI has also been modified electrically. \nSmall green connectors (Micro-D MDB1) have been added between the slip rings and the motors, as well as on the gimbal arm.\nWe think these connectors were added post-Apollo, since they are attached somewhat sloppily with glue and don't\nlook flight-worthy.\nPerhaps these connectors were added to make disassembly and modification easier.\nMoreover, our FDAI has an elapsed time indicator, also mounted with glue.</p>\n<p>The back of our FDAI is completely different from Apollo.\nFirst, the connector's pinout is completely different.\nSecond, each of the six indicator needles has a mechanical adjustment as well as a trimpot (<a href=\"https://space1.com/Artifacts/Artifacts_FOR_SALE/FS__Shuttle_Sim_Avionics/FS__Shuttle_Sim_ADI/fs__shuttle_sim_adi.html\">details</a>).\nFinally, each of the three axes has an adjustment potentiometer.</p>\n<h2>The Shuttle's ADI (Attitude Director Indicator)</h2>\n<p>Each Space Shuttle had three ADIs (Attitude Director Indicators), which were very similar to the Apollo FDAI, despite\nthe name change.\nThe photo below shows the two octagonal ADIs in the forward flight deck, one on the left in front of the Commander,\nand one on the right in front of the Pilot.\nThe <a href=\"https://catalog.archives.gov/id/22919771\">aft flight deck station</a> had a third ADI.<span id=\"fnref:MEDS\"><a class=\"ref\" href=\"#fn:MEDS\">15</a></span></p>\n<p><a href=\"https://static.righto.com/images/fdai/shuttle-flight-deck.jpg\"><img alt=\"This photo shows Discovery's forward flight deck on STS-063 (1999). The ADIs are indicated with arrows. The photo is from the National Archives.\" class=\"hilite\" height=\"385\" src=\"https://static.righto.com/images/fdai/shuttle-flight-deck-w600.jpg\" title=\"This photo shows Discovery's forward flight deck on STS-063 (1999). The ADIs are indicated with arrows. The photo is from the National Archives.\" width=\"600\" /></a><div class=\"cite\">This photo shows Discovery's forward flight deck on STS-063 (1999). The ADIs are indicated with arrows. The photo is from the <a href=\"https://catalog.archives.gov/id/23894173\">National Archives</a>.</div></p>\n<p>Our FDAI appears to have been significantly modified for use in the Shuttle simulator, as described above.\nHowever, it is much closer to the Apollo FDAI than the ADI used in the Shuttle, as I'll show in this section.\nMy hypothesis is that the simulator was built before the Shuttle's ADI was created, so the Apollo FDAI was pressed\ninto service.</p>\n<p>The Shuttle's ADI was much more complicated electrically than the Apollo FDAI and our FDAI, providing improved\nfunctionality.<span id=\"fnref:shuttle-adi\"><a class=\"ref\" href=\"#fn:shuttle-adi\">16</a></span>\nFor instance, while the Apollo FDAI had a simple \"OFF\" indicator flag to show that the indicator had lost power,\nthe Shuttle's ADI had extensive error detection. \nIt contained voltage level monitors to check its five power supplies. (The Shuttle ADI used three DC power sources\nand two AC power sources, compared to the single AC supply for Apollo.)\nThe Shuttle's ADI also monitored the ball servos to detect position errors. Finally, it received an external \"Data OK\" signal.\nIf a fault was detected by any of these monitors, the \"OFF\" flag was deployed to indicate that the ADI could not\nbe trusted.</p>\n<p>The Shuttle's ADI had six needles, the same as Apollo, but the Shuttle used feedback to make the positions more accurate.\nSpecifically, each Shuttle needle had a feedback sensor, a Linear Variable Differential Transformer (LVDT) that generates\na voltage based on the needle position.\nThe LVDT output drove a servo feedback loop to ensure that the needle was in the exact desired position.\nIn the Apollo FDAI, on the other hand, the needle input voltage drove a galvanometer, swinging the needle proportionally,\nbut there was no closed loop to ensure accuracy.</p>\n<p>I assume that the Shuttle's ADI had integrated circuit electronics to implement this new functionality, considerably\nmore modern than the germanium transistors in the Apollo FDAI.\nThe Shuttle probably used the same mechanical structures to rotate the ball, but I can't confirm that.</p>\n<h2>Conclusions</h2>\n<p>The FDAI was a critical instrument in Apollo, indicating the orientation of the spacecraft in three axes.\nIt wasn't obvious to me how the \"8-ball\" can rotate in three axes while still being securely connected to the\ninstrument.\nThe trick is that most of the mechanism rotates in two axes, while hollow hemispherical shells provide the\nthird rotational axis.</p>\n<p>The FDAI has an interesting evolutionary history, from the experimental X-15 rocket plane and the F-4 fighter to\nthe Gemini, Apollo, and Space Shuttle flights.\nOur FDAI has an unusual position in this history: since it was modified from Apollo to function in a Space Shuttle\nsimulator, it shows aspects of both Apollo and the Space Shuttle indicators.\nIt would be interesting to compare the design of a Shuttle ADI to the Apollo FDAI, but I haven't been able to find\ninterior photos of a Shuttle ADI (or of an unmodified Apollo FDAI).<span id=\"fnref:photos\"><a class=\"ref\" href=\"#fn:photos\">17</a></span></p>\n<p>You can see a brief video of the FDAI in motion <a href=\"https://bsky.app/profile/did:plc:svh6dgjnpkdl4dhxahj4xvkv/post/3lrlbsnh5z22j\">here</a>. For more, follow me on\n Bluesky (<a href=\"https://bsky.app/profile/righto.com\">@righto.com</a>),\nMastodon (<a href=\"https://oldbytes.space/@kenshirriff\">@kenshirriff@oldbytes.space</a>),\nor <a href=\"http://www.righto.com/feeds/posts/default\">RSS</a>. (I've given up on Twitter.)\nI worked on this project with CuriousMarc, Mike Stewart, and Eric Schlapfer, so expect a\nvideo at some point. Thanks to Richard for providing the FDAI.\nI wrote about the F-4 fighter plane's attitude indicator <a href=\"https://www.righto.com/2024/09/f4-attitude-indicator.html\">here</a>.</p>\n<p><a href=\"https://static.righto.com/images/fdai/fdai-opened2.jpg\"><img alt=\"Inside the FDAI. The amplifier boards have been removed for this photo.\" class=\"hilite\" height=\"505\" src=\"https://static.righto.com/images/fdai/fdai-opened2-w700.jpg\" title=\"Inside the FDAI. The amplifier boards have been removed for this photo.\" width=\"700\" /></a><div class=\"cite\">Inside the FDAI. The amplifier boards have been removed for this photo.</div></p>\n<h2>Notes and references</h2>\n<div class=\"footnote\">\n<ol>\n<li id=\"fn:simulator\">\n<p>There were many Space Shuttle simulators, so it is unclear which simulator was the source of our FDAI.\nThe photo below shows a simulator, with one of the ADIs indicated with an arrow.\nPresumably, our FDAI became available when a simulator was upgraded\nfrom physical instruments to the screens of the Multi-function Electronic Display System (MEDS).</p>\n<p><a href=\"https://static.righto.com/images/fdai/simulator.jpg\"><img alt=\"&quot;Forward flight deck of the fixed-base simulator.&quot; From Introduction to Shuttle Mission Simulation\" class=\"hilite\" height=\"425\" src=\"https://static.righto.com/images/fdai/simulator-w600.jpg\" title=\"&quot;Forward flight deck of the fixed-base simulator.&quot; From Introduction to Shuttle Mission Simulation\" width=\"600\" /></a><div class=\"cite\">\"Forward flight deck of the fixed-base simulator.\" From <a href=\"https://ia804505.us.archive.org/8/items/intro-to-sms/intro%20to%20sms.pdf#page=22\">Introduction to Shuttle Mission Simulation</a></div></p>\n<p>The most complex simulators were the three <a href=\"https://ntrs.nasa.gov/citations/19810005636\">Shuttle Mission Simulators</a>,\none of which could dynamically move to provide motion cues.\nThese simulators were at\nthe simulation facility in Houston&mdash;officially the Jake Garn Mission Simulator and Training Facility&mdash;which also had\na guidance and navigation simulator, a\nSpacelab simulator, and integration with the WETF (Weightless Environment Training Facility, an underground pool to simulate weightlessness).\nThe simulators were controlled by a computer complex containing dozens of networked computers.\nThe host computers were three UNIVAC 1100/92 mainframes, 36-bit computers that ran the simulation models.\nThese were supported by seventeen Concurrent Computer Corporation 3260 and 3280 <a href=\"https://ftpmirror.your.org/pub/misc/bitsavers/pdf/datapro/datapro_reports_70s-90s/Concurrent/M11-230-10_8909_Concurrent.pdf\">super-minicomputers</a> that simulated tracking, telemetry, and communication.\nThe simulators also used real Shuttle computers running the actual flight software; these were IBM AP101S\nGeneral-Purpose Computers (GPC).\nFor more information, see <a href=\"https://ia804505.us.archive.org/8/items/intro-to-sms/intro%20to%20sms.pdf\">Introduction to Shuttle Mission Simulation</a>.</p>\n<!-- -->\n<p>NASA had additional Shuttle training facilities beyond the Shuttle Mission Simulator.\nThe <a href=\"https://www.museumofflight.org/exhibits-and-events/spacecraft/nasa-full-fuselage-trainer\">Full Fuselage Trainer</a>\nwas a mockup of the complete Shuttle orbiter (minus the wings). It included full instrument panels (including\nthe ADIs), but did not perform simulations.\nThe <a href=\"https://www.nationalmuseum.af.mil/Visit/Museum-Exhibits/Fact-Sheets/Display/Article/195845/space-shuttle-crew-compartment-trainer/\">Crew Compartment Trainers</a> could be positioned horizontally or vertically (to simulate pre-launch\noperations). They contained accurate flight decks with non-functional instruments.\nThree <a href=\"https://www.nasa.gov/wp-content/uploads/2025/02/hughesfe-10-29-13.pdf#page=8\">Single System Trainers</a> provided simpler mockups for astronauts to learn each system, both during normal operation and during malfunctions, before using the\nmore complex Shuttle Mission Simulator.\nA list of Shuttle training facilities is in Table 3.1 of <a href=\"https://nap.nationalacademies.org/download/13227\">Preparing for the High Frontier</a>. Following the end of the Shuttle program, the trainers were distributed to various museums\n(<a href=\"https://space.stackexchange.com/questions/52325/is-space-shuttle-simulator-in-a-museum-somewhere\">details</a>).&#160;<a class=\"footnote-backref\" href=\"#fnref:simulator\" title=\"Jump back to footnote 1 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:honeywell\">\n<p>The Command Module for Apollo used a completely different FDAI (flight director-attitude indicator) that was\nbuilt by Honeywell.\nThe two designs can be easily distinguished: the Honeywell FDAI is round, while the Lear Siegler FDAI is octagonal.&#160;<a class=\"footnote-backref\" href=\"#fnref:honeywell\" title=\"Jump back to footnote 2 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:lm-fdai\">\n<p>The FDAI's signals are more complicated than I described above.\nAmong other things, the IMU's gimbal angles use a different coordinate system from the FDAI, so an\nelectromechanical unit called GASTA (Gimbal Angle Sequence Transformation Assembly) used resolvers and motors\nto convert the coordinates.\nThe digital attitude error signals from the computer are converted to analog by\nthe Inertial Measurement Unit's Coupling Data Unit (IMU CDU).\nFor attitude, the IMU is selected with the PGNS (Primary Guidance and Navigation System) switch setting.\nSee the <a href=\"https://www.nasa.gov/wp-content/uploads/static/history/alsj/LMSysHandbk.pdf\">Lunar Module Systems Handbook</a>,\n<a href=\"https://www.ibiblio.org/apollo/Documents/LM-1_Systems_Handbook_RevA.pdf#page=157\">Lunar Module System Handbook Rev A</a>,\nand the <a href=\"https://archive.org/details/apollo-operations-handbook-lunar-module-vol-1-sep-69/page/n53/mode/1up\">Apollo Operations Handbook</a>\nfor more.</p>\n<p><a href=\"https://static.righto.com/images/fdai/wiring.jpg\"><img alt=\"The connections to the Apollo FDAIs. Adapted from LM-1 Systems Handbook. I think this diagram predates the ORDEAL system. (Click for a larger version.)\" class=\"hilite\" height=\"253\" src=\"https://static.righto.com/images/fdai/wiring-w600.jpg\" title=\"The connections to the Apollo FDAIs. Adapted from LM-1 Systems Handbook. I think this diagram predates the ORDEAL system. (Click for a larger version.)\" width=\"600\" /></a><div class=\"cite\">The connections to the Apollo FDAIs. Adapted from <a href=\"https://www.ibiblio.org/apollo/Documents/LM-1_Systems_Handbook_RevA.pdf#page=157\">LM-1 Systems Handbook. I think this diagram predates the ORDEAL system. (Click for a larger version.)</div></p>\n<p><!-- -->&#160;<a class=\"footnote-backref\" href=\"#fnref:lm-fdai\" title=\"Jump back to footnote 3 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:axes\">\n<p>The roll, pitch, and yaw axes of the Lunar Module are not as obvious as the axes of an airplane. The diagram\nbelow defines these axes.</p>\n<p><a href=\"https://static.righto.com/images/fdai/axes.jpg\"><img alt=\"The roll, pitch, and yaw axes of the Lunar Module. Adapted from LM Systems Handbook.\" class=\"hilite\" height=\"316\" src=\"https://static.righto.com/images/fdai/axes-w500.jpg\" title=\"The roll, pitch, and yaw axes of the Lunar Module. Adapted from LM Systems Handbook.\" width=\"500\" /></a><div class=\"cite\">The roll, pitch, and yaw axes of the Lunar Module. Adapted from <a href=\"https://www.ibiblio.org/apollo/Documents/LM_Systems_Handbook_060269.pdf#page=5\">LM Systems Handbook</a>.</div></p>\n<p><!-- -->&#160;<a class=\"footnote-backref\" href=\"#fnref:axes\" title=\"Jump back to footnote 4 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:pcb\">\n<p>The amplifier is constructed on a single-sided printed circuit board. \nSince the components are packed tightly on the board, routing of the board was difficult.\nHowever, some of the components have long leads, protected by plastic sleeves.\nThis provides additional flexibility\nfor the board routing since the leads could be positioned as desired, regardless of the geometry of the component.\nAs a result, the style of this board is very different from modern circuit boards, where components are\nusually arranged in an orderly pattern.&#160;<a class=\"footnote-backref\" href=\"#fnref:pcb\" title=\"Jump back to footnote 5 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:jumpers\">\n<p>In our FDAI, the amplifier boards as well as the needle actuators are connected by pins that plug into sockets.\nThese connections don't seem suitable for flight since they could easily vibrate loose.\nWe suspect that the pin-and-socket connections made the module easier to reconfigure in the simulator, but were\nnot used in flyable units.\nIn particular, in the similar aircraft instruments (ARU/11-A) that we examined, the wires to the amplifier boards\nwere soldered.&#160;<a class=\"footnote-backref\" href=\"#fnref:jumpers\" title=\"Jump back to footnote 6 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:zener\">\n<p>The board has a 56-volt Zener diode, but the function of the diode is unclear.\nThe board is powered by 28 volts, not enough voltage to activate the Zener.\nPerhaps the diode filters high-voltage transients, but I don't see how transients could arise in that\npart of the circuit. (I can imagine transients when the pulse transformer switches, but the Zener isn't\nconnected to the transformer.)&#160;<a class=\"footnote-backref\" href=\"#fnref:zener\" title=\"Jump back to footnote 7 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:control\">\n<p>In more detail, each motor's control winding is a center-tapped winding, with the center connected to 28 volts DC.\nThe amplifier board's output transistors will ground either side of the winding during alternate half-cycles of\nthe 400 Hz cycle.\nThis causes the motor to spin in one direction or the other.\n(Usually, control winding are driven 90&deg; out of phase with the motor power, but I'm not sure how this phase shift\nis applied in the FDAI.)&#160;<a class=\"footnote-backref\" href=\"#fnref:control\" title=\"Jump back to footnote 8 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:lear\">\n<p>The history of Bill Lear and Lear Siegler is based on <a href=\"https://web.archive.org/web/20060530094020/http://www.wingsoverkansas.com/history/article.asp?id=103\">Love him or hate him, Bill Lear was a creator</a> and\n<a href=\"https://www.glenswanson.space/uploads/1/2/5/7/125738648/on_course_to_tomorrow.pdf#page=3\">On Course to Tomorrow: A History of Lear Siegler Instrument Division’s Manned Spaceflight Systems 1958-1981</a>.&#160;<a class=\"footnote-backref\" href=\"#fnref:lear\" title=\"Jump back to footnote 9 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:parts\">\n<p>Numerous variants of the Lear Siegler FDAI were built for Apollo, as shown before. \nAmong other things, the length of the unit (\"L MAX\") varied from 8 inches to 11 inches.\n(Our FDAI is approximately 8 inches long.)</p>\n<p><a href=\"https://static.righto.com/images/fdai/part-number-chart.jpg\"><img alt=\"The Apollo FDAI part number chart from Grumman Specification Control Drawing LSC350-301. (Click for a larger view.)\" class=\"hilite\" height=\"215\" src=\"https://static.righto.com/images/fdai/part-number-chart-w500.jpg\" title=\"The Apollo FDAI part number chart from Grumman Specification Control Drawing LSC350-301. (Click for a larger view.)\" width=\"500\" /></a><div class=\"cite\">The Apollo FDAI part number chart from Grumman Specification Control Drawing LSC350-301. (Click for a larger view.)</div></p>\n<p><!-- -->&#160;<a class=\"footnote-backref\" href=\"#fnref:parts\" title=\"Jump back to footnote 10 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:amplifiers\">\n<p>We examined a different ARU-11/A where the amplifier boards were not quite identical: the boards had\none additional capacitor and some of\nthe PCB traces were routed slightly differently.\nThese boards were labeled \"REV C\" in the PCB copper, so they may have been later boards with a slight\nmodification.&#160;<a class=\"footnote-backref\" href=\"#fnref:amplifiers\" title=\"Jump back to footnote 11 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:resistors\">\n<p>The amplifier scaling resistors were placed on the power supply board rather than the amplifier boards,\nwhich may seem strange. The advantage of this approach is that it permitted the three amplifier boards to be identical,\nsince the components that differ between the axes were not part of the amplifier boards.\nThis simplified the manufacture and repair of the amplifier boards.&#160;<a class=\"footnote-backref\" href=\"#fnref:resistors\" title=\"Jump back to footnote 12 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:panel\">\n<p>On the front panel of our FDAI, the text \"ROLL RATE\", \"PITCH RATE\", and \"YAW RATE\" has been painted over.\nHowever, the text is still faintly visible (reversed) on the inside of the panel, as shown below.</p>\n<p><a href=\"https://static.righto.com/images/fdai/panel-labeled.jpg\"><img alt=\"The inside of the FDAI's front cover.\" class=\"hilite\" height=\"415\" src=\"https://static.righto.com/images/fdai/panel-labeled-w400.jpg\" title=\"The inside of the FDAI's front cover.\" width=\"400\" /></a><div class=\"cite\">The inside of the FDAI's front cover.</div></p>\n<p><!-- -->&#160;<a class=\"footnote-backref\" href=\"#fnref:panel\" title=\"Jump back to footnote 13 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:systems-handbook\">\n<p>The diagram below shows the internals of the Apollo LM FDAI at a high level.\nThis diagram shows several differences between the LM FDAI and the FDAI that we examined.\nFirst, the roll, pitch, and yaw inputs to the LM FDAI are resolver inputs (i.e. sin and cos), rather than the synchro inputs to our FDAI.\nSecond, the needle signals below are modulated on an 800 Hz carrier and are demodulated inside the FDAI.\nOur FDAI, however, uses positive or negative voltages to drive the needle galvanometers directly.\nA minor difference is that the diagram below shows the Power Off Flag wired to +28V internally, while our FDAI has\nthe flag wired to connector pins, probably so the flag could be controlled by the simulator.</p>\n<p><a href=\"https://static.righto.com/images/fdai/fdai-page.jpg\"><img alt=\"The diagram of the FDAI in the LM Systems Handbook. Click for a larger image.\" class=\"hilite\" height=\"467\" src=\"https://static.righto.com/images/fdai/fdai-page-w350.jpg\" title=\"The diagram of the FDAI in the LM Systems Handbook. Click for a larger image.\" width=\"350\" /></a><div class=\"cite\">The diagram of the FDAI in the <a href=\"https://www.ibiblio.org/apollo/Documents/LM_Systems_Handbook_060269.pdf#page=5\">LM Systems Handbook</a>. Click for a larger image.</div></p>\n<p><!-- -->&#160;<a class=\"footnote-backref\" href=\"#fnref:systems-handbook\" title=\"Jump back to footnote 14 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:MEDS\">\n<p>The Space Shuttle instruments were replaced with color LCD screens in the MEDS (Multifunction Electronic Display System) upgrade.\nThis upgrade is discussed in <a href=\"https://journals.sagepub.com/doi/10.1177/106480460501300405\">New Displays for the Space Shuttle Cockpit</a>.\nThe <a href=\"https://gandalfddi.z19.web.core.windows.net/Shuttle/JSC-11174%20-%20Space_Shuttle_Systems_Handbook_Vol3.pdf\">Space Shuttle Systems Handbook</a> shows the ADIs on the forward console (pages 263-264) and the aft console (page 275).\nThe physical ADI is compared to the MEDS ADI display in <a href=\"https://www.ibiblio.org/apollo/Shuttle/sts83-0020v1-34%20-%20Displays%20and%20Controls%20-%20GNC.pdf\">Displays and Controls, Vol. 1</a> page 119.&#160;<a class=\"footnote-backref\" href=\"#fnref:MEDS\" title=\"Jump back to footnote 15 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:shuttle-adi\">\n<p>The diagram below shows the internals of the Shuttle's ADI at a high level.\nThe Shuttle's ADI is more complicated than the Apollo FDAI, even though they have the same indicator ball and needles.</p>\n<p><a href=\"https://static.righto.com/images/fdai/shuttle-fdai.jpg\"><img alt=\"A diagram of the Space Shuttle's ADI. From Space Shuttle Systems Handbook Vol. 1, 1 G&amp;C DISP 1. (Click for a larger image.)\" class=\"hilite\" height=\"129\" src=\"https://static.righto.com/images/fdai/shuttle-fdai-w700.jpg\" title=\"A diagram of the Space Shuttle's ADI. From Space Shuttle Systems Handbook Vol. 1, 1 G&amp;C DISP 1. (Click for a larger image.)\" width=\"700\" /></a><div class=\"cite\">A diagram of the Space Shuttle's ADI. From Space Shuttle Systems Handbook Vol. 1, 1 G&amp;C DISP 1. (Click for a larger image.)</div></p>\n<p><!-- -->&#160;<a class=\"footnote-backref\" href=\"#fnref:shuttle-adi\" title=\"Jump back to footnote 16 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:photos\">\n<p>Multiple photos of the exterior of the Shuttle ADI are available <a href=\"https://airandspace.si.edu/collection-objects/indicator-attitude-director-adi-shuttle-columbia/nasm_A20050413000\">here</a>, from the National Air and Space Museum.\nThere are interior photos of Apollo FDAIs online, but they all appear to be modified for Shuttle simulators.&#160;<a class=\"footnote-backref\" href=\"#fnref:photos\" title=\"Jump back to footnote 17 in the text\">&#8617;</a></p>\n</li>\n</ol>\n</div>",
  "id": "tag:blogger.com,1999:blog-6264947694886887540.post-2250215887377196568"
}