{
  "title": "Don't make it \"like Google\"",
  "link": "https://rakhim.exotext.com/dont-make-it-like-google",
  "published": "Wed, 26 Mar 2025 00:00:00 GMT",
  "summary": "<p>Google is usually criticized for its relentless collection of personal data. It's an important and widely discussed topic, but I’m surprised there isn’t another common criticism: its responsibility for UI &amp; UX design and its consequences.</p>\n<p>Any large company that creates products, whether software or physical, is responsible for how its design choices shape the broader perception of design itself. Google is a prime example because millions use its products, often treating them as standards. Developers frequently aim to make things “like Google” because it feels familiar and, seemingly, the right way to do things. In the past, this was an implicit influence, but now it’s direct: Google became the platform for web applications (Chrome) and mobile applications (Android). It also created a framework for human-machine interaction: <a href=\"https://m3.material.io/\">Material Design</a>.</p>\n<p>Now, “doing it like Google” isn’t just desirable; it’s necessary.</p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/kM3JZEkNgB_cmsyX7ySQf.png\" /></p>\n<p>Material design is very opinionated, and in addition to the mechanics, it dictates a very specific visual style that undoubtedly reminds of Google and Big Tech Style. Most tech products now look indistinguishable, just a blobby premordial mess of colors.</p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/8NpFN4U31_D3gcxjHdflu.jpg\" />\n<em>Landing page or soviet poster?</em></p>\n<p>The problem? Google’s actual UI &amp; UX design is terrible. Whether mass-market or enterprise, web or mobile, its interfaces are chaotic and confusing. Every time I use Google Drive or the G Suite admin console, I feel lost. Neither experience nor intuition helps—I feel like an old man seeing a computer for the first time. I used Android for years (stock Android on a Nexus device), yet even after all that time, I struggled to distinguish buttons from plain text.</p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/W8zT0eYdeMEyI62VVAxNC.png\" /></p>\n<p>Imagine living in the same apartment for years but constantly confusing the light switch with the toilet flush. That’s how I felt every day. Of course, maybe I’m just weird. But I know I’m not alone.</p>\n<p>The design flaws of a single company aren’t a global crisis. Google has little competition, so we’re stuck using its products, but that’s a separate issue. What concerns me most is the “do it like Google” effect.</p>\n<p>Instead of prioritizing objectively good user experiences, the more profitable choice is often to mimic Google’s design. Not because developers are bad or lazy. Not because users enjoy clunky interfaces. But because it &quot;makes sense&quot; from the perspective of development costs and marketing.</p>\n<p>It’s tricky to praise Apple while criticizing Google because where Google has clumsy interfaces, Apple has bugs and arbitrary restrictions. But if we focus purely on interface design, Apple demonstrates how influence over users and developers can foster generations of well-designed products. On average, an app in Apple’s ecosystem is more polished and user-friendly than one in Google’s. </p>\n<p>This responsibility to shape the perception of what is &quot;normal&quot; extends beyond tech companies—it applies to entire industries. We’ve become accustomed to the unintuitive interfaces of washing machines and microwaves. A new washing machine may be quieter, more efficient, and more aesthetically pleasing, yet its dials and icons still feel alien; or your washing machine <a href=\"https://www.jeffgeerling.com/blog/2025/i-wont-connect-my-dishwasher-your-stupid-cloud\">now requires an app</a>. Manufacturers have no incentive to improve this aspect—they just do it “like the Google of their industry.”</p>\n<p>And the &quot;Google&quot; of any industry inevitably gets worse over time.</p>\n<hr />\n<p>Subscribe to my totally non-spammy occasional newsletter to get updates about my projects, ideas, and <del>deep insights</del> mildly interesting thoughts about technology and programming. <a href=\"https://buttondown.com/rakhim/archive/\">See archives</a>.</p>\n<form action=\"https://buttondown.com/api/emails/embed-subscribe/rakhim\" class=\"embeddable-buttondown-form\" method=\"post\" target=\"popupwindow\">\n  <input id=\"bd-email\" name=\"email\" type=\"email\" /> \n  <input style=\"margin-top: 0.5em;\" type=\"submit\" value=\"Subscribe\" />\n</form>",
  "id": "https://rakhim.exotext.com/dont-make-it-like-google"
}