{
  "title": "Jupyter notebooks as e2e tests",
  "link": "https://rakhim.exotext.com/jupyter-notebooks-as-e2e-tests",
  "published": "Mon, 16 Dec 2024 00:00:00 GMT",
  "summary": "<p>Lots of scientific Python libraries are often used within Jupyter notebooks. At work, we develop and maintain plenty of such libraries for quantum computing, and some more higher-level ones include extensive user guides in form of Jupyter notebooks. </p>\n<p>Recently, I've been involved in building a new library, and it ended up containing a half dozen notebooks, covering everything from a quick start guide to niche applications and configuration examples. It being a completely new product, we wanted our users to have extensive interactive documentation from the start.</p>\n<p>After the alpha stage was behind us, we needed to write e2e tests. I realized that user guide notebooks are essentially that! They already cover every major e2e use case, and we update them religiously. We also render them into HTML docs on release. Sure, they don't cover 100% of cases, and aren't generally parametrized. But if everything in them works, we have a very good indication that the overall release is healthy. (The library is used by another component of the system, and there are separate e2e tests for that component; and there are unit tests everywhere, too.)</p>\n<p>To make Jupyter notebooks runnable as e2e tests (both locally and in CI pipelines) we needed to do 2 things:</p>\n<ol>\n<li>Make them parametrized so that both users following the guide and pipelines can run them.</li>\n<li>Run them automatically.</li>\n</ol>\n<p>Point 1 is relevant because the library performs some actions on a remote server (a real quantum computer). So, we made the first cell in each user guide start with reading the URL of the server from the environment (<code>os.environ['SERVER_URL']</code>). The user can replace it with a literal string, or set the environment variable in their system. In CI, the environment variable is set by the Gitlab pipeline, and we can even dynamically rotate addresses.</p>\n<p>Point 2 can be achieved in two ways. The easiest is to just install <a href=\"https://github.com/jupyter/nbclient\">nbclient</a> and run <code>jupyter execute &lt;NOTEBOOK.ipynb&gt;</code>. It can accept multiple files, and it produces no output. If notebooks were executed without errors, the process terminates without errors as well, and can be treated as a successful run by the CI. If there are errors, you'll see the output, which is good for debugging.</p>\n<p>If you need to view the output of each executed cell, you can use a combination of <code>nbconvert</code> and <code>jq</code> (<a href=\"https://jqlang.github.io/jq/download/\">homepage</a>). <code>nbconvert</code> to execute the notebook and convert the outputs into another notebook, then redirect them to stdout; and <code>jq</code> to extract particular parts of the output JSON.</p>\n<pre><code class=\"hljs\">jupyter nbconvert --to notebook --execute  &lt;NOTEBOOK.ipynb&gt; --stdout | jq -r &#x27;.cells[] | select(.outputs) | .outputs[] | select(.output_type == &quot;stream&quot;) | .text[]&#x27;\n</code></pre><p>This is a bit fragile as it relies on a particular structure of the output JSON, and it may change in future Jupyter versions. The example above is suitable for <code>notebook</code> version <code>6.4</code> and above. However, a failure of execution will not propogate up, the resulting notebook would just contain cells with error output, and <code>jq</code> would parse them successfully, rendering the whole run unsuited for continous integration. You'd need to have some separate script to detect the presence/absence of &quot;error&quot; cells, and return the corresponding return code so that CI understands it.</p>\n<p>For our purposes, the first way works ok. We only care about potential errors. Overall, by having this setup, we test both the integrity of documentation and of code on each merge request.</p>\n<hr />\n<h3>Footnotes</h3>\n<ol>\n<li>Netflix uses notebooks for a variety of interesting purposes, including testing. See <a href=\"https://netflixtechblog.com/notebook-innovation-591ee3221233\">Beyond Interactive: Notebook Innovation at Netflix</a>.</li>\n</ol>",
  "id": "https://rakhim.exotext.com/jupyter-notebooks-as-e2e-tests"
}