{
  "title": "The Apple Network Server MacOS ROMs have resurfaced",
  "link": "https://oldvcr.blogspot.com/2025/10/the-apple-network-server-macos-roms.html",
  "published": "2025-10-26T11:17:00.000-07:00",
  "summary": "<div class=\"separator\" style=\"clear: both;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj-h0fnuwBHe6wOp2s1W2qFHrEFHNSGW_RjarCRpdOliGgp091O7z-VqwCGKGmT-cdI3cxRmRItnhv88649Eiji6D4SGuIStNocXFXTW3Did20zC4BnndqLhh7kyLytsShOYi6tSIAOOHvnbjw_Cvr1tR6OohMRNjoNhZ458z08sOmgiErtA9XwsbovQFM/s5712/IMG_1018.jpg\" style=\"display: block; padding: 1em 0; text-align: center;\"><img alt=\"\" border=\"0\" height=\"320\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj-h0fnuwBHe6wOp2s1W2qFHrEFHNSGW_RjarCRpdOliGgp091O7z-VqwCGKGmT-cdI3cxRmRItnhv88649Eiji6D4SGuIStNocXFXTW3Did20zC4BnndqLhh7kyLytsShOYi6tSIAOOHvnbjw_Cvr1tR6OohMRNjoNhZ458z08sOmgiErtA9XwsbovQFM/s320/IMG_1018.jpg\" /></a></div>\n\nThe 1996 Apple Network Server was Apple's first true Unix-through-and-through server (the Apple Workgroup Server 95, actually a Quadra 950 with a special PDS card limited to A/UX, doesn't really count) and <a href=\"/2023/11/the-apple-network-servers-all-too.html\">through a complex history</a> came to run <a href=\"/2025/05/harpoom-of-course-apple-network-server.html\">IBM's AIX</a> as its native operating system. I actually had an ANS 500 when it was almost new, in 1998, and it ran Floodgap until 2012. It is still in my collection and still runs, along with an ANS 700 I later acquired and a (sadly battery bombed) <a href=\"/2021/10/shiner-esb-apple-network-server.html\">\"Shiner ESB\" prototype that used to be at Netscape</a>. AIX was your only choice &mdash; no other operating system was supported.\n<p>\nStill, it was a relatively open secret that the ANS was heavily derived from existing Power Macintosh hardware, most closely the Power Macintosh 9500, and early \"Shiner\" prototype systems were even demonstrated with MacOS. This was apparently the underpinning of <a href=\"/2023/12/when-power-macintosh-ran-netware.html\">Apple's brief flirtation with NetWare as a server OS</a>, variously codenamed Wormhole, Deep Space Nine and most famously Cyberpunk. Then-CEO Michael Spindler made public statements supporting NetWare on Apple hardware; Wormhole was reportedly demonstrated on an early prototype likely of <a href=\"http://www.floodgap.com/retrobits/ans/9150/\">the Workgroup Server 9150</a> and Cyberpunk was explicitly meant for Shiner. Cyberpunk will no longer run on an ANS with production ROMs, but reportedly did run on ANSes with pre-production ROMs that could still boot MacOS, and <em>does</em> run on early NuBus Power Macs like the Power Macintosh 6100, which is <a href=\"/2023/12/when-power-macintosh-ran-netware.html\">how we demonstrated it</a>. However, potential customers strongly preferred a Unix option and Apple had an arrangement with IBM around AIX, and so as the last operating system still standing that's what <a href=\"/2023/11/the-apple-network-servers-all-too.html\">the ANS ended up running</a>. Production ANSes as sold with the standard Open Firmware 1.1.22 ROMs lock MacOS out entirely and you get a message like this:\n\n<div class=\"separator\" style=\"clear: both;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiyyGBIzsArRSoYnNDVPaQ3emOSH43BJC5G9fXJ0_ZVRJZgc_1XYHSHBYgSsP04WEvvysJnGxyz1XY2T9l4VJcnzOd2dQ78mAUH94mu7lbZG0GIw67kk-JLBwnOj7zdhkLrPextWfHBBQS2jviPUtsn1atO3TDmAtFHavpwHDLptoSJdXdVfRYv1jIQYEs/s4080/PXL_20231117_205759318.jpg\" style=\"display: block; padding: 1em 0; text-align: center;\"><img alt=\"\" border=\"0\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiyyGBIzsArRSoYnNDVPaQ3emOSH43BJC5G9fXJ0_ZVRJZgc_1XYHSHBYgSsP04WEvvysJnGxyz1XY2T9l4VJcnzOd2dQ78mAUH94mu7lbZG0GIw67kk-JLBwnOj7zdhkLrPextWfHBBQS2jviPUtsn1atO3TDmAtFHavpwHDLptoSJdXdVfRYv1jIQYEs/s320/PXL_20231117_205759318.jpg\" width=\"320\" /></a></div>\n\nAlthough an old nerds' tale circulated at the time saying you could pull 9500 ROMs, put in a video card and boot from an external hard disk (because the video chip and internal SCSI controller are unique to the ANS and weren't supported by the 9500 or MacOS), this couldn't possibly have worked because among other things the Bandits in the ANS are mapped differently. Lots of people, including yours truly, had certainly tried. Still, I was used to AIX as an AIX administrator since the 3.2.5 days on real RS/6000 hardware and the ANS ran it splendidly, so today mine still runs it (4.1.5 is the last AIX release supported).\n\n<div class=\"separator\" style=\"clear: both;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg1pX8mu6r5a34dOWn6S9eP9J6DQH_zs62A5q75wozL6lIpnWKT1wHkMjBZIcdixB6PlecyWvJ7eL4KpO7BVs5P3AKxEqYEWYq_6M90U8pzUJb9pthYgAD2sUKc1CSEzIgyf80nyzSVye0YiNtWBybyz6xAZha_g1VUfc6Q2s2vuY1o82D4uGUcrC02oSU/s2349/19961125-iw-hancock.jpg\" style=\"display: block; padding: 1em 0; text-align: center;\"><img alt=\"\" border=\"0\" height=\"320\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg1pX8mu6r5a34dOWn6S9eP9J6DQH_zs62A5q75wozL6lIpnWKT1wHkMjBZIcdixB6PlecyWvJ7eL4KpO7BVs5P3AKxEqYEWYq_6M90U8pzUJb9pthYgAD2sUKc1CSEzIgyf80nyzSVye0YiNtWBybyz6xAZha_g1VUfc6Q2s2vuY1o82D4uGUcrC02oSU/s320/19961125-iw-hancock.jpg\" /></a></div>\n\nBut to me the best thing about the ANS was that I got a big beefy RISC server for a summer's work, so I didn't have to plump down a credit card. For everyone else, the ANS was expensive (starting at $10,000+ in 1996, a cool $20 grand in 2025 dollars) and Apple wasn't moving many. CEO Gil Amelio had lured Ellen Hancock away from National Semiconductor as Apple's new CTO and tasked her with finding a new path for the MacOS, though in the meantime Apple had this big hulking midrange server that wasn't selling. So, as an attempt to juice sales, Hancock announced at Comdex 1996 that the ANS would be able to run other operating system choices, not just AIX. MacOS was an obvious one because it already had before, but Hancock also proposed Windows NT to the great surprise of attendees. While Windows NT was built to be system-agnostic and versions already ran on PowerPC hardware, and people have since <a href=\"https://github.com/Wack0/maciNTosh\">hacked it to run on Power Macs</a>, this would have been the first time it could officially ever run on an Apple machine.\n<p>\nHancock's assertion was a simple ROM change would do it, and as it happens the ROMs on the ANS are conveniently on a small daughtercard that can be replaced. However, it seems that the market was sceptical this could work &mdash; heck, <em>I</em> was sceptical while doing the story research, since I knew no such ROMs were ever publicly sold &mdash; and the recently-returned Steve Jobs talked Amelio into cancelling the ANS line <a href=\"/2023/10/teaching-apple-cyberdog-10-new-tricks.html\">and OpenDoc</a> both on the same day in 1997. Nothing more ever turned up about either option.\n\n<div class=\"separator\" style=\"clear: both;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh-9EEr9EPjvj0KhoewP7xuJ9AcOXEDpbn0lfU7dZuf005rTPn9YZAwZcAjVmuV-h8YEJ7Bk32vNUdhGQgCIxT_YaQ0OCE3DG-VOxO12SI5P5lU4DyBgya4FisTCjZ50gUbmnoCP-nPwtWxz-l_njizQanEcFfgElHv0V-rZ87_MCGRasmoRDkv-kMcdQM/s3600/AM28F020.jpg\" style=\"display: block; padding: 1em 0; text-align: center;\"><img alt=\"\" border=\"0\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh-9EEr9EPjvj0KhoewP7xuJ9AcOXEDpbn0lfU7dZuf005rTPn9YZAwZcAjVmuV-h8YEJ7Bk32vNUdhGQgCIxT_YaQ0OCE3DG-VOxO12SI5P5lU4DyBgya4FisTCjZ50gUbmnoCP-nPwtWxz-l_njizQanEcFfgElHv0V-rZ87_MCGRasmoRDkv-kMcdQM/s320/AM28F020.jpg\" width=\"320\" /></a></div>  \n\nRecently a former employee who was on the business development team for Apple's server products <a href=\"https://tinkerdifferent.com/threads/erics-apple-network-server-700-tinker-log.3987/#post-37621\">posted on the Tinker Different boards</a>: not only did he have the mythical MacOS ROM, he had it installed in a Deep Dish booting the MacOS. Deep Dish was the code name for the planned but unreleased ANS 300, a small rackmountable version (as opposed to the rackmount plates Apple sold for the 500 and 700 which take up a whopping 19U), so here was a prototype machine running development ROMs booting an operating system it was never actually sold with. More to the point, he confirmed the Windows NT ROMs actually did exist and worked as well.\n<p>\nThough he didn't have the NT ROMs, he did dump the two development ROMs he had (a third is in progress) which included the MacOS ROM &mdash; and now we have them for analysis. What's interesting is that both the explicit MacOS ROM and the Open Firmware 2.26b6 ROM he dumped seem capable of booting MacOS, though the 2.2 ROM has strings saying <tt>MacOS is unsupported, use at your own risk.</tt> and <tt>MacOS requires PCI video card and external SCSI boot disk.</tt> (which may lend credence to that old nerds' tale, assuming you had the right ROMs, not the 9500's). However, the full MacOS ROM reportedly \"just works,\" all the way to Mac OS 9; one wonders if with XPostFacto you could drag it into OS X that way, giving it another Unix option besides AIX, Linux and NetBSD, the driver issue notwithstanding. Though the MacOS ROM does not use the ANS's front-mounted LCD, which is one of its best features, it wouldn't seem difficult to come up with an INIT extension for it. A particularly tantalizing thought is this might also get Cyberpunk running on a Shiner for the first time since 1996, the very machine it was intended for.\n<p>\nTo make all that happen, of course, we next need to get the MacOS ROM on an actual ROM card. The ROMs this individual had were flashable and I need to do some looking at mine, and the connectors aren't common. Nevertheless, the first step is to actually <em>have</em> the ROM and now we do. I'm hopeful that this breakthrough might encourage further exploration of my favourite Apple server and that someone out there has the NT ROMs and steps forward. The Apple Network Server was always a cult favourite as one of Apple's more notorious white elephants and now almost 30 years after its introduction there may be even more fun things to do on it. If you know where to find them, post in the comments or drop me a line at ckaiser at floodgap dawt com (happy to keep you anonymous if you prefer which I have done for other former Apple engineers in the past).",
  "id": "tag:blogger.com,1999:blog-8349470052336612452.post-5858126170835726977"
}