{
  "title": "The Ascent to Sandia Crest II",
  "link": "https://computer.rip/2025-10-20-ascent-to-sandia-crest-2.html",
  "published": "19 Oct 2025 00:00:00 UT",
  "summary": "<p><a href=\"https://computer.rip/2025-09-28-the-ascent-to-sandia-crest-part-1.html\">Where we left\noff</a>,\nAlbuquerque's boosters, together with the Forest Service, had completed\nconstruction of the Ellis Ranch Loop and a spur to the Sandia Crest. It was\npossible, even easy, to drive from Albuquerque east through Tijeras Pass, north\nto the present-day location of Sandia Park, and through the mountains to\nPlacitas before reaching Bernalillo to return by the highway. The road\nprovided access to the Ellis Ranch summer resort, now operated by the Cooper\nfamily and the First Presbyterian Church, and to the crest itself.</p>\n<p>The road situation would remain much the same for decades to come, although not\ndue to a lack of investment. One of the road-building trends of the 1920s and\n1930s was the general maturation of the United States' formidable highway\nconstruction program. The Federal Aid Highway Act of 1921 established the\npattern that much of western road building would follow: the federal government\nwould split costs 50:50 to help western states build highways. This funding\nwould bring about many of the US highways that we use today.</p>\n<p>A share of the money, called the forest highway fund, was specifically set aside\nfor highways that were in national forests or connected national forests to\nexisting state highways. By 1926, the Federal Lands Transportation Program had\ntaken its first form, a set of partnerships between the Bureau of Public Roads\n(later the Federal Highway Administration) and federal land management agencies\nto develop roads for economic and recreational use of federal land. For the\nForest Service of the era, a forest without road access was of limited use.\nThe following years saw a systematic survey of the national forests of New\nMexico with an eye towards construction.</p>\n<p>The Federal Aid Highway Act presaged the later interstate freeway program in\nseveral ways. First, the state-federal cost sharing model would become the norm\nfor new highways and drive the politics of road construction to this day.\nSecond, despite the nominal responsibility of the states for highways, the Act\nestablished the pattern of the federal government determining a map of\n&quot;desirable&quot; or &quot;meritorious&quot; road routes that states would be expected to\nfollow. And finally, the Act enshrined the relationship between the military and\nroad building. The first notional map of an integrated US highway system,\ndeveloped mostly by the Army for the Bureau of Public Roads, was presented to\nCongress by esteemed General of the Armies John Pershing. This plan, the\nPershing Map, is now over 100 years old but still resembles our contemporary\nfreeway system.</p>\n<p>The Great Depression did not generally drive construction, but roads would\nprove an exception. Roosevelt's New Deal, and the dryer language of the\nEmergency Relief Acts of the early 1930s, provided substantial federal\nfunding for construction and improvement of highways. The impact on New\nMexico was considerable. &quot;Surveys, plans, and estimates of Navajo Canyon\nSection of State Highway No. 2 within the Carson National Forest, south of\nCanjilon, and survey, plans, and estimates on State Highway No. 12 between\nReserve and Apache Creek on the Datil-Reserve Forest Highway route.&quot; The\nlists of highway projects in newspapers become difficult to track. The\nforest highway program's budget doubled, and doubled again. &quot;The building\nof new Forest Highways in the National Forests of New Mexico will be rushed\nas rapidly as possible... to open up the National Forests to greater use\nand protection from fires.&quot;</p>\n<p>The papers were optimistic. The <em>Carlsbad Current-Argus</em> ran a list of\nForest Highway efforts in 1932; the headline read simply &quot;Forest Service\nTo Solve Unemployment.&quot;</p>\n<hr />\n<p>The depression-era building campaign left the Ellis Ranch loop on the same\nroute, but saw much of the route improved to a far higher standard than before.\nGraveling, oiling, and even paving stabilized the road surface while CCC crews\nbuilt out embankments on the road's mountainside segments.  By 1940, much of the\nloop had been incorporated into New Mexico Highway 44---a continuous route from\nCedar Crest to Aztec.</p>\n<p>Former NM 44 exemplifies changes to the loop's northern segment. Much of NM 44\nis now known as NM 550, a busy highway from Bernalillo and alongside the far\nreaches of Los Lunas that eventually becomes one of the major routes in the\nstate's northwest corner. The connection to Cedar Crest, though, is now\ndifficult to fathom. The former route of NM 44 continued east of the freeway\nthrough Placitas and along NM 165, over the mountains to become NM 536 at Balsam\nGlade and then NM 14 at San Antonito. NM 14 is a major route as well, and NM 536\nis at least paved---but as discussed in part I, NM 165 is now a rough unpaved\nroad appealing mostly to OHV users and impassable in winter <sup class=\"footnote-ref\" id=\"fnref-1\"><a href=\"#fn-1\">1</a></sup>.</p>\n<p>Sections of NM 165 do seem to have been paved, mostly closer to Placitas, but\nmaintenance as a main highway had ended at least by 1988 when the NM 44\ndesignation was retired.</p>\n<p>This is the major reason for my fascination with the Ellis Ranch Loop: today, it\nis hardly a loop---the whole loop is still there, and you can drive it at least\nin summer, but the segment of the highway in the north part of the Sandias, what\nis now 165, doesn't feel at all like a continuation of the same loop as NM 536.\nOn the ground, when driving up 536, it's clear that the &quot;main&quot; route at Balsam\nGlade is to follow the curve west onto Sandia Crest Scenic Highway. And yet, the\nScenic Highway was only a spur of the original loop.</p>\n<p>This oddity of history is still reflected in the road designations and, as a\nresult, modern maps. NM 536 and NM 165 are state highways. Sandia Crest Scenic\nHighway, despite the name, is not. As you zoom out, Google Maps hides the Scenic\nHighway entirely, depicting the former Ellis Ranch Loop as the main route. This\nis very different from what you will find if you actually drive it.</p>\n<p>This halfway state of change, with NM 165 still designated as a highway but\neffectively abandoned and the more major Scenic Highway not designated, partly\nreflects the bureaucratic details of the 1930s. NM 165 was considered part of a\nproper inter-city route; the Scenic Highway deadends at the crest and thus never\nreally &quot;went anywhere.&quot; But there is more to the story: it also reflects the\nambitions, errors, and shifting priorities of the mid-century.</p>\n<hr />\n<p>The first formal ski area in the Sandia Mountains opened in 1936, developed by\nRobert Nordhaus's Albuquerque Ski Club. The ski area, then called La Madera for\nthe canyon that tops out at the ski slopes, became a center of southwestern\nwintersports. In the following decades, the ski area would displace Ellis Ranch\nas the main destination in the mountains.</p>\n<p>World War II disrupted skiing and recreation more broadly; progress on Sandia\nMountain development stalled into the 1940s. The decline wouldn't last: WWII\nraised the possibility of ground combat in Northern Europe or even a need to\ndefend the inland United States against invasion. Military planners considered\nDenver the best choice for an emergency relocation of the national capital in\nresponse to an Atlantic assault. While never a formal policy, the concept of\nDenver as &quot;national redoubt&quot; survived into the Cold War and directed military\nattention to the Rocky Mountains.</p>\n<p>From 1939 into the 1940s, the National Ski Patrol lobbied for development of\nski-mounted military units to the extent that it became a de facto auxiliary of\nthe US Army. Ultimately only one Army &quot;Mountain Division&quot; would be established,\nbut its members---recruited and trained by the Ski Patrol itself---went on to\nan instrumental role in securing the surrender of German forces in Austria.</p>\n<p>While the Alpine Light Infantry were never a large part of the Army, they\nbrought public attention to skiing and mountain recreation. Military support\nenabled expansion of the Ski Patrol's training programs, and returning soldiers\nhad stories of skiing in the Alps. Much like aviation, skiing surged after the\nwar, elevated from a fairly obscure extreme sport to one of the country's best\nknown forms of recreation.</p>\n<p>In 1946, the La Madera Ski Area installed what was then the longest T-bar lift\nin the country. It built by Ernst Constam, a Swiss engineer who invented the\nmodern ski lift and became trapped in the United States when the war broke out\nduring his business trip. Constam found himself an American by accident, but\ndeveloped a fierce allegiance to his new home and soon worked for the Army. He\nparticipated in the training of the Mountain Division, contributed his\nunderstanding of European alpine combat to military intelligence, and even built\nthe first military ski lift: a T-bar at Camp Hale in Colorado, now called Ski\nCooper.</p>\n<p>During the 1950s, the ski area underwent ownership changes and some financial\ndifficulty. Nordhaus operated the area profitably, but needed cash to build the\ninfrastructure for continued growth. That cash came in the form of Albuquerque\nbusinessman and real estate developer Ben Abruzzo, who is remembered first as a\nfamous balloonist (responsible for much of Albuquerque's prominence in hot air\nballooning) but was also an avid skier. Nordhaus and Abruzzo formed the Sandia\nPeak Ski Company and construction was soon underway.</p>\n<p>You could access the base of the ski area from the Ellis Ranch Loop, but it was\nslow going, especially in winter. The trip from Albuquerque reportedly took\nhours. Ski area expansion required easier access. After negotiations related to\nthe ski area permit expansion, the Forest Service paved the entirety of Ellis\nLoop from the base of the mountains to the ski area. This was the first time\nthat a large section of the road in the mountains was fully paved, and it\nappears to be the Forest Service's decision to pave from the ski area southeast\nto San Antonito, rather than north to Placitas, that sealed the fate of NM 165.\nFrom that point on, the &quot;main&quot; way from Albuquerque to the Mountains was via\nTijeras, not via Placitas.</p>\n<hr />\n<p>The late 1950s were a busy time in the Sandias. The ski area was not the only\ngrowing tourism attraction; a post-war resurgence in travel and automobilism\nrenewed the pro-tourism boosterism of the 1920s. Albuquerque business interests\nwere back to lobbying the Forest Service for tourist facilities, and Abruzzo\nand Nordhaus's efforts at the ski area inspired confidence in a bright future\nfor mountain recreation. All that was needed were better roads.</p>\n<p>Sometime during the 1950s, the names &quot;Ellis Ranch Loop&quot; or &quot;Ellis Loop&quot; gave way\nto &quot;Sandia Loop.&quot; Despite the new name, the road kept to its old history: the\nstate and the Forest Service announced their intent to complete a project that,\nas far as they were concerned, had been in intermittent progress since the\n1930s: paving and widening the entire route as a two-lane highway.</p>\n<p>The project had never been completed in part because of the difficult\nconditions, but there were politics at play as well. Federal funding, critical\nto completing highway projects, was allocated based on the recommendations of\ncommittees at each level of government. The development of &quot;secondary highways,&quot;\na category that included NM 44, fell to county committees for prioritization.\nDespite the emphasis that Bernalillo County put on the Sandia Loop, Sandoval\nCounty was less motivated.  Another nail in NM-165's coffin came in 1958 when\nthe Sandoval County Road Committee definitively stated that their budget was\nquite limited and the Sandia Loop was not a priority. As far as I can tell,\nserious efforts to pave the existing road between Balsam Glade and Placitas\nended at that meeting. A few years later, the state highway department announced\nthat the project had been canceled.</p>\n<p>Despite the fate of the loop's northern half, the rest of the Sandia mountain\nroads enjoyed constant attention. The southern portion of the loop was widened\n(by four feet, three inches) with new road base laid. The road to the crest\nitself, despite the involvement of the state highway department in the original\nconstruction, was decisively the problem of the Forest Service---at least, this\nwas the point repeatedly made by the state highway department as Albuquerque\ninterests campaigned for its improvement. Still, boosters did not have to wait\nfor long.  In 1958 the Forest Service let contracts for improvement of the\nSandia Crest road as an &quot;anti-recession project.&quot;</p>\n<p>While many reports describe the late-1950s Sandia Crest project as widening\nand resurfacing, some changes to the alignment were made as well. The most\nsevere of its many switchbacks, at the Nine Mile Picnic Area, was reworked\nfor fewer curves. The original alignment is still in use for access to the\npicnic area.</p>\n<p>In the mean time, crews contracted by the Forest Service completed yet another\nround of improvements to the north section of the loop road. This project\nspanned from a &quot;preliminary engineering survey&quot; in 1958 to the point where the\ngravel base was largely complete in 1959, but while paving of the entire route\nwas planned it does not seem to have happened. The Albuquerque business\ncommunity felt that there was good reason for the paving project: the\n<em>Albuquerque Tribune</em> reported in 1958 that &quot;upwards of 100,000 cars annually\nuse the Loop Road in making the punishing trip up to La Madera ski run and the\nCrest.&quot; At the same time, though, Albuquerque's once unified push for mountain\naccess started to face political headwinds.</p>\n<hr />\n<p>The 1960s were a different world, but some things stayed the same: Bob Cooper\nadvertised cabins for lease at Ellis Ranch, and the business community wanted to\nsee an improved, paved loop highway around the Sandias. The original completion\nof the Ellis Ranch Loop appeared in the <em>Albuquerque Tribune's</em> &quot;30 Years Ago&quot;\nfeature in 1960, alongside coverage of the growing debate over placement of the\ncity's two upcoming interstate freeways.</p>\n<p>Despite efforts by the Chamber of Commerce, Highland Business Men's Association,\nand Downtown Business Men's Association to restart the Sandia Loop project, the\nstate Highway Department remained silent on the subject. This was the peak era\nof freeway construction, and the department had many construction problems on\nthe I-25 corridor especially. The Sandia Loop remained a popular facility,\nthough, recommended by the Mobil travel guide starting in 1962. That same year,\nthe La Madera ski area, now called Sandia Peak, opened the &quot;Summit House&quot;\nrestaurant at the top. Summit House would later be known as High Finance before\nclosing for replacement by today's Ten 3.</p>\n<p>This might be confusing to today's Burqueños, as the main attraction at Sandia\nPeak would not begin construction until 1964. The &quot;Spectacular Sandia Peak\nChairlift Ride&quot; described in 1962 newspaper advertisements is the ski area's\nLift #1, a chairlift that is no longer in service and slated for replacement\nwith a mixed chair/gondola system in coming years. And yet, the restaurant and\nlift were operated by the &quot;Sandia Peak Ski and Aerial Tram Co.&quot; This somewhat\ncontradicts the &quot;official&quot; history of the Sandia Peak Tramway, but one would\nthink that Nordhaus and Abruzzo must have already had a bigger vision for access\nto the mountaintop.</p>\n<p>The full story of the Sandia Peak Tramway could occupy its own article, and\nperhaps it will, but the short version is this: Bob Nordhaus visited\nSwitzerland, where he learned that ski areas were being made more accessible by\nmeans of gondola lifts. He thought that the same scheme would work in\nAlbuquerque, and together with Abruzzo, mounted a long campaign for permitting\nand funding. The plan was ambitious and more than just a bit quixotic, but\nNordhaus and Abruzzo were both big personalities with extensive business\nconnections. In 1966, they opened what was then, and for many decades after, the\nlongest aerial tramway in the world. It runs from the northeast fringe of\nAlbuquerque directly up the western slope of the Sandias, delivering passengers\nto the very top of the ski area. The 3,819 foot climb, over 2.7 miles and just\ntwo towers, takes about fifteen minutes. It is far faster, of course, than the\ndrive around and up the east side. And yet, in the fashion of Albuquerque, one\nof its biggest impacts on our modern city is a road: Tramway Boulevard, or NM\n556, roughly one quarter of what was originally planned as a beltway highway\naround the city.</p>\n<p>While the tramway opened the steep western slope to tourism, attention to the\neast side was reinvigorated. The Albuquerque business community had continued to\nlobby the Forest Service for new and better roads, and as the tramway went in\nthe road boosters found success. The Forest Service circulated a draft plan that\ndelighted some and terrified others: a brand new loop¸ the Crest Loop, that\nwould replace the road from Balsam Glade to the crest and extend it straight up\nthe very spine of the mountain, allowing views down both sides, until coming\ndown the northern ridge to meet the existing Sandia Loop Road near Placitas.  It\nwould be a first-class skyline road, 24' wide pavement over almost exactly the\nroute of today's crest trail.</p>\n<hr />\n<p>Previous efforts at radical Sandia mountain road construction were held off by\nweather, funding, and war. For the Crest Loop, there was a new enemy: bighorn\nsheep.</p>\n<p>Rocky Mountain Bighorn Sheep don't appear to have ever been common in New\nMexico, but a small population around the Rio Grande Valley was completely wiped\nout by human impacts in the late 19th and early 20th centuries. Efforts to\nreintroduce bighorns started in the 1930s, with more translocated sheep in the\n1940s and 1960s. These populations struggled severely, and despite the attempts\nthere are no bighorn sheep in the Sandia Mountains today. Still, the population\nin the mid-'60s was likely the largest it would ever be, a hard-won victory that\nthe state was inclined to protect.</p>\n<p>Besides, Rachel Caron's <em>Silent Spring</em> was published in 1962, a landmark in the\nhistory of American environmentalism. The environmentalist movement wasn't as\npowerful as it would become, but it was certainly gaining momentum. Not only the\nstate Game and Fish Department opposed, but community groups like the New Mexico\nMountain Club stepped up to oppose development along the ridge.</p>\n<p>On Monday, August 8th, 1966, the Forest Service called a public hearing to be\nheld at the East Central Branch of Albuquerque National Bank. To an audience of\nbusinessmen and community groups, regional forester William D. Hurst presented\nthe official plan for the Sandias. The existing road from Balsam Glade up to\nthe crest, the Crest Scenic Highway, would be significantly reworked. The old\nalignment had over a dozen switchbacks, the new alignment only four. The wider,\nstraighter road would offer access to a completely new ski area at about the\nlocation of today's Capulin snow play area.</p>\n<p>The Crest Loop would not make it quite all the way to the crest, instead turning\nnorth a bit to the east (and below) the crest where a parking lot and turnout\narea formed the main attraction. The highway itself no longer followed the\nridge, an admission to the Bighorn Sheep interests, but instead paralleled it\nabout 1/4 mile to the east. About 2.5 miles north of the crest, the highway\nwould switch back and start it a descent down the eastern face, through Las\nHuertas canyon, to meet the Sandia Loop before Placitas.</p>\n<p>It was noted that, in the future, an additional road could be planned up the\ncanyon above Sandia Cave for yet a third road all the way up the eastern side.\nAt least you can't say they weren't ambitious.</p>\n<p>The 1966 Crest Loop plan was presented by the Forest Service in a rather\nmatter-of-fact way. Hurst told the press that he did not expect much objection,\nand apparently the presentation itself was well received. Still, Hurst's quip\nthat the plan presented &quot;the greatest good for the largest numbers of people&quot;\nhinted that it was not uncontroversial, as did the fact that every newspaper\narticle about the presentation made some reference to the &quot;hubbub.&quot;</p>\n<p>While the 1/4 mile shift away from the ridge had won the support of the state,\nit was not enough to please the New Mexico Wildlife and Conservation Association\nand gained only the most tacit support from the New Mexico Mountain Club, which\ndescribed their position to the papers as &quot;wait and see.&quot; They had time: the\nForest Service expected the project to take as much as ten years, even with\nsurveying work starting immediately.</p>\n<p>The Crest Loop was only part of a broader plan for Sandia recreation, one that\nresponded to Albuquerque's rapid mid-century population growth. There were more\nthan twice as many people in Albuquerque then as there had been before the war,\nfor example, and the Forest Service considered the nine picnic areas on the\nexisting road to be overused. The new crest loop would enable 200 acres of new\npicnic grounds</p>\n<p>For all of the promise of the new Crest Loop, there was a curious omission: the\nview from the crest. The road's alignment 1/4 mile off the crest meant that the\nhighest point on the road, the turnout with bathrooms and facilities, was on the\nother side of the ridge from Albuquerque. It would have views to the north and\nnortheast, but not at all to the west or southwest. In other words, you would no\nlonger be able to drive up to the crest and then look down on the city---getting\nthe same view offered by the old road would require a hike.</p>\n<p>This is a fascinating decision and one that, if you will allow me to\neditorialize, seems to reflect the Forest Service's process-focused approach to\nplanning. The original Crest Loop plan would have placed the road directly on\nthe ridge, probably providing one of the finest roadside views in the nation.\nWell, in actuality, there was always disagreement over the aesthetic merits of\nthe plan. The forest service had always denied any intent to clearcut trees to\nimprove sightlines, so it was likely that even the original ridgetop alignment\nwould have had trees blocking the view along much of the route. The Forest\nService even conceded to environmental groups by promising to keep the road off\nof the large clear bluff just north of the crest, the spot with the very best\npotential for automobile sightseeing.</p>\n<p>The final proposed alignment, downslope from the ridge, had the view completely\nblocked on the west... and it was away from the windswept, rocky western face,\ndecidedly in the forest. Even to the east, where the terrain dropped away\nprecipitously, you would be unlikely to see anything other than the forest right\nin front of you.</p>\n<p>Proponents said the Crest Loop would be a natural attraction like no other, with\na 360 degree perspective over the Rio Grande Valley and the High Plains.\nOpponents said it would be a &quot;green tunnel,&quot; so densely forested on both sides\nthat it might as well have been down in the valley for all the sightseeing it\nwould afford. They seem to have been right: as ultimately proposed, the\n&quot;skyline&quot; Crest Loop actually offered less of a view than the existing route.</p>\n<p>What it would offer is capacity. The road was designed for traffic, intended to\nsupport visitors to the new picnic areas, the expanding Sandia Peak Ski Area,\nand the new ski area yet to be named. The new ski area penciled out as 1,000\nacres, larger than Sandia Peak. A new snow play area was expected to attract\nthousands of non-skiing visitors. And parking---parking was a problem, the\nForest Service reported, with just 750 spaces at the bottom of the ski area.\nThe Forest Service intended to provide 800 spaces at the new snow play area, and\nthe bypassed switchbacks of the old crest road would themselves be repurposed as\nnew parking areas.</p>\n<hr />\n<p>As far as the Forest Service was concerned, the Crest Loop was a done deal. They\nhad already committed $600,000 a year for the next several years to fund surveys\nand planning, and expected more federal funding to match state support. And yet,\nas always, progress was slow. 1967 passed with little mention of the road.  In\n1968 the Albuquerque Chamber of Commerce must have been getting nervous, as they\npassed a resolution in support of its completion, for no reason in particular.</p>\n<p>In 1969, an interesting new proposal for the Crest Scenic Highway put it back\ninto the papers: a race. Albuquerque advertising firm Eicher and Associates\nproposed to one-up the Pikes Peak by hosting a Labor Day hill climb. The state\nHighway Commission approved the plan, but the race stalled when a State Police\ncaptain pointed out that state law forbid racing on public roads---and the\nAttorney General issued an opinion that the Highway Commission had no authority\nto grant an exception. Nothing ultimately came of the Sandia Peak Climb, or at\nleast, nothing other than a series of headlines and another round of objections\nto planned improvements. </p>\n<p>Central to the opponent's arguments was a disagreement over the nature of forest\nrecreation. The New Mexico Wildlife and Conservation Association advocated for\nthe establishment of wilderness areas covering much of the Sandias, precluding\nfurther development. Their proposal actually accommodated the Crest Loop by\nputting it just off of the edge of the wilderness area covering the western\nface, but Cibola National Forest Supervisor George Proctor was still hesitant:\n&quot;Proctor made clear he did not rule out wilderness use for the land, but only\nwanted time to weigh the proposals against possible other needs---as for future\nadditional tramways or recreation areas.&quot; Perhaps one tramway and two highways\nwas not enough; we can't know what the future will hold.</p>\n<p>The conservationists said exactly what you would expect:</p>\n<blockquote>\n<p>It would be nice to have complete access for large volumes of people---since\nso many have seen nothing like the top of the Sandias---said [NMCWA director]\nMcDonald, but when large volumes come, then the beauty of the area often\nceases to exist. <sup class=\"footnote-ref\" id=\"fnref-2\"><a href=\"#fn-2\">2</a></sup></p>\n</blockquote>\n<p>While the Forest Service had been quiet, it had not been entirely idle.\nSurveying for the route was nearly complete, and the Forest Service contracted\nthe first phase of the work: clearing trees for the new route, starting in the\nimmediate area of the crest. A bit over three miles of right of way were\nclearcut, mostly along the &quot;top&quot; of the road a quarter mile from the crest. The\nnew upper alignment of the existing road was cleared as well, wider switchbacks\nwell to the north and south of the current road.</p>\n<p>Almost immediately after the clearing, Forest Service funding for the project\nunexpectedly dried up. Work was discontinued until new funding for the project\ncould be secured, a delay that was not expected to last long but that fell at\nthe worst possible time.</p>\n<p>The Crest Loop had been abstract, seen only in the form of Forest Service\npresentations and hand-drawn newspaper illustrations. In that form, it had\nattracted considerable support from the business community and only muted\nobjections from conservationists. But then the trees fell. Acres of clearcut\nforest, so close to the ridge and so visible from the road, turned the highway\nplan into an eyesore. As they sat, unchanged, month after month, an eyesore\nturned into a scandal.</p>\n<hr />\n<p>By the summer of 1970, the Wildlife and Conservation Association, the New Mexico\nConservation Coordination, and the National Wildlife Federation sent letters\nopposing the project. State legislators became involved. There were accusations\nof treachery, with Forest Service employees allegedly lobbying business leaders\nto support the project while on the clock, and the district forester holding\nsecret meetings with state officials to coordinate.</p>\n<p>Over the following year, opposition stacked up. US Rep. Manuel Lujan, a\nprominent New Mexico politician, wrote to the director of the Forest Service\nwith his objections. NM Attorney General David Norvell joined with a press\nrelease asking the Forest Service to reconsider the plan. These objections were\nactually rather weak: Lujan, in particular, mostly just thought the proposed\nroad was too expensive, a waste of money considering that there was already a\nhighway connecting the same places. Even environmental groups tempered their\ncriticism, with at least two clarifying that they objected only to the highway\nalong the ridge, and not to improvements to the road between Balsam Glade and\nthe crest.</p>\n<p>The Forest Service's motivations can be difficult to understand. The whole Crest\nLoop plan had reportedly begun with a presidential directive to identify\nopportunities for new recreational facilities, and it had certainly had the\nstrong support of the business community in the 1960s. At the turn of the 1970s,\nthe situation had noticeably changed. Most press coverage of the project focused\non the opposition, and Albuquerque's business clubs had fallen silent, perhaps\naverse to the controversy. There's not much to say for the Forest Service's\nlobbying effort beyond inertia: as far as they were concerned, they had\ncommitted to the plan in 1966 and were now simply executing on an old decision.</p>\n<p>The federal government, once it gets into motion, does not easily change\ndirections.  For Forest Service staff, careers, or at least plans to climb the\ncorporate ladder, must have been staked on the success of the Crest Loop. Even\nas the budget escalated from $3 million to $3.5, then as high as $5 million, the\nForest Service remained committed to finishing what it had started. &quot;[Opponents]\nclaim the Forest Service won't heed their cries of distress,&quot; the <em>Albuquerque\nJournal</em> summarized. &quot;The Forest Service says the decision to build the road was\nmade a long time ago.&quot;</p>\n<p>In May of 1971, the controversy broke out into demonstrations. This was no\nVietnam war; anti-Crest Loop protests had a more whimsical quality. On Sunday\nthe 16th, around two hundred demonstrators went up the Crest Scenic Highway\nand gathered in the cleared path of the future road. The plan, originally,\nhad been to replant the clearing with new trees, a slow way of walking back\nthe road's likewise slow advance. This threat of minor vandalism was met by\na threat of minor reprisal when the Forest Service informed the press that\nunauthorized planting of trees in a National Forest could be charged as a\nmisdemeanor.</p>\n<p>The result, a mountaintop clash between Albuquerque's most motivated\nenvironmentalists and the force majeure of the Forest Service, must be one\nof the stranger moments in Albuquerque's environmental history.</p>\n<blockquote>\n<p>One group---lead by Dr. Gerald Bordin---advocated &quot;peaceful protest.&quot;\nAnother, lead partly by Jesse Cole, planted three symbolic trees.\nFinally, two individuals---Florencio Baca and Marvin Price---began a private\ndiscussion that turned into a simulated panel discussion on the negative\naspects of the proposed road....</p>\n<p>Few persons started the planned three-mile walk down the graded Ellis Loop\nin the 10,000-foot altitude. Several protesters, disillusioned for the lack\nof trees to plant, began to leave by noon.</p>\n<p>Bordin produced a cardboard replica of a pine tree, dissected by a highway,\nand placed it on the proposed road. &quot;This type of planting is legal,&quot; he\nsaid; and another protester, watching two others dig a hole for a tree a\nfew yards away, asked Bordin &quot;Where's your tree, man?&quot; <sup class=\"footnote-ref\" id=\"fnref-3\"><a href=\"#fn-3\">3</a></sup></p>\n</blockquote>\n<hr />\n<p>On the first day of 1970, president Richard Nixon signed the National\nEnvironmental Policy Act. Nixon was famously a mixed bag on environmental\nissues; his creation of the Environmental Protection Agency is one of the\nlargest single steps forward in the history of US conservation, but he also\npinched pennies to a degree that smothered many environmental programs. As\nit would turn out, the fate of the Crest Loop hinged on the interplay of\nthese two sides of Nixon.</p>\n<p>To satisfy its obligations under NEPA, the Forest Service completed an\nenvironmental impact assessment of the proposed Crest Road in 1973. It was\nnow almost five years since the clearing of part of the right of way, but\nthe only progress made had been on paper. Unsurprisingly, the impact\nassessment found the road to be feasible. &quot;The highway is completely on the\neast slope and won't even be able to be seen from Albuquerque,&quot; the forest\nsupervisor explained.</p>\n<p>The environmental analysis spurred another series of exchanges between the\nForest Service and environmental interests. The state Environmental Planning\nCommission filed comment, suggesting that the Crest Loop would better be\nreplaced by a system of two one-way roads at different altitudes. One thing\nthe EPC did agree on was the necessity that <em>something</em> be done. Like the\ngroups who had assured their support for improving the road to the crest in\nthe years before, the EPC recommended against taking no action. The existing\ncrest road was unsustainable, they found, and needed to be improved in some\nway.</p>\n<p>During the plant-in, one organizer suggested letters to the editor. Perhaps he\nwas heard, as letters in opposition stacked up during 1973. Frank Marquart wrote\nthat the highway would be good for General Motors and no one else. A letter\nfrom L. Graham got the simple headline &quot;Crest Road Not Necessary.&quot; Among the\ngrowing public protest, the gears of government were turning: the Bernalillo\nCounty Commission made a resolution asking the Forest Service to stop. </p>\n<p>Joe Whiton attended a hearing on the matter in Tijeras, leaving a <em>Journal</em>\nreporter with a memorable quote:</p>\n<blockquote>\n<p>The Crest Road is a juggernaut already aimed, the switch is on and it is\ngoing to be fired no matter what we say. I have a feeling it is going to\nhappen anyway and I don't think it should. <sup class=\"footnote-ref\" id=\"fnref-4\"><a href=\"#fn-4\">4</a></sup></p>\n</blockquote>\n<hr />\n<p>Despite the Forest Service's momentum, two significant roadblocks had arisen in\nthe Crest Loop plan: first, the Forest Service was having a hard time getting to\na final environmental impact statement on the project. Several drafts had been\ncirculated, and from what I can tell one was even published as final, although\nit only covered a portion of the work rather than the entirety. The National\nEnvironmental Policy Act has many problems and often fails to achieve its aims,\nbut it does have its virtues: while NEPA does not necessarily require agencies\nto listen to public feedback, it does require them to solicit it, and the\nhearings and comment periods that make up federal environmental policy gave\nthe Crest Loop's opponents a platform on which to organize.</p>\n<p>Second, there was President Nixon. Nixon had generally supported the Federal\nLands Highway Program, under which the Crest Loop now fell, but his efforts to\nreduce federal spending through impoundment quickly became controversial. A\nfight with Congress over changes to the federal highway funding model in 1972\nlead to a lapse in highway funding, a situation that became even more chaotic\nas Nixon specifically refused funding for a long list of highway grants. The\nfunding situation probably didn't kill the Crest Loop, but it delayed further\nprogress during the 1970s, contributing to both the sense of scandal over the\nlack of progress and to the opposition's developing power.</p>\n<p>In 1973, the Forest Service produced new draft environmental documents covering\nfour variant plans, which other than the no action alternative all involved some\nform of new highway. This was, as it turns out, the last gasp of the Crest Loop:\nin 1975, over a decade after planning first started, the Forest Service released\na new environmental impact statement covering the entire Sandia mountain\nrecreational plan. Its alternatives included new picnic grounds, bathrooms, and\ncampgrounds. It included various improvements to the Crest Scenic Highway. But\nmore important is what it did not include: any mention of the Crest Loop.</p>\n<p>In the following years, the Forest Service would release further environmental\nand planning documents on the remaining scope of work, which was only the\nimprovement of the road between Balsam Glade and the Crest. A 1976 impact\nstatement covered three alternatives: the first would use the area already\ncleared for realignment, the second would keep the old alignment, and the third\nwould finish realignment of the entire route, as included in the original Crest\nLoop plan. Based on the <em>Albuquerque Tribune's</em> count of public comments,\nBurqueños overwhelmingly favored the second option---keeping the existing route.\nWhile the road has been widened and resurfaced over the years, it remains on\nits original, winding route.</p>\n<hr />\n<p>In 1927, roads reached Sandia Crest. Today, just shy of one hundred years later,\nthe drive to the crest is essentially the same as this original route. It's all\npaved now, it's wider, and the curves has softened. It is still, by our modern\nstandards, a rough road. The biggest change from the long-ago Ellis Ranch Loop\nto today's forest highways is actually a loss: the reduction of NM 165 to a\nminor, unpaved road. One might say, then, that progress since 1927 has been\nbackwards. We are less ambitious than we once were.</p>\n<p>On the flip side, the ambitions of the mid-century are so difficult to square\nwith our modern sense of environmental preservation. The Forest Service dreamed,\nat times, of thousands of parking spaces, of cabins, a resort. We now value\nconservation over improvement, wilderness over access. It almost seems like it\nhas always been that way---but it hasn't. This is a modern idea in land\nmanagement, an innovation of the post-war era and the American environmental\nmovement.</p>\n<p>The old tensions between tourist promotion and wilderness preservation have\nnever gone away. In 2023, Mountain Capital Partners signed a joint venture\nwith the Sandia Peak Ski Company. The Sandia Peak Ski Area has barely opened\nfor the last five years; climate change has shortened the season so severely\nthat the Sandias can go all winter without enough snow to ski. Mountain\nCapital Partners how hopes, through artificial snowmaking, to bring the ski\narea back to life. Still, it's clear that snow will never be enough: ski areas\nare, in general, facing tough times.</p>\n<p>Sandia Peak Ski Company has developed an ambitious plan for a &quot;four season&quot;\nrecreational destination. It called for a mountain roller coaster, mountainbike\ntrails, a complete replacement of Lift #1. The mountain coaster has already been\nabandoned, having attracted more environmental controversy than the Forest\nService was prepared to handle.</p>\n<p>In aerial images, you can still clearly see the path of the Crest Loop, at least\nto the first switchback where 1968 clearing work ended. Some of the modern\ntrails follow the unused highway rights of way. They are incongruously described\nby in some Forest Service documents as firebreaks, a function that they do serve\nbut were never intended for. I get the impression that even some of the Forest\nService staff have forgotten the entire Crest Loop story. Well, it's one of many\nthings about the Sandias that have been forgotten.</p>\n<p>Ellis Ranch is now hardly remembered, up a canyon from a picnic area. It is once\nagain difficult to access, past the part of the former Ellis Loop that is still\npaved. The Crest Loop was canceled in its early stages, the notional second\nhighway was never even planned.</p>\n<p>But Ellis Ranch Loop Road is still there. Millions of people drive up it every\nyear. They look down on the city, and marvel at the view. I wonder how many\nrealize---that the climb started so long ago, and that it has still never been\nfinished. I think that it's better this way. A summit should always be an\nachievement, so easy to see, but so hard to reach. We get used to living in the\nshadows of mountains.</p>\n<div class=\"footnotes\">\n<ol>\n<li id=\"fn-1\">\n<p>Impassable is of course a subjective term. Last time I had it in mind to\nattempt NM 165 with snow on the ground, about two years ago, I started from the\ntop at Balsam Glade. At least, that was my plan... on arrival at Balsam Glade I\nfound a small crowd of people formed around an F-350 that had only gotten\nperhaps 50' down 165, a steep hill at that spot, before becoming unable to get\nback up. I think that a smaller vehicle would have fared better but this was an\nobstacle that did not seem likely to clear up quickly. I abandoned the attempt.<a class=\"footnote\" href=\"#fnref-1\">&#8617;</a></p></li>\n<li id=\"fn-2\">\n<p><em>Albuquerque Journal,</em> 1969-07-20 p. 37<a class=\"footnote\" href=\"#fnref-2\">&#8617;</a></p></li>\n<li id=\"fn-3\">\n<p><em>Albuquerque Journal,</em> 1971-05-16 p. 1<a class=\"footnote\" href=\"#fnref-3\">&#8617;</a></p></li>\n<li id=\"fn-4\">\n<p><em>Albuquerque Journal,</em> 1974-02-15 p. 45<a class=\"footnote\" href=\"#fnref-4\">&#8617;</a></p></li>\n</ol>\n</div>",
  "id": "https://computer.rip/2025-10-20-ascent-to-sandia-crest-2.html"
}