{
  "title": "It's cheaper to buy a new printer every month",
  "link": "https://idiallo.com/byte-size/cheaper-to-buy-a-new-printer-every-month?src=feed",
  "published": "Wed, 10 Dec 2025 01:26:12 GMT",
  "summary": "<p>It's the holiday season. My kids are doing all sorts of projects at school, this means we are doing a whole lot of printing. So I went online to look for the ink cartridge for our printer. I typed the printer name and model because who knows the ink cartridge number? I found our printer. And to my surprise, the printer only costs $64. </p>\n\n<p>What a time to be alive. I grew up in the 90s, those are not the numbers my father dealt with when we wasted paper on his printer. Buying a printer was a privilege. We dressed up nice, went to the computer store where we met with a salesperson who led us to an office where grown ups negotiated.</p>\n\n<div class=\"art-image\">\n    <img alt=\"$81.99 canon ink cartridge\" height=\"480\" src=\"https://cdn.idiallo.com/images/assets/daily/91/printer.jpg\" width=\"309\" />\n    <p><a href=\"https://www.officedepot.com/a/products/352475/Canon-PGI-280XLCLI-281-High-Yield/\">Office depot</a> (as of December 10th, 2025)</p>\n</div>\n\n<p>Now, it's only $64.99 and you can complete the transaction from the comfort of your phone. That's Printer + Ink, mind you. What an amazing deal. But what if you already have a printer and only want to replenish your ink? How much does that cost? For the compatible ink cartridges, you'll pay $81.99. Just for ink. </p>\n\n<div class=\"art-image\">\n    <img alt=\"$81.99 canon ink cartridge\" height=\"480\" src=\"https://cdn.idiallo.com/images/assets/daily/91/ink.jpg\" width=\"287\" />\n    <p><a href=\"https://www.officedepot.com/a/products/6132936/Canon-PIXMA-TR4720-Wireless-Inkjet-All/\">Office depot</a> (as of December 10th, 2025)</p>\n</div>\n\n<p>The ink itself is more expensive than ink + printer. </p>\n\n<p>OK, to be fair, the printer I took a screenshot of is on sale. The price was $64.99 until the sale was scheduled to end on Dec 6th. Then the price goes back up to $107. So this whole thing is just sensational writing to make Canon look bad, and to farm for engagement, right? Well, I waited until Dec 6th and checked again. Guess what? The printer is on sale again, with a new end sale date!</p>\n\n<p>I checked Amazon, Walmart, and Newegg. This printer is always on sale. </p>\n\n<div class=\"art-video\">\n <video controls=\"controls\" loop=\"loop\" preload=\"auto\">\n    <source src=\"https://cdn.idiallo.com/images/assets/daily/91/ron-swanson-throws-out-his-computer.mp4\" />\n </video>\n</div>\n\n<p>So there you go. Don't buy ink again. If you want to save $17, toss that one month old printer in the trash whenever you run low on ink. Buy a brand new one with fresh ink cartridges.</p>",
  "id": "https://idiallo.com/byte-size/cheaper-to-buy-a-new-printer-every-month?src=feed"
}