{
  "title": "Interesting BiCMOS circuits in the Pentium, reverse-engineered",
  "link": "http://www.righto.com/2025/01/pentium-reverse-engineering-bicmos.html",
  "published": "2025-01-21T08:48:00.000-08:00",
  "summary": "<p>Intel released the powerful Pentium processor in 1993, establishing a long-running brand of processors.\nEarlier, I <a href=\"https://www.righto.com/2025/01/pentium-floating-point-ROM.html\">wrote</a> about the\nROM in the Pentium's floating point unit that holds constants such as &pi;.\nIn this post, I'll look at some interesting circuits associated with this ROM.\nIn particular, the circuitry is implemented in BiCMOS, a process that combines bipolar transistors with\nstandard CMOS logic.</p>\n<p>The photo below shows the Pentium's thumbnail-sized silicon die under a microscope.\nI've labeled the main functional blocks; the floating point unit is in the lower right with the\nconstant ROM highlighted at the bottom.\nThe various parts of the floating point unit form horizontal stripes.\nData buses run vertically through the\nfloating point unit, moving values around the unit.</p>\n<p><a href=\"https://static.righto.com/images/pentium-rom-out/pentium-labeled.jpg\"><img alt=\"Die photo of the Intel Pentium processor with the floating point constant ROM highlighted in red. Click this image (or any other) for a larger version.\" class=\"hilite\" height=\"627\" src=\"https://static.righto.com/images/pentium-rom-out/pentium-labeled-w600.jpg\" title=\"Die photo of the Intel Pentium processor with the floating point constant ROM highlighted in red. Click this image (or any other) for a larger version.\" width=\"600\" /></a><div class=\"cite\">Die photo of the Intel Pentium processor with the floating point constant ROM highlighted in red. Click this image (or any other) for a larger version.</div></p>\n<p>The diagram below shows how the circuitry in this post forms part of the Pentium.\nZooming in to the bottom of the chip shows the constant ROM, holding 86-bit words:\nat the left,  the exponent section provides 18 bits. At the right, the wider significand section provides 68 bits.\nBelow that, the diagram zooms in on the subject of this article: one of the 86 identical multiplexer/driver circuits that provides the output from the ROM.\nAs you can see, this circuit is a microscopic speck in the chip.</p>\n<p><a href=\"https://static.righto.com/images/pentium-rom-out/rom-zoom.jpg\"><img alt=\"Zooming in on the constant ROM's driver circuits at the top of the ROM.\" class=\"hilite\" height=\"574\" src=\"https://static.righto.com/images/pentium-rom-out/rom-zoom-w700.jpg\" title=\"Zooming in on the constant ROM's driver circuits at the top of the ROM.\" width=\"700\" /></a><div class=\"cite\">Zooming in on the constant ROM's driver circuits at the top of the ROM.</div></p>\n<h2>The layers</h2>\n<p>In this section, I'll show how the Pentium is constructed from layers.\nThe bottom layer of the chip consists of transistors fabricated on the silicon die.\nRegions of silicon are doped with impurities to change the electrical properties; these regions appear\npinkish in the photo below, compared to the grayish undoped silicon.\nThin polysilicon wiring is formed on top of the silicon. Where a polysilicon line crosses doped silicon, a transistor is\nformed; the polysilicon creates the transistor's gate.\nMost of these transistors are NMOS and PMOS transistors, but there is a bipolar transistor near the upper right,\nthe large box-like structure.\nThe dark circles are contacts, regions where the metal layer above is connected to the polysilicon or silicon to\nwire the circuits together.</p>\n<p><a href=\"https://static.righto.com/images/pentium-rom-out/poly.jpg\"><img alt=\"The polysilicon and silicon layers form the Pentium's transistors. This photo shows part of the complete circuit.\" class=\"hilite\" height=\"362\" src=\"https://static.righto.com/images/pentium-rom-out/poly-w350.jpg\" title=\"The polysilicon and silicon layers form the Pentium's transistors. This photo shows part of the complete circuit.\" width=\"350\" /></a><div class=\"cite\">The polysilicon and silicon layers form the Pentium's transistors. This photo shows part of the complete circuit.</div></p>\n<p>The Pentium has three layers of metal wiring. The photo below shows the bottom layer, called M1. \nFor the most part, this layer of metal connects the transistors into various circuits, providing wiring over\na short distance.\nThe photos in this section show the same region of the chip, so you can match up features between the photos.\nFor instance, the contacts below (black circles) match the black circles above, showing how this metal\nlayer connects to the silicon and polysilicon circuits.\nYou can see some of the silicon and polysilicon in this image, but most of it is hidden by the metal.</p>\n<p><a href=\"https://static.righto.com/images/pentium-rom-out/m1.jpg\"><img alt=\"The Pentium's M1 metal layer is the bottom metal layer.\" class=\"hilite\" height=\"362\" src=\"https://static.righto.com/images/pentium-rom-out/m1-w350.jpg\" title=\"The Pentium's M1 metal layer is the bottom metal layer.\" width=\"350\" /></a><div class=\"cite\">The Pentium's M1 metal layer is the bottom metal layer.</div></p>\n<p>The M2 metal layer (below) sits above the M1 wiring. \nIn this part of the chip, the M2 wires are horizontal.\nThe thicker lines are power and ground.\n(Because they are thicker, they have lower resistance and can provide the\nnecessary current to the underlying circuitry.)\nThe thinner lines are control signals.\nThe floating point unit is structured so functional blocks are horizontal, while data is transmitted vertically.\nThus, a horizontal wire can supply a control signal to all the bits in a functional block.</p>\n<p><a href=\"https://static.righto.com/images/pentium-rom-out/m2.jpg\"><img alt=\"The Pentium's M2 layer.\" class=\"hilite\" height=\"362\" src=\"https://static.righto.com/images/pentium-rom-out/m2-w350.jpg\" title=\"The Pentium's M2 layer.\" width=\"350\" /></a><div class=\"cite\">The Pentium's M2 layer.</div></p>\n<p>The M3 layer is the top metal layer in the Pentium. It is thicker, so it is better suited for the chip's main\npower and ground lines as well as long-distance bus wiring.\nIn the photo below, the wide line on the left provides power, while the wide line on the right provides ground.\nThe power and ground are distributed through wiring in the M2 and M1 layers until they are connected to the\nunderlying transistors.\nAt the top of the photo, vertical bus lines are visible; these extend for long distances through the floating\npoint unit.\nNotice the slightly longer line, fourth from the right. This line provides one bit of data from the ROM, provided\nby the circuitry described below.\nThe dot near the bottom is a via, connecting this line to a short wire in M2, connected to a wire in M1,\nconnected to the silicon of the output transistors.</p>\n<p><a href=\"https://static.righto.com/images/pentium-rom-out/m3.jpg\"><img alt=\"The Pentium's M3 metal layer. Lower layers are visible, but blurry due to the insulating oxide layers.\" class=\"hilite\" height=\"362\" src=\"https://static.righto.com/images/pentium-rom-out/m3-w350.jpg\" title=\"The Pentium's M3 metal layer. Lower layers are visible, but blurry due to the insulating oxide layers.\" width=\"350\" /></a><div class=\"cite\">The Pentium's M3 metal layer. Lower layers are visible, but blurry due to the insulating oxide layers.</div></p>\n<h2>The circuits for the ROM's output</h2>\n<p>The simplified schematic below shows the circuit that I reverse-engineered.\nThis circuit is repeated 86 times, once for each bit in the ROM's word.\nYou might expect the ROM to provide a single 86-bit word. However, to make the layout work better, the\nROM provides eight words in parallel. Thus, the circuitry must select one of the eight words with a multiplexer.\nIn particular, each of the 86 circuits has an 8-to-1 multiplexer to select one bit out of the eight.\nThis bit is then stored in a latch.\nFinally, a high-current driver amplifies the signal so it can be sent through a bus, traveling to a destination halfway across the floating\npoint unit.</p>\n<p><a href=\"https://static.righto.com/images/pentium-rom-out/schematic-overview.jpg\"><img alt=\"A high-level schematic of the circuit.\" class=\"hilite\" height=\"121\" src=\"https://static.righto.com/images/pentium-rom-out/schematic-overview-w400.jpg\" title=\"A high-level schematic of the circuit.\" width=\"400\" /></a><div class=\"cite\">A high-level schematic of the circuit.</div></p>\n<p>I'll provide a quick review of MOS transistors before I explain the circuitry in detail.\nCMOS circuitry uses two types of transistors&mdash;PMOS and NMOS&mdash;which are similar but also opposites.\nA PMOS transistor is turned on by a <em>low</em> signal on the gate, while an NMOS transistor is turned on by a\n<em>high</em> signal on the gate; the PMOS symbol has an inversion bubble on the gate.\nA PMOS transistor works best when pulling its output <em>high</em>, while an NMOS transistor works best when pulling\nits output <em>low</em>.\nCMOS circuitry normally uses the two types of MOS transistors in a Complementary fashion to implement logic gates, working together.\nWhat makes the circuits below interesting is that they often use NMOS and PMOS transistors independently.</p>\n<p><a href=\"https://static.righto.com/images/pentium-rom-out/pmos-nmos.jpg\"><img alt=\"The symbol for a PMOS transistor and an NMOS transistor.\" class=\"hilite\" height=\"103\" src=\"https://static.righto.com/images/pentium-rom-out/pmos-nmos-w250.jpg\" title=\"The symbol for a PMOS transistor and an NMOS transistor.\" width=\"250\" /></a><div class=\"cite\">The symbol for a PMOS transistor and an NMOS transistor.</div></p>\n<p>The detailed schematic below shows the circuitry at the transistor and inverter level.\nI'll go through each of the components in the remainder of this post. </p>\n<p><a href=\"https://static.righto.com/images/pentium-rom-out/detailed-schematic.jpg\"><img alt=\"A detailed schematic of the circuit. Click for a larger version.\" class=\"hilite\" height=\"246\" src=\"https://static.righto.com/images/pentium-rom-out/detailed-schematic-w700.jpg\" title=\"A detailed schematic of the circuit. Click for a larger version.\" width=\"700\" /></a><div class=\"cite\">A detailed schematic of the circuit. Click for a larger version.</div></p>\n<p>The ROM is constructed as a grid: at each grid point, the ROM can have a transistor for a 0 bit, or no transistor\nfor a 1 bit. Thus, the data is represented by the transistor pattern.\nThe ROM holds 304 constants so there are 304 potential transistors associated with each bit\nof the output word.\nThese transistors are organized in a 38&times;8 grid. To select a word from the ROM, a select line activates\none group of eight potential transistors.\nEach transistor is connected to ground, so the transistor (if present) will pull the associated line low, for a 0 bit.\nNote that the ROM itself consists of only NMOS transistors, making it half the size of a truly CMOS implementation.\nFor more information on the structure and contents of the ROM, see my <a href=\"https://www.righto.com/2025/01/pentium-floating-point-ROM.html\">earlier article</a>.</p>\n<p><a href=\"https://static.righto.com/images/pentium-rom-out/rom.jpg\"><img alt=\"The ROM grid and multiplexer.\" class=\"hilite\" height=\"320\" src=\"https://static.righto.com/images/pentium-rom-out/rom-w400.jpg\" title=\"The ROM grid and multiplexer.\" width=\"400\" /></a><div class=\"cite\">The ROM grid and multiplexer.</div></p>\n<p>A ROM transistor can pull a line low for a 0 bit, but how does the line get pulled high for a 1 bit?\nThis is accomplished by a precharge transistor on each line. Before a read from the ROM, the precharge\ntransistors are all activated, pulling the lines high.\nIf a ROM transistor is present on the line, the line will next be pulled low, but otherwise it will remain high\ndue to the capacitance on the line.</p>\n<p>Next, the multiplexer above selects one of the 8 lines, depending on which word is being accessed.\nThe multiplexer consists of eight transistors. One transistor is activated by a select line, allowing the ROM's\nsignal to pass through. The other seven transistors are in the off state, blocking those ROM signals.\nThus, the multiplexer selects one of the 8 bits from the ROM.</p>\n<p>The circuit below is the \"keeper.\"\nAs explained above, each ROM line is charged high before reading the ROM. However, this charge can fade away.\nThe job of the keeper is to keep the multiplexer's output high until it is pulled low.\nThis is implemented by an inverter connected to a PMOS transistor.\nIf the signal on the line is high, the PMOS transistor will turn on, pulling the line high.\n(Note that a PMOS transistor is turned on by a low signal, thus the inverter.)\nIf the ROM pulls the line low, the transistor will turn off and stop pulling the line high.\nThis transistor is very weak, so it is easily overpowered by the signal from the ROM.\nThe transistor on the left ensures that the line is high at the start of the cycle.</p>\n<p><a href=\"https://static.righto.com/images/pentium-rom-out/keeper.jpg\"><img alt=\"The keeper circuit.\" class=\"hilite\" height=\"134\" src=\"https://static.righto.com/images/pentium-rom-out/keeper-w250.jpg\" title=\"The keeper circuit.\" width=\"250\" /></a><div class=\"cite\">The keeper circuit.</div></p>\n<p>The diagram below shows the transistors for the keeper. The two transistors on the left implement a standard\nCMOS inverter. \nOn the right, note the weak transistor that holds the line high.\nYou might notice that the weak transistor looks larger and wonder why that makes the transistor weak rather than\nstrong.\nThe explanation is that the transistor is large in the \"wrong\" dimension.\nThe current capacity of an MOS transistor is proportional to the width/length ratio of its gate.\n(Width is usually the long dimension and length is usually the skinny dimension.)\nThe weak transistor's length is much larger than the other transistors, so the W/L ratio is smaller and the transistor is weaker.\n(You can think of the transistor's gate as a bridge between its two sides. A wide bridge with many lanes lets\nlots of traffic through. However, a long, single-lane bridge will slow down the traffic.)</p>\n<p><a href=\"https://static.righto.com/images/pentium-rom-out/keeper-diagram.jpg\"><img alt=\"The silicon implementation of the keeper.\" class=\"hilite\" height=\"232\" src=\"https://static.righto.com/images/pentium-rom-out/keeper-diagram-w300.jpg\" title=\"The silicon implementation of the keeper.\" width=\"300\" /></a><div class=\"cite\">The silicon implementation of the keeper.</div></p>\n<p>Next, we come to the latch, which remembers the value read from the ROM.\nThis latch will read its input when the load signal is high. When the load signal\ngoes low, the latch will hold its value.\nConceptually, the latch is implemented with the circuit below.\nA multiplexer selects the lower input when the load signal is active, passing the latch input through to the (inverted) output.\nBut when the load signal goes low, the multiplexer will select the top input, which is feedback of the value in the latch.\nThis signal will cycle through the inverters and the multiplexer, holding the value until a new value is loaded.\nThe inverters are required because the multiplexer itself doesn't provide any amplification; the signal would\nrapidly die out if not amplified by the inverters.</p>\n<p><a href=\"https://static.righto.com/images/pentium-rom-out/latch-overview.jpg\"><img alt=\"The implementation of the latch.\" class=\"hilite\" height=\"129\" src=\"https://static.righto.com/images/pentium-rom-out/latch-overview-w400.jpg\" title=\"The implementation of the latch.\" width=\"400\" /></a><div class=\"cite\">The implementation of the latch.</div></p>\n<p>The multiplexer is implemented with two CMOS switches, one to select each multiplexer input.\nEach switch is a pair of PMOS and NMOS transistors\nthat turn on together, allowing a signal to pass through. (See the bottom two transistors below.)<span id=\"fnref:comparison\"><a class=\"ref\" href=\"#fn:comparison\">1</a></span>\nThe upper circuit is trickier. Conceptually, it is an inverter feeding into the multiplexer's CMOS\nswitch. However, the order is switched so the switch feeds into the inverter. The result is not-exactly-a-switch\nand not-exactly-an-inverter, but the result is the same.\nYou can also view it as an inverter with power and ground that gets cut off when not selected.\nI suspect this implementation uses slightly less power than the straightforward implementation.</p>\n<p><a href=\"https://static.righto.com/images/pentium-rom-out/latch-schematic.jpg\"><img alt=\"The detailed schematic of the latch.\" class=\"hilite\" height=\"388\" src=\"https://static.righto.com/images/pentium-rom-out/latch-schematic-w280.jpg\" title=\"The detailed schematic of the latch.\" width=\"280\" /></a><div class=\"cite\">The detailed schematic of the latch.</div></p>\n<p>The most unusual circuit is the BiCMOS driver.\nBy adding a few extra processing steps to the regular CMOS manufacturing process, bipolar (NPN and PNP) transistors can be created.\nThe Pentium extensively used BiCMOS circuits since they reduced signal delays by up to 35%.\nIntel also used BiCMOS for the Pentium Pro, Pentium II, Pentium III, and Xeon processors.\nHowever, as chip voltages dropped, the benefit from bipolar transistors dropped too and BiCMOS was eventually abandoned.</p>\n<p><a href=\"https://static.righto.com/images/pentium-rom-out/driver.jpg\"><img alt=\"The BiCMOS driver circuit.\" class=\"hilite\" height=\"170\" src=\"https://static.righto.com/images/pentium-rom-out/driver-w250.jpg\" title=\"The BiCMOS driver circuit.\" width=\"250\" /></a><div class=\"cite\">The BiCMOS driver circuit.</div></p>\n<p>In the Pentium, BiCMOS drivers are used when signals must travel a long distance across the chip.\n(In this case, the ROM output travels about halfway up the floating point unit.)\nThese long wires have a lot of capacitance so a high-current driver circuit is needed and the NPN transistor\nprovides extra \"oomph.\"</p>\n<p>The diagram below shows how the driver is implemented. The NPN transistor is the large boxy structure in the\nupper right. \nWhen the base (B) is pulled high, current flows from the collector (C), pulling the emitter (E) high and thus\nrapidly pulling the output high.\nThe remainder of the circuit consists of three inverters, each composed of PMOS and NMOS transistors.\nWhen a polysilicon line crosses doped silicon, it creates a transistor gate, so each crossing corresponds to\na transistor. \nThe inverters use multiple transistors in parallel to provide more current; the transistor sources and/or drains overlap\nto make the circuitry more compact.</p>\n<p><a href=\"https://static.righto.com/images/pentium-rom-out/driver-diagram.jpg\"><img alt=\"This diagram shows the silicon and polysilicon for the driver circuit.\" class=\"hilite\" height=\"359\" src=\"https://static.righto.com/images/pentium-rom-out/driver-diagram-w700.jpg\" title=\"This diagram shows the silicon and polysilicon for the driver circuit.\" width=\"700\" /></a><div class=\"cite\">This diagram shows the silicon and polysilicon for the driver circuit.</div></p>\n<p>One interesting thing about this circuit is that each inverter is carefully designed to provide the desired current,\nwith a different current for a high output versus a low output.\nThe first inverter (purple boxes) has two PMOS transistors and two NMOS transistors, so it is a regular inverter,\nbalanced for high and low outputs. (This inverter is conceptually part of the latch.)\nThe second inverter (yellow boxes) has three large PMOS transistors and one smaller NMOS transistor, so it has\nmore ability to pull the output high than low.\nThis transistor turns on the NPN transistor by providing a high signal to the base, so it needs more current\nin the high state.\nThe third inverter (green boxes) has one weak PMOS transistor and seven NMOS transistors, so it can pull its\noutput low strongly, but can barely pull its output high. \nThis transistor pulls the ROM output line low, so it needs enough current to drive the entire bus line.\nBut this transistor doesn't need to pull the output high&mdash;that's the job of the NPN transistor&mdash;so the PMOS transistor can be weak.\nThe construction of the weak transistor is similar to the keeper's weak transistor; its gate length is much larger than the other\ntransistors, so it provides less current.</p>\n<h2>Conclusions</h2>\n<p>The diagram below shows how the functional blocks are arranged in the complete circuit, from the ROM at the bottom to the\noutput at the top.\nThe floating point unit is constructed with a constant width for each bit&mdash;38.5 µm&mdash;so the circuitry is\ndesigned to fit into this width.\nThe layout of this circuitry was hand-optimized to fit as tightly as possible, \nIn comparison, much of the Pentium's circuitry was arranged by software using a <a href=\"https://www.righto.com/2024/07/pentium-standard-cells.html\">standard-cell approach</a>, which is\nmuch easier to design but not as dense. Since each bit in the floating point unit is repeated many times, hand-optimization\npaid off here.</p>\n<p><a href=\"https://static.righto.com/images/pentium-rom-out/overview.jpg\"><img alt=\"The silicon and polysilicon of the circuit, showing the functional blocks.\" class=\"hilite\" height=\"624\" src=\"https://static.righto.com/images/pentium-rom-out/overview-w450.jpg\" title=\"The silicon and polysilicon of the circuit, showing the functional blocks.\" width=\"450\" /></a><div class=\"cite\">The silicon and polysilicon of the circuit, showing the functional blocks.</div></p>\n<!--\nThis circuit illustrates the BiCMOS process,\ncombining bipolar transistors and CMOS circuitry,\nIntel used the BiCMOS process in its processors for a few years\nuntil shrinking feature sizes made it impractical.\nAlthough no longer used in processors, BiCMOS [lives on](https://bcicts.org/) in analog chips, where bipolar\ntransistors have many advantages.\n-->\n\n<p>This circuit contains 47 transistors. Since it is duplicated once for each bit, it has 4042 transistors in total,\na tiny fraction of the Pentium's 3.1 million transistors.\nIn comparison, the MOS 6502 processor has about 3500-4500 transistors, depending on how you count.\nIn other words, the circuit to select a word from the Pentium's ROM is about as complex as the entire 6502 processor.\nThis illustrates the dramatic growth in processor complexity described by Moore's law.</p>\n<p>I plan to write more about the Pentium so follow me on Bluesky (<a href=\"https://bsky.app/profile/righto.com\">@righto.com</a>) or \n<a href=\"https://www.righto.com/feeds/posts/default\">RSS</a> for updates. (I'm no longer on Twitter.)\nYou might enjoy reading about the <a href=\"https://www.righto.com/2024/08/pentium-navajo-fairchild-shiprock.html\">Pentium Navajo rug</a>.</p>\n<h2>Notes</h2>\n<div class=\"footnote\">\n<ol>\n<li id=\"fn:comparison\">\n<p>The 8-to-1 multiplexer and the latch's multiplexer use different switch implementations:\nthe first is built from NMOS transistors while the second is built from paired PMOS and NMOS transistors.\nThe reason is that NMOS transistors are better at pulling signals low, while PMOS transistors are better\nat pulling signals high.\nCombining the transistors creates a switch that passes low and high signals efficiently, which is useful\nin the latch. The 8-to-1 multiplexer, however, only needs to pull signals low (due to the precharging), so\nthe NMOS-only multiplexer works in this role.\n(Note that early NMOS processors like the 6502 and 8086 built multiplexers and pass-transistor logic\nout of solely NMOS. This illustrates that you can use NMOS-only switches with both logic levels, but\nperformance is better if you add PMOS transistors.)&#160;<a class=\"footnote-backref\" href=\"#fnref:comparison\" title=\"Jump back to footnote 1 in the text\">&#8617;</a></p>\n</li>\n</ol>\n</div>",
  "id": "tag:blogger.com,1999:blog-6264947694886887540.post-5364654464288584255"
}