{
  "title": "CommBank's AI boyfriend",
  "link": "https://hey.paris/posts/cba/",
  "published": "Tue, 12 Aug 2025 00:00:00 +0000",
  "summary": "<p><a href=\"https://commbank.com.au\">CBA</a> has been naughty, and too reliant on their <a href=\"https://www.abc.net.au/news/2025-07-29/commonwealth-bank-says-ai-behind-dozens-of-job-cuts/105586312\">AI boyfriend</a>. Here&rsquo;s what happened:</p>\n<ul>\n<li>A CBA customer contacted bank requesting contact details for <a href=\"https://secretlab.sg\">Secretlab</a> (a company that <em>is not</em> us, and makes chairs)</li>\n<li>CBA staff member queried ChatGPT (possibly via their own personal, unauthenticated access to ChatGPT) to obtain phone number for Secretlab (chairs)</li>\n<li>CBA staff disclosed the retrieved phone number to the requesting customer</li>\n<li>The retrieved phone number is a number belonging to one of the directors of <a href=\"https://secretlab.games\">Secret Lab</a> (a company that does <em>not</em> make chairs, and <em>is</em> us), a customer of CBA, and is used for our CBA account and our Director&rsquo;s CBA account</li>\n<li>Therefore, CBA disclosed customer <a href=\"https://www.commbank.com.au/support/privacy.html\">personal information</a> to another, unrelated customer, and trusted a third-party LLM (ChatGPT), accessed seemingly unauthenticated on the consumer ChatGPT platform, as a source for data to provide to another customer</li>\n<li>During investigation, CBA staff replicated the same ChatGPT query process, seemingly on a personal phone, again unauthenticated, and on the consumer ChatGPT platform:</li>\n</ul>\n<figure><img src=\"https://hey.paris/posts/cba/cba-muppet.png\" />\n</figure>\n\n<ul>\n<li>Signs indicate this might be routine practice amongst CBA staff</li>\n</ul>\n<p>Oh, and they gave out the phone number for us, Secret Lab (not chairs), to someone looking for Secretlab&rsquo;s (chairs) phone number. So, in the end of all this, they weren&rsquo;t even helpful. LLMs in a nutshell, really.</p>",
  "id": "https://hey.paris/posts/cba/"
}