{
  "title": "SSH agent extensions as an arbitrary RPC mechanism",
  "link": "https://mjg59.dreamwidth.org/69646.html",
  "published": "Wed, 12 Jun 2024 02:57:36 GMT",
  "summary": "A while back, I <a href=\"https://mjg59.dreamwidth.org/61232.html\">wrote about using the SSH agent protocol to satisfy WebAuthn requests</a>. The main problem with this approach is that it required starting the SSH agent with a special argument and also involved being a little too friendly with the implementation - things worked because I could provide an arbitrary public key and the implementation never validated that, but it would be legitimate for it to start doing so and then break everything. And it also only worked for keys stored on tokens that ssh supports - there was no way to extend this to other keystores on the client (such as the Secure Enclave on Macs, or TPM-backed keys on PCs). I wanted a better solution.<br /><br />It turns out that it was far easier than I expected. The ssh agent protocol is documented <a href=\"https://datatracker.ietf.org/doc/html/draft-miller-ssh-agent\">here</a>, and the interesting part is the extension support <a href=\"https://datatracker.ietf.org/doc/html/draft-miller-ssh-agent#name-extension-mechanism\">extension mechanism</a>. Basically, you can declare an extension and then just tunnel whatever you want over it. As before, my goto was the <a href=\"https://pkg.go.dev/golang.org/x/crypto/ssh/agent\">go ssh agent</a> package which conveniently implements both the client and server side of this. Implementing the local agent is trivial - look up SSH_AUTH_SOCK, connect to it, create a new agent client that can communicate with that by calling <a href=\"https://pkg.go.dev/golang.org/x/crypto/ssh/agent#NewClient\">NewClient</a>, and then implement the <a href=\"https://pkg.go.dev/golang.org/x/crypto/ssh/agent#ExtendedAgent\">ExtendedAgent</a> interface, create a new socket, and call <a href=\"https://pkg.go.dev/golang.org/x/crypto/ssh/agent#ServeAgent\">ServeAgent</a> against that. Most of the ExtendedAgent functions should simply call through to the original agent, with the exception of Extension(). Just add a case statement against extensionType, define some reasonably namespaced extension, and you're done.<br /><br />Now you need to use this agent. You probably don't want to use this for arbitrary hosts (agent forwarding should only be enabled for remote systems you trust, not arbitrary machines you connect to - if you enabled agent forwarding for github and github got compromised, github would be able to use any private keys loaded into your agent, and you probably don't want that). So the right approach is to add a Host entry to the ssh config with a ForwardAgent stanza pointing at the socket you created in your new agent. This way the configured subset of remote hosts will automatically talk to this new custom agent, while forwarding for anything else will still be at the user's discretion.<br /><br />For the remote end things are even easier. Look up SSH_AUTH_SOCK and call NewClient as before, and then simply call client.Extension(). Whatever you stick in the contents argument will simply end up being received at the client end. You now have a communication channel between a the remote system and the local client, and what you do with that is up to you. I'm using it to allow a remote system to obtain auth tokens from Okta and forward WebAuthn challenges that can either be satisfied via a local WebAuthn token or by passing the query off to Mac TouchID, but there's fundamentally no constraints whatsoever on what can be done here.<br /><br />(If you want to do this on Windows and still have everything work with existing clients you'll need to take <a href=\"https://mjg59.dreamwidth.org/67402.html\">this</a> into account - Windows didn't really do Unix sockets until recently so everything there is awful)<br /><br /><img alt=\"comment count unavailable\" height=\"12\" src=\"https://www.dreamwidth.org/tools/commentcount?user=mjg59&amp;ditemid=69646\" style=\"vertical-align: middle;\" width=\"30\" /> comments",
  "id": "https://mjg59.dreamwidth.org/69646.html"
}