{
  "title": "I built a timer I can’t fail to set",
  "link": "http://danieldelaney.net/timer/",
  "published": "Tue, 02 Dec 2025 00:00:00 +0000",
  "summary": "<p>Have you ever gotten to the end of a long work day and realized you’re no closer to your goals? I have.</p>\n\n<p>Sure, I was doing a lot of <em>stuff.</em> But I wasn’t pausing to ask whether I was doing the <em>right</em> stuff. Or whether my approach was working. Or if I was spending the right amount of time on it. My fingers were moving but I wasn’t really thinking.</p>\n\n<p>So I needed a reliable way to interrupt my “unproductive productivity” and actually think. The obvious solution was a timer.</p>\n\n<p>Unfortunately, if you use timers a lot, you learn to dismiss them reflexively. And it’s really easy to forget to set the next timer. A week later, I’d realize: “Hey, that timer idea really worked, I should get back to that.” And then I didn’t.</p>\n\n<p>So I built a new kind of timer. It does 2 unique things:</p>\n\n<ol>\n  <li>It asks what I’ll focus on.</li>\n  <li>It gradually blurs my screen if I don’t set a new timer.</li>\n</ol>\n\n<p>When it asks “What will you focus on?” I answer in a word or two, start the next timer, and keep working. Having to name my intention keeps me fully aware of my trajectory. If I’m in danger of drifting, it’s obvious. And if I avoid thinking for long enough, my screen starts getting harder to see.</p>\n\n<p><img alt=\"Intention\" class=\"no-shadow\" src=\"/images/intention.svg\" /></p>\n\n<p>If I’m making great progress on something that doesn’t require much thinking, I can set the timer for a longer duration, maybe 30 minutes. But if I’m working on something more open-ended, I might tighten the leash all the way down to 3 minutes. Then I can’t get off track.</p>\n\n<p>Unlike a regular timer, <strong>I can’t fail to set the next one.</strong> If I don’t answer it promptly, the screen gradually becomes less readable until I do. If I wanted to avoid answering, I’d have to make a conscious decision to close the app. I’d have to decide to be less productive. I never do.</p>\n\n<div class=\"centerfold\" style=\"background-position: center center;\"></div>\n\n<p>This small intervention has worked beautifully. Not only am I catching unproductive divergences earlier, I’m noticing fewer of them over time. It seems to be training me to do more and better thinking.</p>\n\n<p>It’s not a replacement for a journal. I love journaling, but that takes more than a few seconds, and there’s a lot of benefit to reflecting more frequently.</p>\n\n<p><img alt=\"Active timer\" src=\"/images/intention-active.jpg\" /></p>\n\n<p>If you’re running macOS, <a href=\"https://danieldelaney.net/intention/\">Intention is available here</a>. I use it every day, and I think it’s the superior way of working.</p>",
  "id": "http://danieldelaney.net/timer/"
}