{
  "title": "The end of AOL dialup",
  "link": "https://oldvcr.blogspot.com/2025/10/the-end-of-aol-dialup.html",
  "published": "2025-10-05T04:36:00.000-07:00",
  "summary": "America Online has ceased offering dialup access since first doing so in 1991 (<a href=\"/2023/06/o-brother-geobook-lets-get-thou-back-on.html\">using GeoWorks</a>), and presumably any systems attempting to dial in will no longer be able to make a connection.\n<p>\nWe actually had a fairly long history with AOL and its predecessors in our house. We got a copy of PlayNET as a door prize at the local Commodore computer club meeting (dunno where that went) and my folks initially signed up for AOL's C64-based predecessor, QuantumLink &mdash; which I was quickly banned from after they got the first monthly bill. However, when in the mid-1990s my dad decided we should be online again (I already was myself using the dialup at UC San Diego), I suggested AOL to them since it was the easiest approach. It covered the entire family: I used it on medical school away rotations when I didn't have a local POP number to call into the university, back then on <a href=\"/2022/10/refurb-weekend-powerbook-1400.html\">my PowerBook 1400</a>. In fact, the last time I used it was in July 2006, when I drove across the United States <a href=\"/2025/08/make-your-apple-ii-or-commodore-64.html\">from San Diego to Bangor</a> along <a href=\"http://www.floodgap.com/roadgap/6/\">US Highway 6</a>. Wi-Fi was certainly not universal at the time and neither was cell coverage, so it was the least difficult option to use when local network access wasn't available. Here's me logging in on the iBook G4 from Ely, Nevada.\n\n<div class=\"separator\" style=\"clear: both;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiCKI7dNJsPMNol-17nR5zcihmzKD9kacuNBlpA-F0e4Kb4ByawFCTcnAhIKF2MAzbGObF9VSLo9j1sWP2gQa4ORddVlloO59DIba1LMUPRDWs9Ej2hAS7QxzACe2AG9ebv-hM9FBqhqbDAhoRKGH7r6dX_kdy74zHSFGSC2zq5JIgVHKsI6LeFALa5QKY/s2048/01055.JPG\" style=\"display: block; padding: 1em 0; text-align: center;\"><img alt=\"\" border=\"0\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiCKI7dNJsPMNol-17nR5zcihmzKD9kacuNBlpA-F0e4Kb4ByawFCTcnAhIKF2MAzbGObF9VSLo9j1sWP2gQa4ORddVlloO59DIba1LMUPRDWs9Ej2hAS7QxzACe2AG9ebv-hM9FBqhqbDAhoRKGH7r6dX_kdy74zHSFGSC2zq5JIgVHKsI6LeFALa5QKY/s320/01055.JPG\" width=\"320\" /></a></div>\n\nYou can see the AOL login screen faintly on the iBook's LCD. The last time I remember using AOL was on the same trip from a later stay a few days later in Warren, Pennsylvania. I don't have any pictures of that, but I distinctly remember doing so, because it made uploading images to the road\"b\"log impractical due to the poor quality of the phone lines at the motel. Still, I could log in and read my E-mail from my servers in the apartment over SSH, so it achieved its purpose.\n<p>\nAlthough at least one <a href=\"https://github.com/erfg12/AOL_4.0_Emu\">client re-creation</a> exists, it would be more interesting to see someone develop a new AOL <em>server</em> using modern modem emulation tools that the AOL clients can talk to. Much as QuantumLink's server responses can now be simulated, facilitating <a href=\"https://quantumlink.net/\">a fan recreation</a>, and because some pieces of the old PlayNET and QLink architecture underlaid AOL, it should be possible to do the same. Although some work exists on AIM, the instant messenger component (I certainly remember plenty of unsolicited chat requests), the whole experience really ought to be preserved in some fashion because for at least a few years it was the most common way people connected to the Internet no matter its warts. However, as there's obviously no way to serial-snoop the real thing now, hopefully someone at Yahoo/Verizon can leak the source code or protocol description so it can be resurrected. Though I certainly see no reason to use the dialup service as anything other than a historical simulation now that we have hotspotting and ubiquitous Wi-Fi &mdash; and my parents cancelled their dialup account after they got cable Internet &mdash; I also point out that my mom still has the same AOL E-mail address she had back then, and it still does the job for her.",
  "id": "tag:blogger.com,1999:blog-8349470052336612452.post-7012013262726380909"
}