{
  "title": "Reverse engineering the mysterious Up-Data Link Test Set from Apollo",
  "link": "http://www.righto.com/2025/07/reverse-engineering-mysterious-up-data.html",
  "published": "2025-07-21T09:10:00.000-07:00",
  "summary": "<p>Back in 2021, a collector friend of ours was visiting a dusty warehouse in search of Apollo-era communications equipment.\nA box with NASA-style lights caught his eye&mdash;the \"AGC Confirm\" light suggested a connection\nwith the Apollo Guidance Computer.\nDisappointingly, the box was just an empty chassis and the circuit boards were all missing.\nHe continued to poke around the warehouse when, to his surprise, he found a bag on the other side of the warehouse\nthat contained the missing boards!\nAfter reuniting the box with its wayward circuit cards, he brought it to us:\ncould we make this undocumented unit work?</p>\n<p><a href=\"https://static.righto.com/images/updata/powered-up2.jpg\"><img alt=\"The Up-Data Link Confidence Test Set, powered up.\" class=\"hilite\" height=\"409\" src=\"https://static.righto.com/images/updata/powered-up2-w600.jpg\" title=\"The Up-Data Link Confidence Test Set, powered up.\" width=\"600\" /></a><div class=\"cite\">The Up-Data Link Confidence Test Set, powered up.</div></p>\n<p>A label on the back indicated that it is an \"Up-Data Link Confidence Test Set\", built by Motorola.\nAs the name suggests, the box was designed to test Apollo's Up-Data Link (UDL), a system that allowed digital commands to be sent up to the spacecraft.\nAs I'll explain in detail below, these commands allowed ground stations to switch spacecraft circuits on or off, interact with the Apollo Guidance Computer, or set the spacecraft's clock.\nThe Up-Data Link needed to be tested on the ground to ensure that its functions operated correctly.\nGenerating the test signals for the Up-Data Link and verifying its outputs was the responsibility of the Up-Data Link Confidence Test Set (which I'll call the Test Set for short)</p>\n<p>The Test Set illustrates how, before integrated circuits, complicated devices could be constructed from\nthumb-sized encapsulated modules.\nSince I couldn't uncover any documentation on these modules, I had to reverse-engineer them,\ndiscovering that different modules implemented everything from flip-flops and logic gates to opto-isolators and analog circuits.\nWith the help of a Lumafield 3-dimensional X-ray scanner,\nwe looked inside the modules and examined the discrete transistors, resistors, diodes, and other components mounted inside.</p>\n<p><a href=\"https://static.righto.com/images/updata/modules.jpg\"><img alt=\"Four of the 13-pin Motorola modules. These implement logic gates (2/2G &amp; 2/1G), lamp drivers (LD), more logic gates (2P/3G), and a flip-flop (LP FF). The modules have 13 staggered pins, ensuring that they can't be plugged in backward.\" class=\"hilite\" height=\"369\" src=\"https://static.righto.com/images/updata/modules-w400.jpg\" title=\"Four of the 13-pin Motorola modules. These implement logic gates (2/2G &amp; 2/1G), lamp drivers (LD), more logic gates (2P/3G), and a flip-flop (LP FF). The modules have 13 staggered pins, ensuring that they can't be plugged in backward.\" width=\"400\" /></a><div class=\"cite\">Four of the 13-pin Motorola modules. These implement logic gates (2/2G & 2/1G), lamp drivers (LD), more logic gates (2P/3G), and a flip-flop (LP FF). The modules have 13 staggered pins, ensuring that they can't be plugged in backward.</div></p>\n<p>Reverse-engineering this system&mdash;from the undocumented modules to the mess of wiring&mdash;was a challenge.\nMike found one NASA document that mentioned the Test Set, but the document was remarkably uninformative.<span id=\"fnref:useless-diagram\"><a class=\"ref\" href=\"#fn:useless-diagram\">1</a></span>\nMoreover, key components of the box were missing, probably removed for salvage years ago.\nIn this article, I'll describe how we learned the system's functionality,\nuncovered the secrets of the encapsulated modules,\nbuilt a system to automatically trace the wiring,\nand used the UDL Test Set in a large-scale re-creation of the Apollo communications system.</p>\n<h2>The Apollo Up-Data Link</h2>\n<p>Before describing the Up-Data Link Test Set, I'll explain the Up-Data Link (UDL) itself.\nThe Up-Data Link provided a mechanism for the Apollo spacecraft to receive digital commands from ground stations.\nThese commands allowed ground stations to control the Apollo Guidance Computer, turn equipment on or off,\nor update the spacecraft's clock.\nPhysically, the Up-Data Link is a light blue metal box with an irregular L shape, weighing almost 20 pounds.</p>\n<p><a href=\"https://static.righto.com/images/updata/updata-link.jpg\"><img alt=\"The Up-Data Link box.\" class=\"hilite\" height=\"300\" src=\"https://static.righto.com/images/updata/updata-link-w500.jpg\" title=\"The Up-Data Link box.\" width=\"500\" /></a><div class=\"cite\">The Up-Data Link box.</div></p>\n<p>The Apollo Command Module was crammed with boxes of electronics, from communication and navigation to power and sequencing.\nThe Up-Data Link was mounted above the AC power inverters, below the Apollo Guidance Computer, and to the left of the waste management system and urine bags.</p>\n<p><a href=\"https://static.righto.com/images/updata/updata-equipment-bay.jpg\"><img alt=\"The lower equipment bay of the Apollo Command Module. The Up-Data Link is highlighted in yellow. Click this image (or any other) for a larger version. From Command/Service Module Systems Handbook p212.\" class=\"hilite\" height=\"541\" src=\"https://static.righto.com/images/updata/updata-equipment-bay-w700.jpg\" title=\"The lower equipment bay of the Apollo Command Module. The Up-Data Link is highlighted in yellow. Click this image (or any other) for a larger version. From Command/Service Module Systems Handbook p212.\" width=\"700\" /></a><div class=\"cite\">The lower equipment bay of the Apollo Command Module. The Up-Data Link is highlighted in yellow. Click this image (or any other) for a larger version. From <a href=\"https://www.ibiblio.org/apollo/Documents/HSI-481260.pdf#page=212\">Command/Service Module Systems Handbook</a> p212.</div></p>\n<h3>Up-Data Link Messages</h3>\n<p>The Up-Data Link supported four types of messages:</p>\n<ul>\n<li>\n<p>Mission Control had direct access to the Apollo Guidance Computer (AGC) through the UDL,\ncontrolling the computer, keypress by keypress.\nThat is, each message caused the UDL to simulate a keypress on the Display/Keyboard (DSKY), the astronaut's interface\nto the computer.</p>\n</li>\n<li>\n<p>The spacecraft had a clock, called\nthe Central Timing Equipment or CTE, that tracked the elapsed time of the mission, from days to seconds.\nA CTE message could set the clock to a specified time.</p>\n</li>\n<li>\n<p>A system called Real Time Control (RTC) allowed the UDL to turn relays on or off, so some spacecraft systems to be\ncontrolled from the ground.<span id=\"fnref:relays\"><a class=\"ref\" href=\"#fn:relays\">2</a></span>\nThese 32 relays, mounted inside the Up-Data Link box, could do\neverything from illuminating an Abort light&mdash;indicating that Mission Control says to abort&mdash;to controlling the data tape recorder or the S-band radio.</p>\n</li>\n<li>\n<p>Finally, the UDL supported two test messages to \"exercise all process, transfer and program control logic\" in the UDL.</p>\n</li>\n</ul>\n<p>The diagram below shows the format of messages to the Up-Data Link.\nEach message consisted of 12 to 30 bits, depending on the message type.\nThe first three bits, the Vehicle Address, selected which spacecraft should receive the message.\n(This allowed messages to be directed to the Saturn V booster, the Command Module, or the Lunar Module.<span id=\"fnref:command-system\"><a class=\"ref\" href=\"#fn:command-system\">3</a></span>)\nNext, three System Address bits specified the spacecraft system to receive the message, corresponding to the four message types above.\nThe remaining bits supplied the message text.</p>\n<p><a href=\"https://static.righto.com/images/updata/message-format.jpg\"><img alt=\"Format of the messages to the Up-Data Link. From Telecommunication Systems Study Guide.\nNote that the vehicle access code uses a different sub-bit pattern from the rest of the message.\nThis diagram shows an earlier sub-bit encoding, not the encoding used by the Test Set.\" class=\"hilite\" height=\"260\" src=\"https://static.righto.com/images/updata/message-format-w500.jpg\" title=\"Format of the messages to the Up-Data Link. From Telecommunication Systems Study Guide.\nNote that the vehicle access code uses a different sub-bit pattern from the rest of the message.\nThis diagram shows an earlier sub-bit encoding, not the encoding used by the Test Set.\" width=\"500\" /></a><div class=\"cite\">Format of the messages to the Up-Data Link. From <a href=\"https://www.ibiblio.org/apollo/Documents/telecommunication_systems_study_guide.pdf#page=231\">Telecommunication Systems Study Guide</a>.\nNote that the vehicle access code uses a different sub-bit pattern from the rest of the message.\nThis diagram shows an earlier sub-bit encoding, not the encoding used by the Test Set.</div></p>\n<p>The contents of the message text depended on the message type.\nA Real Time Control (RTC) message had a six-bit value specifying the relay number as well as whether it should be turned off or on.\nAn Apollo Guidance Computer (AGC) message had a five-bit value specifying a key on the Display/Keyboard (DSKY).\nFor reliability, the message was encoded in 16 bits: the message, the message inverted, the message again, and a padding bit; any mismatching bits would trigger an error.\nA CTE message set the clock using four 6-bit values indicating seconds, minutes, hours, and\ndays.\nThe UDL processed the message by resetting the clock and then advancing the time by issuing the specified number of\npulses to the CTE to advance the seconds, minutes, hours, and days.\n(This is similar to setting a digital alarm clock by advancing the digits one at a time.)\nFinally, the two self test messages consisted of 24-bit patterns that would exercise the UDL's internal circuitry.\nThe results of the test were sent back to Earth via Apollo's telemetry system.</p>\n<p>For reliability, each bit transmitted to the UDL was replaced by five \"sub-bits\":\neach \"1\" bit was replaced with the sub-bit sequence \"01011\", and each \"0\" bit was replaced with the\ncomplement, \"10100\".<span id=\"fnref:sub-bits\"><a class=\"ref\" href=\"#fn:sub-bits\">4</a></span>\nThe purpose of the sub-bits was that any corrupted data would result in\nan invalid sub-bit code so corrupted messages could be rejected.\nThe Up-Data Link performed this validation by matching the input data stream against \"01011\" or \"10100\".\n(The vehicle address at the start of a message used a different sub-bit code, ensuring\nthat the start of the message was properly identified.)\nBy modern standards, sub-bits are an inefficient way of providing redundancy, since the message becomes five times larger.\nAs a consequence, the effective transmission rate was low: 200 bits per second.</p>\n<p>There was no security in the Up-Data Link messages, apart from the need for a large transmitter.\nOf the systems on Apollo, only the rocket destruct system&mdash;euphemistically called the Propellant Dispersion System&mdash;was cryptographically secure.<span id=\"fnref:destruct\"><a class=\"ref\" href=\"#fn:destruct\">5</a></span></p>\n<p>Since the Apollo radio system was analog, the digital sub-bits couldn't be transmitted from ground to space directly.\nInstead, a technique called phase-shift keying (PSK) converted the data into an audio signal.\nThis audio signal consists of a sine wave that is inverted to indicate a 0 bit versus a 1 bit;\nin other words, its phase is shifted by 180 degrees for a 0 bit.\nThe Up-Data Link box takes this audio signal as input and demodulates it to extract the digital message data.\n(Transmitting this audio signal from ground to the Up-Data Link required more steps that aren't relevant to the Test Set,\nso I'll describe them in a footnote.<span id=\"fnref:s-band\"><a class=\"ref\" href=\"#fn:s-band\">6</a></span>)</p>\n<h2>The Up-Data Link Test Set</h2>\n<p>Now that I've explained the Up-Data Link, I can describe the Test Set in more detail.\nThe purpose of the UDL Test Set is to test the Up-Data Link system.\nIt sends a message&mdash;as an audio signal&mdash;to the Up-Data Link box, implementing the message formatting, sub-bit encoding, and phase shift keying\ndescribed above.\nThen it verifies the outputs from the UDL to ensure that the UDL performed the correct action.</p>\n<p>Perhaps the most visible feature of the Test Set is the paper tape reader on the front panel: this reader\nis how the Test Set obtains messages to transmit.\nMessages are punched onto strips of paper tape, encoded as a sequence of 13 octal digits.<span id=\"fnref:paper-tape\"><a class=\"ref\" href=\"#fn:paper-tape\">7</a></span>\nAfter a message is read from paper tape, it is shown on the 13-digit display.\nThe first three digits are an arbitrary message number, while the remaining 10 octal digits denote the 30-bit message to send to the UDL.\nBased on the type of message, specified by the System Address digit,\nthe Test Set validates the UDL's response and indicates success or errors on the panel lights.</p>\n<p>I created the block diagram below to explain the architecture and construction of the Test Set (click for a larger view).\nThe system has 25 circuit boards, labeled A1 through A25;<span id=\"fnref:top-view\"><a class=\"ref\" href=\"#fn:top-view\">8</a></span> for the most part, they correspond to functional blocks in the diagram.</p>\n<p><a href=\"https://static.righto.com/images/updata/block-diagram3.jpg\"><img alt=\"My block diagram of the Up-Data Link Test Set. (Click for a larger image.)\" class=\"hilite\" height=\"737\" src=\"https://static.righto.com/images/updata/block-diagram3-w600.jpg\" title=\"My block diagram of the Up-Data Link Test Set. (Click for a larger image.)\" width=\"600\" /></a><div class=\"cite\">My block diagram of the Up-Data Link Test Set. (Click for a larger image.)</div></p>\n<p>The Test Set's front panel is dominated by its display of 13 large digits.\nIt turns out that the storage of these digits is the heart of the Test Set.\nThis storage (A3-A9) assembles the digits as they are read from the paper tape, circulates the bits for transmission, and\nprovides digits to the other circuits to select the message type and validate the results.\nTo accomplish this, the 13 digit circuits are configured as a 39-bit shift register.\nAs the message is read from the paper tape, its bits are shifted into the digit storage, right to left, and the\nmessage is shown on the display.\nTo send the message, the shift register is reconfigured so the 10 digits form a loop, excluding the message number.\nAs the bits cycle through the loop, the leftmost bit is encoded and transmitted.\nAt the end of the transmission, the digits have cycled back to their original positions, so the message can be\ntransmitted again if desired.\nThus, the shift-register mechanism both deserializes the message when it is read and serializes the message for transmission.</p>\n<p>The Test Set uses three boards (A15, A2, and A1) to expand the message with sub-bits and to encode the message into audio.\nThe first board converts each bit into five sub-bits.\nThe second board applies phase-shift keying (PSK) modulation, and the third board has filters to produce clean sine waves from the digital signals.</p>\n<!--\nSeveral boards generate control signals for the other boards.\nThe paper tape reader is controlled by board A18, while board A13 implements the higher-level state machine for reading and transmitting a digit.\nBoards A16, and A17 generate control signals based on the message type stored in digit 5.\n-->\n\n<p>On the input side, the Test Set receives signals from the Up-Data Link (UDL) box through round military-style connectors.\nThese input signals are buffered by boards A25, A22, A23, A10, and A24.\nBoard 15 verifies the input sub-bits by comparing them with the transmitted sub-bits.\nFor an AGC message, the computer signals are verified by board A14.\nThe timing (CTE) signals are verified by boards A20 and A21.\nThe UDL status (validity) signals are processed by board A12.\nBoard A11 implements a switching power supply to power the interface boards.</p>\n<p>You can see from the block diagram that the Test Set is complex and implements multiple functions.\nOn the other hand, the block diagram also shows that it takes a lot of 1960s circuitry to implement anything.\nFor instance, one board can only handle two digits, so the digit display alone requires seven boards.\nAnother example is the inputs, requiring a full board for two or three input bits.</p>\n<h2>Encapsulated modules</h2>\n<p>The box is built from modules that are somewhat like integrated circuits but contain discrete components.\nModules like these were used in the early 1960s before ICs caught on.\nEach module implements a simple function such as a flip-flop or buffer.\nThey were more convenient than individual components, since a module provided a ready-made function.\nThey were also compact, since the components were tightly packaged inside the module.</p>\n<p>Physically, each module has 13 pins: a row of 7 on one side and a row of 6 offset on the other side.\nThis arrangement ensures that a module cannot be plugged in backward.</p>\n<p><a href=\"https://static.righto.com/images/updata/module.jpg\"><img alt=\"A Motorola &quot;LP FF&quot; module. This module implements a J-K flip-flop. &quot;LP&quot; could indicate low performance, low power, or low propagation; the system also uses &quot;HP FF&quot; modules, which could be high performance.\" class=\"hilite\" height=\"257\" src=\"https://static.righto.com/images/updata/module-w400.jpg\" title=\"A Motorola &quot;LP FF&quot; module. This module implements a J-K flip-flop. &quot;LP&quot; could indicate low performance, low power, or low propagation; the system also uses &quot;HP FF&quot; modules, which could be high performance.\" width=\"400\" /></a><div class=\"cite\">A Motorola \"LP FF\" module. This module implements a J-K flip-flop. \"LP\" could indicate low performance, low power, or low propagation; the system also uses \"HP FF\" modules, which could be high performance.</div></p>\n<p>Reverse engineering these modules was difficult since they were encapsulated in plastic and the components were inaccessible.\nThe text printed on each module hinted at its function.\nFor example, the J-K flip-flop module above is labeled \"LP FF\".\nThe \"2/2G &amp; 2/1G\" module turned out to contain two NAND gates and two inverters (the 2G and 1G gates).\nA \"2P/3G\" module contains two pull-up resistors and two three-input NAND gates.\nOther modules provided special-purpose analog functions for the PSK modulation.</p>\n<p>I reverse-engineered the functions of the modules by applying signals and observing the results.\nConveniently, the pins are on 0.200\" spacing so I could plug modules into a standard breadboard.\nThe functions of the logic modules were generally straightforward to determine.\nThe analog modules were more difficult; for instance, the \"-3.9V\" module contains a -3.9-volt Zener diode, \nsix resistors, and three capacitors in complicated arrangements.</p>\n<p>To determine how the modules are constructed internally, we had a module X-rayed by John McMaster and another module X-rayed in three dimensions by Lumafield.\nThe X-rays revealed that modules were built with \"cordwood construction\", a common technique in the 1960s.\nThat is, cylindrical components were mounted between two boards, stacked parallel similar to a pile of wood logs.\nInstead of using printed-circuit boards, the leads of the components were welded to metal strips to provide the interconnections.</p>\n<p><a href=\"https://static.righto.com/images/updata/lumafield.jpg\"><img alt=\"A 3-D scan of the module showing the circuitry inside the compact package, courtesy of Lumafield. Two transistors are visible near the center.\" class=\"hilite\" height=\"334\" src=\"https://static.righto.com/images/updata/lumafield-w500.jpg\" title=\"A 3-D scan of the module showing the circuitry inside the compact package, courtesy of Lumafield. Two transistors are visible near the center.\" width=\"500\" /></a><div class=\"cite\">A 3-D scan of the module showing the circuitry inside the compact package, courtesy of Lumafield. Two transistors are visible near the center.</div></p>\n<p>For more information on these modules, see my articles <a href=\"https://www.righto.com/2022/08/lumafield-flip-flop.html\">Reverse-engineering a 1960s cordwood flip-flop module with X-ray CT scans</a> and \n<a href=\"https://www.righto.com/2022/06/x-ray-reverse-engineering-hybrid-module.html\">X-ray reverse-engineering a hybrid module</a>.\nYou can interact with the scan <a href=\"https://voyager.lumafield.com/project/afa60fd5-308d-41da-a0c6-14294af54338\">here</a>.</p>\n<h2>The boards</h2>\n<p>In this section, I'll describe some of the circuit boards and point out their interesting features.\nA typical board has up to 15 modules, arranged as five rows of three.\nThe modules are carefully spaced so that two boards can be meshed\nwith the components on one board fitting into the gaps on the other board.\nThus, a pair of boards forms a dense block.</p>\n<p><a href=\"https://static.righto.com/images/updata/sandwich.jpg\"><img alt=\"This photo shows how the modules of the two circuit boards are arranged so the boards can be packed together tightly.\" class=\"hilite\" height=\"370\" src=\"https://static.righto.com/images/updata/sandwich-w500.jpg\" title=\"This photo shows how the modules of the two circuit boards are arranged so the boards can be packed together tightly.\" width=\"500\" /></a><div class=\"cite\">This photo shows how the modules of the two circuit boards are arranged so the boards can be packed together tightly.</div></p>\n<p>Each pair of boards is attached to side rails and a mounting bracket, forming a unit.<span id=\"fnref2:top-view\"><a class=\"ref\" href=\"#fn:top-view\">8</a></span>\nThe bracket has ejectors to remove the board unit, since the backplane connectors grip the boards tightly.\nFinally, each bracket is labeled with the board numbers, the test point numbers, and the Motorola logo.\nThe complexity of this mechanical assembly suggests that Motorola had developed an integrated prototyping system around the circuit modules, prior to the Test Set.</p>\n<h3>Digit driver boards</h3>\n<p>The photo below shows a typical board, the digit driver board.\nAt the left, a 47-pin plug provides the connection between the board and the Test Set's backplane.\nAt the right, 15 test connections allow the board to be probed and tested while it is installed.\nThe board itself is a two-sided printed circuit board with gold plating.\nBoards are powered with +6V, -6V, and ground; the two red capacitors in the lower left filter the two voltages.</p>\n<p><a href=\"https://static.righto.com/images/updata/driver-board.jpg\"><img alt=\"Boards A4 through A9 are identical digit driver boards.\" class=\"hilite\" height=\"429\" src=\"https://static.righto.com/images/updata/driver-board-w600.jpg\" title=\"Boards A4 through A9 are identical digit driver boards.\" width=\"600\" /></a><div class=\"cite\">Boards A4 through A9 are identical digit driver boards.</div></p>\n<p>The digit driver is the most common board in the system, appearing six times.<span id=\"fnref:drivers\"><a class=\"ref\" href=\"#fn:drivers\">9</a></span>\nEach board stores two octal digits in a shift register and drives two digit displays on the front panel.\nSince the digits are octal, each digit requires three bits of storage, implemented with\nthree flip-flop modules connected as a shift register.\nIf you look closely, you can spot the six flip-flop modules, labeled \"LP FF\".</p>\n<p>The digits are displayed through an unusual technology: an edge-lit lightguide display.<span id=\"fnref:numerik\"><a class=\"ref\" href=\"#fn:numerik\">10</a></span>\nFrom a distance, it resembles a Nixie tube, but it uses 10 lightbulbs, one for each number value, with a plastic layer for each digit.\nEach plastic sheet has numerous dots etched in the shape of the corresponding number.\nOne sheet is illuminated from the edge, causing the dots in the sheet to light up and display that number.\nIn the photo below, you can see both the illuminated and the unilluminated dots.\nThe displays take 14 volts, but the box runs at 28 volts, so a board full of resistors on the front panel drops the voltage from 28 to 14, giving off noticeable heat in the process.</p>\n<p><a href=\"https://static.righto.com/images/updata/digit.jpg\"><img alt=\"A close-up of a digit in the Test Set, showing the structure of the edge-lit lightguide display.\" class=\"hilite\" height=\"309\" src=\"https://static.righto.com/images/updata/digit-w250.jpg\" title=\"A close-up of a digit in the Test Set, showing the structure of the edge-lit lightguide display.\" width=\"250\" /></a><div class=\"cite\">A close-up of a digit in the Test Set, showing the structure of the edge-lit lightguide display.</div></p>\n<p>For each digit position, the driver board provides eight drive signals, one for each bulb.\nThe drivers are implemented in \"LD\" modules.\nSince each LD module contains two drive transistors controlled by 4-input AND gates, a module supports two bulbs.\nThus, a driver board holds eight LD modules in total.\nThe LD modules are also used on other boards to drive the lights on the front panel.</p>\n<h3>Ring counters</h3>\n<p>The Test Set contains multiple counters to count bits, sub-bits, digits, states, and so forth.\nWhile a modern design would use binary counters, the Test Set is implemented with a circuit called a <em>ring counter</em> that optimizes the hardware.</p>\n<p>For instance, to count to ten, five flip-flops are arranged as a shift register so each flip-flop sends its output to the next one.\nHowever, the last flip-flop sends its <em>inverted</em> output to the first.\nThe result is that the counter will proceed: 10000, 11000, 11100, 11110, 11111 as 1 bits are shifted in at the left.\nBut after a 1 reaches the last bit, 0 bits will be shifted in at the left: 01111, 00111, 00011, 00001, and finally 0000.\nThus, the counter moves through ten states.</p>\n<p>Why not use a 4-bit binary counter and save a flip-flop? First, the binary counter requires additional logic to go from 9 back to 0.\nMoreover, acting on a particular binary value requires a 4-input gate to check the four bits.\nBut a particular value of a ring counter can be detected with a smaller 2-input gate by checking the bits on either side of the 0/1 boundary.\nFor instance, to detect a count of 3 (11<strong>10</strong>0), only the two highlighted bits need to be tested.\nThus, the decoding logic is much simpler for a ring counter, which is important when each gate comes in an expensive module.</p>\n<p>Another use of the ring counter is in the sub-state generator, counting out the five states.\nSince this ring counter uses three flip-flops, you might expect it to count to six.\nHowever, the first flip-flop gets one of its inputs from the second flip-flop, resulting in five states:\n000, 100, 110, 011, and 001, with the 111 state skipped.<span id=\"fnref:count-to-five\"><a class=\"ref\" href=\"#fn:count-to-five\">11</a></span>\nThis illustrates the flexibility of ring counters to generate arbitrary numbers of states.</p>\n<h3>The PSK boards</h3>\n<p>Digital data could not be broadcast directly to the spacecraft, so the data was turned into an audio signal using phase-shift keying (PSK).\nThe Test Set uses two boards (A1 and A2) to produce this signal.\nThese boards are interesting and unusual because they are analog, unlike the other boards in the Test Set.</p>\n<p>The idea behind phase-shift keying is to change the phase of a sine wave depending on the bit (i.e., sub-bit) value.\nSpecifically, a 2 kHz sine wave indicated a one bit, while the sine wave was inverted for a zero bit.\nThat is, a phase shift of 180º indicated a 0 bit.\nBut how do you tell which sine wave is original and which is flipped? The solution was to combine the information\nsignal with a 1 kHz reference signal that indicates the start and phase of each bit.\nThe diagram below shows how the bits 1-0-1 are encoded into the composite audio signal that\nis decoded by the Up-Data Link box.</p>\n<p><a href=\"https://static.righto.com/images/updata/modulation.jpg\"><img alt=\"The phase-shift keying modulation process. This encoded digital data into an audio signal for transmission to the Up-DataLink. Note that &quot;1 kc&quot; is 1 kilocycle, or 1 kilohertz in modern usage. From Apollo Digital Up-Data Link Description.\" class=\"hilite\" height=\"355\" src=\"https://static.righto.com/images/updata/modulation-w500.jpg\" title=\"The phase-shift keying modulation process. This encoded digital data into an audio signal for transmission to the Up-DataLink. Note that &quot;1 kc&quot; is 1 kilocycle, or 1 kilohertz in modern usage. From Apollo Digital Up-Data Link Description.\" width=\"500\" /></a><div class=\"cite\">The phase-shift keying modulation process. This encoded digital data into an audio signal for transmission to the Up-DataLink. Note that \"1 kc\" is 1 kilocycle, or 1 kilohertz in modern usage. From <a href=\"https://www.ibiblio.org/apollo/Documents/TM-X-1146-ApolloDigitalUpDataLinkDescription-Lenett.pdf#page=39\">Apollo Digital Up-Data Link Description</a>.</div></p>\n<p>The core of the PSK modulation circuit is a transformer with a split input winding.\nThe 2 kHz sine wave is applied to the winding's center tap.\nOne side of the winding is grounded (by the \"ø DET\" module) for a 0 bit, but the other side of the winding is grounded for a 1 bit.\nThis causes the signal to go through the winding in one direction for a 1 bit and the opposite direction for a 0 bit.\nThe transformer's output winding thus receives an inverted signal for a 0 bit, giving the 180º phase shift seen in the second waveform above.\nFinally, the board produces the composite audio signal by mixing in the reference signal through a potentiometer and the \"SUM\" module.<span id=\"fnref:psk\"><a class=\"ref\" href=\"#fn:psk\">12</a></span></p>\n<p><a href=\"https://static.righto.com/images/updata/board2.jpg\"><img alt=\"Board A2 is the heart of the PSK encoding. The black transformer selects the phase shift, controlled by the &quot;ø DET&quot; and &quot;ø DET D&quot; modules in front of it. The two central potentiometers  balance the components of the output signal.\" class=\"hilite\" height=\"289\" src=\"https://static.righto.com/images/updata/board2-w450.jpg\" title=\"Board A2 is the heart of the PSK encoding. The black transformer selects the phase shift, controlled by the &quot;ø DET&quot; and &quot;ø DET D&quot; modules in front of it. The two central potentiometers  balance the components of the output signal.\" width=\"450\" /></a><div class=\"cite\">Board A2 is the heart of the PSK encoding. The black transformer selects the phase shift, controlled by the \"ø DET\" and \"ø DET D\" modules in front of it. The two central potentiometers  balance the components of the output signal.</div></p>\n<p>Inconveniently, \nsome key components of the Test Set were missing; probably the most valuable components were salvaged when the box was scrapped.\nThe missing components included the power supplies and amplifiers on the back of the box, as well as parts from\nPSK board A1.\nThis board had ten white wires that had been cut, going to missing components labeled MP1, R2, L1, and L2.\nBy studying the circuitry, I determined that MP1 had been a 4-kHz oscillator that provided the master clock for the Test Set.\nR2 was simply a potentiometer to adjust signal levels.</p>\n<p><a href=\"https://static.righto.com/images/updata/board-a1-updated.jpg\"><img alt=\"Marc added circuitry to board A1 to replace the two missing filters and the missing oscillator. (The oscillator was used earlier to drive a clock from Soyuz.)\" class=\"hilite\" height=\"451\" src=\"https://static.righto.com/images/updata/board-a1-updated-w450.jpg\" title=\"Marc added circuitry to board A1 to replace the two missing filters and the missing oscillator. (The oscillator was used earlier to drive a clock from Soyuz.)\" width=\"450\" /></a><div class=\"cite\">Marc added circuitry to board A1 to replace the two missing filters and the missing oscillator. (The oscillator was used earlier to drive a clock from Soyuz.)</div></p>\n<p>But L1 and L2 were more difficult.\nIt took a lot of reverse-engineering before we determined that L1 and L2 were \nresonant filters to convert the digital waveforms to the sine waves needed for the PSK output.\nMarc used a combination of theory and trial-and-error to determine the inductor and capacitor values that produced a\nclean signal.\nThe photo above shows our substitute filters, along with a replacement oscillator.</p>\n<h3>Input boards</h3>\n<p>The Test Set receives signals from the Up-Data Link box under test and verifies that these signals are correct.\nThe Test Set has five input boards (A22 through A25) to buffer the input signals and convert them to digital levels.\nThe input boards also provide electrical isolation between the input signals and the Test Set, avoiding problems caused by\nground loops or different voltage levels.</p>\n<p>A typical input board is A22, which receives two input signals, supplied through coaxial cables.\nThe board buffers the signals with op-amps, and then produces a digital signal for use by the box.\nThe op-amp outputs go into \"1 SS\" isolation modules that pass the signal through to the box while ensuring isolation.\nThese modules are optocouplers, using an LED and a phototransistor to provide isolation.<span id=\"fnref:led\"><a class=\"ref\" href=\"#fn:led\">13</a></span>\nThe op-amps are powered by an isolated power supply.</p>\n<p><a href=\"https://static.righto.com/images/updata/board22.jpg\"><img alt=\"Board A22 handles two input signals. It has two op-amps and associated circuitry. Note the empty module positions; board A23 has these positions populated so it supports three inputs.\" class=\"hilite\" height=\"384\" src=\"https://static.righto.com/images/updata/board22-w450.jpg\" title=\"Board A22 handles two input signals. It has two op-amps and associated circuitry. Note the empty module positions; board A23 has these positions populated so it supports three inputs.\" width=\"450\" /></a><div class=\"cite\">Board A22 handles two input signals. It has two op-amps and associated circuitry. Note the empty module positions; board A23 has these positions populated so it supports three inputs.</div></p>\n<p>Each op-amp module is a Burr-Brown Model 1506 module,<span id=\"fnref:burr-brown\"><a class=\"ref\" href=\"#fn:burr-brown\">14</a></span> encapsulating a transistorized op-amp into a convenient 8-pin module.\nThe module is similar to an integrated-circuit op-amp, except it has discrete components inside and is considerably larger than an integrated circuit.\nBurr-Brown is <a href=\"https://www.ti.com/lit/ta/sszt411/sszt411.pdf?ts=1750913508757\">said</a> to have created the first solid-state op-amp in 1957, and started making op-amp modules around 1962.</p>\n<p>Board A24 is also an isolated input board, but uses different circuitry.\nIt has two modules that each contain four Schmitt triggers, circuits to sharpen up a noisy input.\nThese modules have the puzzling label \"-12+6LC\".\nEach output goes through a \"1 SS\" isolation module, as with the previous input boards.\nThis board receives the 8-bit \"validity\" signal from the Up-Data Link.</p>\n<h3>The switching power supply board</h3>\n<p>Board A11 is interesting: instead of sealed modules, it has a large green cube with numerous wires attached.\nThis board turned out to be a switching power supply that implements six dual-voltage power supplies.\nThe green cube is a transformer with 14 center-tapped windings connected to 42 pins.\nThe transformer ensures that the power supply's outputs are isolated.\nThis allows the op-amps on the input boards to remain electrically isolated from the rest of the Test Set.</p>\n<p><a href=\"https://static.righto.com/images/updata/board11.jpg\"><img alt=\"The switching power supply board is dominated by a large green transformer with many windings. The two black power transistors are at the front.\" class=\"hilite\" height=\"379\" src=\"https://static.righto.com/images/updata/board11-w500.jpg\" title=\"The switching power supply board is dominated by a large green transformer with many windings. The two black power transistors are at the front.\" width=\"500\" /></a><div class=\"cite\">The switching power supply board is dominated by a large green transformer with many windings. The two black power transistors are at the front.</div></p>\n<p>The power supply uses a design known as a <a href=\"https://en.wikipedia.org/wiki/Royer_oscillator\">Royer Converter</a>; the two transistors drive the transformer in a push-pull configuration.\nThe transistors are turned on alternately at high frequency, driven by a feedback winding.\nThe transformer has multiple windings, one for each output.\nEach center-tapped winding uses two diodes to produce a DC output, filtered by the large capacitors.\nIn total, the power supply has four ±7V outputs and two ±14V outputs to supply the input boards.</p>\n<p>This switching power supply is independent from the power supplies for the rest of the Test Set.\nOn the back of the box, we could see where power supplies and amplifiers had been removed.\nDetermining the voltages of the missing power supplies would have been a challenge.\nFortunately, the front of the box had test points with labels for the various voltages: -6, +6, and +28, so we knew what voltages were required.</p>\n<h2>The front panel</h2>\n<p>The front panel reveals many of the features of the Test Set.\nAt the top, lights indicate the success or failure of various tests.\n\"Sub-bit agree/error\" indicates if the sub-bits read back into the Test Set match the values sent.\n\"AGC confirm/error\" shows the results of an Apollo Guidance Computer message, while \"CTE confirm/error\" shows the results of a Central Timing Equipment message.\n\"Verif confirm/error\" indicates if the verification message from the UDL matches the expected value for a test message.\nAt the right, lights indicate the status of the UDL: standby, active, or powered off.</p>\n<p><a href=\"https://static.righto.com/images/updata/panel.jpg\"><img alt=\"A close-up of the Test Set's front panel.\" class=\"hilite\" height=\"386\" src=\"https://static.righto.com/images/updata/panel-w500.jpg\" title=\"A close-up of the Test Set's front panel.\" width=\"500\" /></a><div class=\"cite\">A close-up of the Test Set's front panel.</div></p>\n<p>In the middle, toggle switches control the UDL operation.\nThe \"Sub-bit spoil\" switch causes sub-bits to be occasionally corrupted for testing purposes.\n\"Sub-bit compare/override\" enables or disables sub-bit verification.\nThe four switches on the right control the paper tape reader.\nThe \"Program start\" switch is the important one: it causes the UDL to send one message (in \"Single\" mode) or multiple messages (in \"Serial\" mode).\nThe Test Set can stop or continue when an error occurs (\"Stop on error\" / \"Bypass error\").\nFinally, \"Tape advance\" causes messages to be read from paper tape, while \"Tape stop\" causes the UDL to re-use the current message rather than loading a new one.</p>\n<p>The UDL provides a verification code that indicates its status.\nThe \"Verification Return\" knob selects the source of this verification code:\nthe \"Direct\" position uses a 4-bit verification code, while\n\"Remote\" uses an 8-bit verification code.<span id=\"fnref:verification\"><a class=\"ref\" href=\"#fn:verification\">15</a></span></p>\n<p>At the bottom, \"PSK high/low\" selects the output level for the PSK signal from the Test Set.\n(Since the amplifier was removed from our Test Set, this switch has no effect.\nLikewise, the \"Power On / Off\" switch has no effect since the power supplies were removed. We power the Test Set\nwith an external lab supply.)\nIn the middle, 15 test points allow access to various signals inside the Test Set.\nThe round elapsed time indicator shows how many hours the Test Set has been running (apparently over 12 months of continuous operation).</p>\n<h2>Reverse-engineering the backplane</h2>\n<p>Once I figured out the circuitry on each board, the next problem was determining how the boards were connected.\nThe backplane consists of rows of 47-pin sockets, one for each board.\nDense white wiring runs between the sockets as well as to switches, displays, and connectors.\nI started beeping out the connections with a multimeter, picking a wire and then trying to find the other end.\nSome wires were easy since I could see both ends, but many wires disappeared into a bundle.\nI soon realized that manually tracing the wiring was impractically slow:\nwith 25 boards and 47 connections per board, brute-force testing of every pair of connections would require hundreds of thousands of checks.</p>\n<p><a href=\"https://static.righto.com/images/updata/backplane-view.jpg\"><img alt=\"The backplane wiring of the Test Set consisted of bundles of white wires, as shown in this view of the underside of the Test Set.\" class=\"hilite\" height=\"456\" src=\"https://static.righto.com/images/updata/backplane-view-w500.jpg\" title=\"The backplane wiring of the Test Set consisted of bundles of white wires, as shown in this view of the underside of the Test Set.\" width=\"500\" /></a><div class=\"cite\">The backplane wiring of the Test Set consisted of bundles of white wires, as shown in this view of the underside of the Test Set.</div></p>\n<p>To automate the beeping-out of connections, I built a system that I call <a href=\"https://github.com/shirriff/beepomatic\"><em>Beep-o-matic</em></a>.\nThe idea behind <em>Beep-o-matic</em> is to automatically find all the connections between two motherboard slots by plugging\ntwo special boards into the slots.\nBy energizing all the pins on the first board in sequence, a microcontroller can detect connected pins on the second board, revealing the wiring between the two slots.</p>\n<p>This system worked better than I expected, rapidly generating a list of connections.\nI still had to plug the Beep-o-matic boards into each pair of slots (about 300 combinations in total), but each scan took just a few seconds, so a full scan was practical.\nTo find the wiring to the switches and connectors, I used a variant of the process.\nI plugged a board into a slot and used a program to continuously monitor the pins for changes.\nI went through the various switch positions and applied signals to the connectors to find the associated connections.</p>\n<h2>Conclusions</h2>\n<p>I started reverse-engineering the Test Set out of curiosity: given an undocumented box made from mystery modules and\nmissing key components,\ncould we understand it? Could we at least get the paper tape reader to run and the lights to flash?\nIt was a tricky puzzle to figure out the modules and the circuitry, but eventually we could read a paper tape and\nsee the results on the display.</p>\n<p>But the box turned out to be useful.\nMarc has amassed a large and operational collection of Apollo communications hardware.\nWe use the UDL Test Set to generate realistic signals that we feed into Apollo's S-band communication system.\nWe haven't transmitted these signals to the Moon, but we have transmitted signals between antennas a few feet apart,\nreceiving them with a box called the S-band Transponder.\nMoreover, we have used the Test Set to control an Up-Data Link box, a CTE clock, and a\nsimulated Apollo Guidance Computer, reading commands from the paper tape and sending them through the complete communication path.\nIronically, the one thing we haven't done with the Test Set is use it to test the Up-Data Link in the way it is intended: connecting the UDL's outputs to the Test Set and checking the panel lights.</p>\n<p>From a wider perspective, the Test Set provides a glimpse of the vast scope of the Apollo program.\nThis complicated box was just one part of the test apparatus for one small part of Apollo's electronics.\nThink of the many different electronic systems in the Apollo spacecraft, and consider the\nenormous effort to test them all.\nAnd electronics was just a small part of Apollo alongside the engines, mechanical structures, fuel cells, and life support systems. \nWith all this complexity, it's not surprising that the Apollo program employed 400,000 people.</p>\n<p>For more information, the footnotes include a list of UDL documentation<span id=\"fnref:documentation\"><a class=\"ref\" href=\"#fn:documentation\">16</a></span> and <a href=\"https://www.youtube.com/@CuriousMarc/videos\">CuriousMarc</a>'s videos<span id=\"fnref:videos\"><a class=\"ref\" href=\"#fn:videos\">17</a></span>.\nFollow me on\nBluesky (<a href=\"https://bsky.app/profile/righto.com\">@righto.com</a>),\nMastodon (<a href=\"https://oldbytes.space/@kenshirriff\">@kenshirriff@oldbytes.space</a>),\nor <a href=\"http://www.righto.com/feeds/posts/default\">RSS</a>.\n(I've given up on Twitter.)\nI worked on this project with CuriousMarc, Mike Stewart, and Eric Schlapfer.\nThanks to <a href=\"https://www.mcmaster.tech/about\">John McMaster</a> for X-rays, thanks to <a href=\"https://www.lumafield.com/\">Lumafield</a> for the CT scans, and thanks to Marcel for providing the box.</p>\n\n<h2>Notes and references</h2>\n<div class=\"footnote\">\n<ol>\n<li id=\"fn:useless-diagram\">\n<p>Mike found a NASA document\n<a href=\"https://www.ibiblio.org/apollo/Documents/g14-900708c_vol2_functional_schematics_sc-008_sesl.pdf#page=82\">Functional Integrated System Schematics</a> that includes \"Up Data Link GSE/SC Integrated Schematic Diagram\".\nUnfortunately, this was not very helpful since the diagram merely shows the Test Set as a rectangle with one wire in and one wire out.\nThe remainder of the diagram (omitted) shows that the output line passes through a dozen boxes (modulators, switches, amplifiers,\nand so forth) and then enters the UDL onboard the Spacecraft Command Module.\nAt least we could confirm that the Test Set was part of the functional integrated testing of the UDL.</p>\n<p><a href=\"https://static.righto.com/images/updata/nasa-diagram.jpg\"><img alt=\"Detail from &quot;Up Data Link GSE/SC Integrated Schematic Diagram&quot;, page GT3.\" class=\"hilite\" height=\"209\" src=\"https://static.righto.com/images/updata/nasa-diagram-w500.jpg\" title=\"Detail from &quot;Up Data Link GSE/SC Integrated Schematic Diagram&quot;, page GT3.\" width=\"500\" /></a><div class=\"cite\">Detail from \"Up Data Link GSE/SC Integrated Schematic Diagram\", page GT3.</div></p>\n<p>Notably, this diagram has the Up-Data Link Confidence Test Set denoted with \"2A17\".\nIf you examine the photo of the Test Set at the top of the article, you can see that the physical box has a Dymo label \"2A17\", confirming that this is the same box.&#160;<a class=\"footnote-backref\" href=\"#fnref:useless-diagram\" title=\"Jump back to footnote 1 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:relays\">\n<p>The table below lists the functions that could be performed by sending a \"realtime command\" to the Up-Data Link\nto activate a relay.\nThe crew could reset any of the relays except for K1-K5 (Abort Light A and Crew Alarm).</p>\n<p><a href=\"https://static.righto.com/images/updata/realtime-command-list.jpg\"><img alt=\"The functions controlled by the relays. Adapted from Command/Service Module Systems Handbook.\" class=\"hilite\" height=\"527\" src=\"https://static.righto.com/images/updata/realtime-command-list-w550.jpg\" title=\"The functions controlled by the relays. Adapted from Command/Service Module Systems Handbook.\" width=\"550\" /></a><div class=\"cite\">The functions controlled by the relays. Adapted from <a href=\"https://www.ibiblio.org/apollo/Documents/HSI-481260.pdf#page=64\">Command/Service Module Systems Handbook</a>.</div></p>\n<p>A message selected one of 32 relays and specified if the relay should be turned on or off.\nThe relays were magnetic latching relays, so they stayed in the selected position even when de-energized.\nThe relay control also supported \"salvo reset\": four commands to reset a bank of relays at once.&#160;<a class=\"footnote-backref\" href=\"#fnref:relays\" title=\"Jump back to footnote 2 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:command-system\">\n<p>The Saturn V booster had a system for receiving commands from the ground, closely related to the Up-Data Link, but with some differences.\nThe Saturn V system used the same Phase-Shift Keying (PSK) and 70 kHz subcarrier as the Up-Data Link, but the frequency of the S-band signal was different for Saturn V (2101.8 MHz).\n(Since the Command Module and the booster use separate frequencies, the use of different addresses in the up-data messages was somewhat redundant.)\nBoth systems used sub-bit encoding.\nBoth systems used three bits for the vehicle address, but the remainder of the Saturn message was different, consisting of 14 bits for the decoder address, and 18 bits for message data.\nA typical message for the Launch Vehicle Digital Computer (LVDC) includes a 7-bit command followed by the 7 bits inverted for error detection.\nThe command system for the Saturn V was located in the Instrument Unit, the ring containing most of the electronic systems that was mounted at the top of the rocket, below the Lunar Module.\nThe command system is described in <a href=\"https://www.ibiblio.org/apollo/Documents/UAH-19650801-AstrionicsSystemHandbookSaturnLaunchVehicles.pdf#page=166\">Astrionics System Handbook</a> section 6.2.</p>\n<p><a href=\"https://static.righto.com/images/updata/iu-command-decoder.jpg\"><img alt=\"The Saturn Command Decoder. From Saturn IB/V Instrument Unit System Description and Component Data.\" class=\"hilite\" height=\"276\" src=\"https://static.righto.com/images/updata/iu-command-decoder-w350.jpg\" title=\"The Saturn Command Decoder. From Saturn IB/V Instrument Unit System Description and Component Data.\" width=\"350\" /></a><div class=\"cite\">The Saturn Command Decoder. From Saturn IB/V Instrument Unit System Description and Component Data.</div></p>\n<p>The Lunar Module also had an Up-Data system, called the Digital Up-link Assembly (DUA) and built with integrated circuits.\nThe Digital Up-link Assembly was similar to the Command Module's Up-Data Link and allowed ground stations to control the Lunar Guidance Computer.\nThe DUA also controlled relays to arm the ascent engine.\nThe DUA messages consisted of three vehicle address bits, three system address bits, and 16 information bits.\nUnlike the Command Module's UDL, the DUA includes the 70-kHz discriminator to demodulate the sub-band.\nThe DUA also provided a redundant up-link voice path, using the data subcarrier to transmit audio.\n(The Command Module had a similar redundant voice path, but the demodulation was performed in the Premodulation Processor.)\nThe DUA was based on the Digital-Command Assembly (DCA) that received up-link commands on the development vehicles.\nSee <a href=\"https://www.nasa.gov/wp-content/uploads/static/history/alsj/tnD6974LMCommSystem.pdf\">Lunar Module Communication System</a> and <a href=\"https://www.nasa.gov/wp-content/uploads/static/history/alsj/LM10HandbookVol1.pdf\">LM10 Handbook</a> 2.7.4.2.2.&#160;<a class=\"footnote-backref\" href=\"#fnref:command-system\" title=\"Jump back to footnote 3 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:sub-bits\">\n<p>Unexpectedly, we found three different sets of sub-bit codes in different documents.\nThe <a href=\"https://www.ibiblio.org/apollo/Documents/telecommunication_systems_study_guide.pdf#page=231\">Telecommunications Study Guide</a> says that the first digit (the Vehicle Address) encodes a one bit with the sub-bits 11011;\nfor the remaining digits, a one bit is encoded by 10101.\n<a href=\"https://ntrs.nasa.gov/api/citations/19650025875/downloads/19650025875.pdf#page=201\">Apollo Digital Command System</a> says that the first digit uses 11001 and the remainder use 10001.\nThe schematic in <a href=\"https://www.ibiblio.org/apollo/Documents/TM-X-1146-ApolloDigitalUpDataLinkDescription-Lenett.pdf#page=48\">Apollo Digital Up-Data Link Description</a> shows\nthat the first digit uses 11000 and the remainder use 01011.\nThis encoding matches our Up-Data Link and the Test Set, although the Test Set flipped the phase in the PSK signal.\n(In all cases, a zero bit is encoded by inverting all five sub-bits.)&#160;<a class=\"footnote-backref\" href=\"#fnref:sub-bits\" title=\"Jump back to footnote 4 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:destruct\">\n<p>To provide range safety if the rocket went off course, the Saturn V booster had a destruct system.\nThis system used detonating fuses along the RP-1 and LOX tanks to split the tanks open.\nAs this happened, the escape tower at the top of the rocket would pull the astronauts to safety,\naway from the booster.\nThe destruct system was controlled by the Digital Range Safety Command System (DRSCS), which used a\ncryptographic plug to prevent a malevolent actor from blowing up the rocket.</p>\n<p>The DRSCS&mdash;used on both the Saturn and Skylab programs&mdash;received\na message consisting of a 9-character \"Address\" word and a 2-character \"Command\" word.\nEach character was composed of two audio-frequency tones from an \"alphabet\" of seven tones, reminiscent of\nthe Dual-Tone Multi-Frequency (DTMF) signals used by Touch-Tone phones.\nThe commands could arm the destruct circuitry, shut off propellants, disperse propellants,\nor switch the DRSCS off.</p>\n<p>To make this system secure,\na \"code plug\" was carefully installed in the rocket shortly before launch.\nThis code plug provided the \"key-of-the-day\" by shuffling the mapping between tone pairs and characters.\nWith 21 characters, there were 21! (factorial) possible keys, so the chances of spoofing a message were astronomically small.\nMoreover, as the System Handbook writes with understatement: \"Much attention has been given to preventing execution of a catastrophic command should one component fail during flight.\"</p>\n<p>For details of the range safety system, see <a href=\"https://www.ibiblio.org/apollo/Documents/HSI-209540.pdf#page=325\">Saturn Launch Vehicle Systems Handbook</a>, <a href=\"https://www.ibiblio.org/apollo/Documents/UAH-19650801-AstrionicsSystemHandbookSaturnLaunchVehicles.pdf#page=182\">Astrionics System Handbook</a> (schematic in section 6.3),\n<a href=\"https://ntrs.nasa.gov/api/citations/20090015395/downloads/20090015395.pdf#page=34\">Apollo Spacecraft &amp; Saturn V Launch Vehicle Pyrotechnics / Explosive Devices</a>,\n<a href=\"https://ntrs.nasa.gov/api/citations/19740014779/downloads/19740014779.pdf#page=18\">The Evolution of Electronic Tracking, Optical, Telemetry, and Command Systems at the Kennedy Space Center</a>, and\n<a href=\"https://ntrs.nasa.gov/api/citations/20090016301/downloads/20090016301.pdf#page=73\">Saturn V Stage I (S-IC) Overview</a>.&#160;<a class=\"footnote-backref\" href=\"#fnref:destruct\" title=\"Jump back to footnote 5 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:s-band\">\n<p>I explained above how the Up-Data Link message was encoded into an audio signal using phase-shift keying.\nHowever, more steps were required before this signal could be transmitted over\nApollo's complicated S-band radio system.\nRather than using a separate communication link for each subsystem, Apollo unified most communication over a high-frequency <a href=\"https://en.wikipedia.org/wiki/S_band\">S-band</a> link, calling this the \"Unified S-Band\".\nApollo had many communication streams&mdash;voice, control data, scientific data, ranging, telemetry, television&mdash;so cramming them onto a single radio link required multiple layers of modulation, like nested Russian Matryoshka dolls with a message inside.</p>\n<p>For the Up-Data Link, the analog PSK signal was modulated onto a subcarrier using frequency modulation.\nIt was combined with the voice signal from ground and the pseudo-random ranging signal, and the combined signal was phase-modulated at 2106.40625 MHz and transmitted to the spacecraft through an enormous dish antenna at a ground station.</p>\n<p><a href=\"https://static.righto.com/images/updata/spectrum.jpg\"><img alt=\"The spectrum of the S-band signal to the Command Module. The Up-Data is transmitted on the 70 kHz subcarrier. Note the very wide spectrum of the pseudo-random ranging signal.\" class=\"hilite\" height=\"157\" src=\"https://static.righto.com/images/updata/spectrum-w600.jpg\" title=\"The spectrum of the S-band signal to the Command Module. The Up-Data is transmitted on the 70 kHz subcarrier. Note the very wide spectrum of the pseudo-random ranging signal.\" width=\"600\" /></a><div class=\"cite\">The spectrum of the S-band signal to the Command Module. The Up-Data is transmitted on the 70 kHz subcarrier. Note the very wide spectrum of the <a href=\"https://www.righto.com/2022/04/the-digital-ranging-system-that.html\">pseudo-random ranging signal</a>.</div></p>\n<p>Thus, the initial message was wrapped in several layers of modulation before transmission: the binary message was expanded to five times its length by the sub-bits, modulated with Phase-Shift Keying, modulated with frequency modulation, and modulated with phase modulation.</p>\n<p>On the spacecraft, the signal went through corresponding layers of demodulation to extract the message.\nA box called the Unified S-band Transceiver demodulated the phase-modulated signal and sent the data and voice signals to the <a href=\"https://www.righto.com/2022/05/talking-with-moon-inside-apollos.html\">pre-modulation processor</a> (PMP).\nThe PMP split out the voice and data subcarriers and demodulated the signals with FM discriminators.\nIt sent the data signal (now a 2-kHz audio signal) to the Up-Data Link, where a phase-shift keying demodulator produced a binary output.\nFinally, each group of five sub-bits was converted to a single bit, revealing the message.&#160;<a class=\"footnote-backref\" href=\"#fnref:s-band\" title=\"Jump back to footnote 6 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:paper-tape\">\n<p>The Test Set uses eight-bit paper tape, but the encoding is unusual.\nEach character of the paper tape consists of a three-bit octal digit, the same digit inverted, and two control bits.\nBecause of this redundancy, the Test Set could detect errors while reading the tape.</p>\n<p>One puzzling aspect of the paper tape reader was that we got it working, but when we tilted the Test Set on its side,\nthe reader completely stopped working.\nIt turned out that the reader's motor was controlled by a mercury-wetted relay, a high-current relay that\nuses mercury for the switch. \nSince mercury is a liquid, the relay would only work in the proper orientation; when we tilted the box, the mercury\nrolled away from the contacts.&#160;<a class=\"footnote-backref\" href=\"#fnref:paper-tape\" title=\"Jump back to footnote 7 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:top-view\">\n<p>This view of the Test Set from the top shows the positions of the 25 circuit boards, A1 through A25.\nMost of the boards are mounted in pairs, although A1, A2, and A15 are mounted singly.\nBecause boards A1 and A11 have larger components, they have empty slots next to them; these are not missing boards.\nEach board unit has two ejector levers to remove it, along with two metal tabs to lock the unit into position.\nThe 15 numbered holes allow access to the test points for each board.\n(I don't know the meaning of the text \"CTS\" on each board unit.)\nThe thirteen digit display modules are at the bottom, with their dropping resistors at the bottom right.</p>\n<p><a href=\"https://static.righto.com/images/updata/top-view.jpg\"><img alt=\"Top view of the Test Set.\" class=\"hilite\" height=\"474\" src=\"https://static.righto.com/images/updata/top-view-w450.jpg\" title=\"Top view of the Test Set.\" width=\"450\" /></a><div class=\"cite\">Top view of the Test Set.</div></p>\n<p><!-- -->&#160;<a class=\"footnote-backref\" href=\"#fnref:top-view\" title=\"Jump back to footnote 8 in the text\">&#8617;</a><a class=\"footnote-backref\" href=\"#fnref2:top-view\" title=\"Jump back to footnote 8 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:drivers\">\n<p>There are seven driver boards: A3 through A9. Board A3 is different from the others because it implements one digit\ninstead of two. Instead, board A3 includes validation logic for the paper tape data.&#160;<a class=\"footnote-backref\" href=\"#fnref:drivers\" title=\"Jump back to footnote 9 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:numerik\">\n<p>Here is the datasheet for the digit displays in the Test Set: \"Numerik Indicator IND-0300\".\nIn current dollars, they cost over $200 each!\nThe cutaway diagram shows how the bent plastic sheets are stacked and illuminated.</p>\n<p><a href=\"https://static.righto.com/images/updata/numerik.jpg\"><img alt=\"Datasheet from General Radio Catalog, 1963.\" class=\"hilite\" height=\"459\" src=\"https://static.righto.com/images/updata/numerik-w500.jpg\" title=\"Datasheet from General Radio Catalog, 1963.\" width=\"500\" /></a><div class=\"cite\">Datasheet from <a href=\"https://www.worldradiohistory.com/Archive-Catalogs/General-Radio/General-Radio-Catalog-R-1963.pdf#page=219\">General Radio Catalog</a>, 1963.</div></p>\n<!-- -->\n<p>For amazing photos that show the internal structure of the displays, see <a href=\"https://www.industrialalchemy.org/articleview.php?item=1093\">this article</a>.\nFran Blanche's <a href=\"https://www.youtube.com/watch?v=LvJN4Maea9I\">video</a> discusses a similar display.\nWikipedia has a page on <a href=\"https://en.wikipedia.org/wiki/Lightguide_display\">lightguide displays</a>.</p>\n<p>While restoring the Test Set, we discovered that a few of the light bulbs were burnt out.\nSince displaying an octal digit only uses eight of the ten bulbs, we figured that we could swap the failed bulbs\nwith unused bulbs from \"8\" or \"9\". It turned out that we weren't the first people to think of this&mdash;many\nof the \"unused\" bulbs were burnt out.&#160;<a class=\"footnote-backref\" href=\"#fnref:numerik\" title=\"Jump back to footnote 10 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:count-to-five\">\n<p>I'll give more details on the count-to-five ring counter.\nThe first flip-flop gets its J input from the Q' output of the last flip-flop as expected, but it gets its\nK input from the Q output of the <em>second</em> flip-flop, not the last flip-flop.\nIf you examine the states, this causes the transition from 110 to 011 (a toggle instead of a set to 111),\nresulting in five states instead of six.&#160;<a class=\"footnote-backref\" href=\"#fnref:count-to-five\" title=\"Jump back to footnote 11 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:psk\">\n<p>To explain the phase-shift keying circuitry in a bit more detail, board A1 produces a 4 kHz clock signal.\nBoard A2 divides the clock, producing a 2 kHz signal and a 1 kHz signal.\nThe 2 kHz signal is fed into the transformer to be phase-shifted.\nThen the 1 kHz reference signal is mixed in to form the PSK output.\nResonant filters on board A1 convert the square-wave clock signals to smooth sine waves.&#160;<a class=\"footnote-backref\" href=\"#fnref:psk\" title=\"Jump back to footnote 12 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:led\">\n<p>I was surprised to find LED opto-isolators in a device from the mid-1960s.\nI expected that the Test Set isolator used a light bulb, but testing showed that it switches on at 550 mV (like a diode) and operated successfully at over 100 kHz, impossible with a light bulb or photoresistor.\nIt turns out that Texas Instruments <a href=\"https://patents.google.com/patent/US3304431A\">filed a patent</a> for an LED-based opto-isolator in 1963 and turned this into a <a href=\"https://www.worldradiohistory.com/Archive-Electronics/60s/64/Elelctronics-1964-05-18.pdf#page=15\">product</a> in 1964.\nThe \"PEX 3002\" used a gallium-arsenide LED and a silicon phototransistor.\nStrangely, TI called this product a \"molecular multiplex switch/chopper\".\nNowadays, an opto-isolator costs pennies, but at the time, these devices were absurdly expensive: TI's device sold for $275 (almost $3000 in current dollars).\nFor more, see <a href=\"https://www.worldradiohistory.com/Archive-Electronics-World/60s/1965/Electronics-World-1965-09.pdf#page=34\">The Optical Link: A New Circuit Tool</a>, 1965.&#160;<a class=\"footnote-backref\" href=\"#fnref:led\" title=\"Jump back to footnote 13 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:burr-brown\">\n<p>For more information on the Burr-Brown 1506 op amp module, see\n<a href=\"https://www.worldradiohistory.com/BOOKSHELF-ARH/Technology/Technology-General/Handbook-of-Operational-Amplifier-RC-Networks-Burr-Brown-1966.pdf\">Burr-Brown Handbook of Operational Amplifier RC Networks</a>.\nOther documents are \n<a href=\"https://dl.icdst.org/pdfs/files/3db5f8cbbdc6f23fdea4d5d8231dbe96.pdf\">Burr-Brown Handbook of Operational Amplifier Applications</a>,\n<a href=\"https://www.analog.com/media/en/training-seminars/design-handbooks/Op-Amp-Applications/SectionH.pdf\">Op-Amp History</a>,\n<a href=\"https://archive.computerhistory.org/resources/access/text/2017/03/102770853-05-01-acc.pdf\">Operational Amplifier Milestones</a>,\nand an <a href=\"https://www.worldradiohistory.com/Archive-Electronics/50s/Electronics-1958-11-07.pdf#page=165\">ad</a> for the Burr-Brown 130 op amp.&#160;<a class=\"footnote-backref\" href=\"#fnref:burr-brown\" title=\"Jump back to footnote 14 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:verification\">\n<p>I'm not sure of the meaning of the Direct versus Remote verification codes.\nThe Block I (earlier) UDL had an 8-bit code, while the Block II (flight) UDL had a 4-bit code.\nThe Direct code presumably comes from the UDL itself, while the Remote code is perhaps supplied through telemetry?&#160;<a class=\"footnote-backref\" href=\"#fnref:verification\" title=\"Jump back to footnote 15 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:documentation\">\n<p>The block diagram below shows the structure of the Up-Data Link (UDL). It uses the sub-bit decoder and a 24-stage\nregister to deserialize the message. Based on the message, the UDL triggers relays (RTC), outputs data to\nthe Apollo Guidance Computer (called the CMC, Command Module Computer here), sends pulses to the CTE clock, or\nsends validity signals back to Earth.</p>\n<p><a href=\"https://static.righto.com/images/updata/udl-internal.jpg\"><img alt=\"UDL block diagram, from Apollo Operations Handbook, page 31\" class=\"hilite\" height=\"370\" src=\"https://static.righto.com/images/updata/udl-internal-w500.jpg\" title=\"UDL block diagram, from Apollo Operations Handbook, page 31\" width=\"500\" /></a><div class=\"cite\">UDL block diagram, from <a href=\"https://www.ibiblio.org/apollo/ApolloProjectOnline/Documents/SMA2A-03-BLOCK%20II%20Volume%201%2019691015/aoh-v1-2-08-telecoms.pdf\">Apollo Operations Handbook</a>, page 31</div></p>\n<p>For details of the Apollo Up-Data system, see the diagram below (click it for a very large image).\nThis diagram is from the <a href=\"https://www.ibiblio.org/apollo/Documents/HSI-481260.pdf#page=80\">Command/Service Module Systems Handbook</a> (PDF page 64); see page 80 for written specifications of the UDL.</p>\n<p><a href=\"https://static.righto.com/images/updata/udl-diagram.jpg\"><img alt=\"This diagram of the Apollo Updata system specifies the message formats, relay usages, and internal structure of the UDL.\" class=\"hilite\" height=\"178\" src=\"https://static.righto.com/images/updata/udl-diagram-w600.jpg\" title=\"This diagram of the Apollo Updata system specifies the message formats, relay usages, and internal structure of the UDL.\" width=\"600\" /></a><div class=\"cite\">This diagram of the Apollo Updata system specifies the message formats, relay usages, and internal structure of the UDL.</div></p>\n<p>Other important sources of information:\n<a href=\"https://www.ibiblio.org/apollo/Documents/TM-X-1146-ApolloDigitalUpDataLinkDescription-Lenett.pdf\">Apollo Digital Up-Data Link Description</a> contains schematics and a detailed description of the UDL.\n<a href=\"https://www.ibiblio.org/apollo/Documents/telecommunication_systems_study_guide.pdf#page=223\">Telecommunication Systems Study Guide</a> describes the earlier UDL that included a 450 MHz FM receiver.&#160;<a class=\"footnote-backref\" href=\"#fnref:documentation\" title=\"Jump back to footnote 16 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:videos\">\n<p>The following CuriousMarc videos describe the Up-Data Link and the Test Set, so smash that Like button and subscribe :-)\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=VReePQJRRI0&amp;list=PL-_93BVApb58SXL-BCv4rVHL-8GuC2WGb&amp;index=9\">Mystery Apollo Up-Data Box</a>\n<li><a href=\"https://www.youtube.com/watch?v=sv0aFLQvFxc&amp;list=PL-_93BVApb58SXL-BCv4rVHL-8GuC2WGb&amp;index=14\">Up-Data Commands</a>\n<li><a href=\"https://www.youtube.com/watch?v=iegf7ZU6ciM&amp;list=PL-_93BVApb58SXL-BCv4rVHL-8GuC2WGb&amp;index=18\">Up-Data Link Analog Mystery Solved</a>\n<li><a href=\"https://www.youtube.com/watch?v=9fGurEa3EVk&amp;list=PL-_93BVApb58SXL-BCv4rVHL-8GuC2WGb&amp;index=21\">Looking inside Apollo components with Lumafield's 3D X-ray machine</a>\n<li><a href=\"https://www.youtube.com/watch?v=06evyO7aUVU&amp;list=PL-_93BVApb58SXL-BCv4rVHL-8GuC2WGb&amp;index=32\">UDL Grand Opening and Power Up</a>\n<li><a href=\"https://www.youtube.com/watch?v=tBy1j9cTYKc&amp;list=PL-_93BVApb58SXL-BCv4rVHL-8GuC2WGb&amp;index=33\">Breaking the Updata Link Code</a>\n<li><a href=\"https://www.youtube.com/watch?v=HFqWvtVVbgk&amp;list=PL-_93BVApb58SXL-BCv4rVHL-8GuC2WGb&amp;index=34\">Is there something wrong with our NASA Up Data Link transmitter?</a>\n<li><a href=\"https://www.youtube.com/watch?v=2Jt0PsxLM7k&amp;list=PL-_93BVApb58SXL-BCv4rVHL-8GuC2WGb&amp;index=35\">Trying every function of the Apollo command system</a>\n</ul>&#160;<a class=\"footnote-backref\" href=\"#fnref:videos\" title=\"Jump back to footnote 17 in the text\">&#8617;</a></p>\n</li>\n</ol>\n</div>",
  "id": "tag:blogger.com,1999:blog-6264947694886887540.post-3876610068863399947"
}