{
  "title": "Stop Consuming Spam at the First Sign",
  "link": "https://idiallo.com/blog/stop-consuming-spam-at-the-first-sign?src=feed",
  "published": "Mon, 19 Jan 2026 12:00:00 GMT",
  "summary": "<p>My mother handed me her phone a couple days ago. \"Do you think this is true?\" she asked, her finger hovering over a video about new curfew laws coming to California, featuring Denzel Washington's take on the matter. I'm so proud that she's learned to ask this question now instead of immediately sharing. But as she waited for my response, I noticed she had already watched the entire video.</p>\n\t\t\t<p>We listened together for one second, just one second. The voice was obviously synthetic, that familiar AI-generated voice in almost every low effort youtube ad. I checked the video details and YouTube had marked it as significantly AI-generated content. We didn't need to hear another word.</p>\n\n<p>We are the first generation tasked with teaching our parents how to navigate the world. When a good part of that world exists on the internet, we have to make sure they stay safe and don't fall for scams. I've written before about how <a href=\"https://idiallo.com/blog/all-ai-videos-are-harmful\">all AI videos have become essentially spam</a> at this point, specifically targeting people over a certain age. I've tried to come up with better ways to help my community recognize videos designed to deceive them, and I think I've finally spotted the pattern.</p>\n\n<p>Here's a generation that was taught that intelligent people take their time to form an opinion. But their adversaries are taking full advantage of that very trait. The problem isn't that they're asking whether something is true, that's commendable. The problem is that they're consuming all of the content before making that decision.</p>\n\n<p>They watch the full video. They read the entire article. They listen to the complete AI-generated audio. Then they try to evaluate whether the content makes sense. They share it with their peers and wait for feedback. They read through the comments, which usually support whatever the video claims. The critical mistake they're making is <em>not</em> dismissing the content the moment they realize it may be AI-generated.</p>\n\n<p>For example, when you hear that familiar voice you've come to associate with AI-generated videos, there's no reason to continue watching. You can be forgiven if it's a funny video or a meme. But when that voice is discussing an important subject? Dismiss it immediately. There's no reason to weigh the pros and cons when the premise is already wrong.</p>\n\n<p>If the voice is generated, dismiss it. If the image itself looks synthetic, dismiss it. If the thumbnail has yellow and red text, dismiss it (you won't be able to unsee this pattern now). If the information being discussed in these AI videos is true and actually impactful, serious news outlets will cover it. If there's a curfew in Los Angeles, you won't hear about it first from a YouTuber based in Bangladesh who only posts videos with ethereal thumbnails.</p>\n\n<p>I used to tell my mother not to watch serious news on channels with just a handful of subscribers. Unfortunately, AI scammers now have hundreds of thousands of subscribers, if not millions.</p>\n\n<p>This isn't to say all AI is bad, we can argue about that another time. It's simply to say that serious information doesn't come packaged in AI-generated content. At the first sign that a video is spam, don't try to understand the message it's sharing. Just dismiss it.</p>\n\n<p>My mother nodded as I handed her phone back. One second was all we needed. She has learned something more valuable than how to fact-check a video. She has learned when not to waste her time trying.</p>",
  "id": "https://idiallo.com/blog/stop-consuming-spam-at-the-first-sign?src=feed"
}