{
  "title": "Here we go",
  "link": "https://rakhim.exotext.com/here-we-go",
  "published": "Thu, 31 Oct 2024 17:18:12 GMT",
  "summary": "<p>I just wanted to write again. My old blog at <a href=\"https://rakhim.org/\">rakhim.org</a> is built with Hugo, and after installing a new version of Hugo things broke. After 25 minutes of attempts to fix it I though &quot;yeah, that's it&quot;, and decided (as you do) to just build a simple blogging platform.</p>\n<p>Static site generators are great. Hugo though has too many features I never use. But my overall issue with static site generators is UX. Unlike, apparently, many others in tech circles, I don't enjoy writing in my normal code editor, nor do I find joy in publishing via git, and not having simple image uploads. </p>\n<p>Sure, there are fully fledged blog engines like Ghost and Wordpress (with its <a href=\"https://www.theverge.com/2024/9/27/24256361/wordpress-wp-engine-drama-explained-matt-mullenweg\">drama</a>). I've used both for a long time in the past in various projects, and was generally ok with either. Today, ghost is trying really hard to become a &quot;publishing&quot; thing, with its magazine-like themes, paid memberships, and newsletters. Wordpress is just scary, to be honest (same vibe as Java or Kubernetes).</p>\n<p>There are very nice, small platforms like <a href=\"https://bearblog.dev/\">Bear</a>, <a href=\"https://pika.page/\">Pika</a>, <a href=\"https://mataroa.blog/\">Mataroa</a>. Each would actually be pretty much perfect for me. But I always wanted to build my own platform, with some specific features and UX nuances.</p>\n<p>So, yeah. I'm starting today! It's called Exotext, and for now there's only one blog: mine. I'll write (among other things) about its development. In short, I want to focus on these things:</p>\n<ul>\n<li>Simple writing experience with minimized traction.</li>\n<li>Beautiful design and typography out of the box.</li>\n<li>Fast. Every page should render under 0.5s.</li>\n<li>Old web UX. Absolute minimum JS, no SPA stuff, no client-side rendering shenanigans. </li>\n<li>Portability. No lock in. It should be easy to export data and fully rendered HTML website when needed.</li>\n<li>Some sort of community features. Perhaps comments.</li>\n<li>Good online markdown editor and easy image uploads.</li>\n<li>RSS (of course, especially since I'm also building <a href=\"https://minifeed.net\">Minifeed</a>, an RSS discovery and search engine).</li>\n</ul>\n<p>Speaking of markdown editors: it's damn hard to find a good one. For now, I'm using <a href=\"https://github.com/jefago/tiny-markdown-editor\">TinyMDE</a>, which is almost perfect. It doesn't handle undo, though. Oh, you know what's even harder? Finding a Markdown editor which can be used with vanilla JS. There are some very nice editors built on React, Svelte, Vue and other frameworks, and I dread the though of dealing with that complexity. </p>\n<p>Let's see how it goes.</p>",
  "id": "https://rakhim.exotext.com/here-we-go"
}