{
  "title": "You Can Just Say No to the Data",
  "link": "https://blog.jim-nielsen.com/2026/say-no-to-data/",
  "published": "Mon, 26 Jan 2026 19:00:00 GMT",
  "summary": "<p>“The data doesn’t lie.”</p>\n<p>I imagine that’s what the cigarette companies said. </p>\n<p>“The data doesn’t lie. People want this stuff. They’re buying it in droves. We’re merely giving them what they want.”</p>\n<p>Which sounds more like an attempt at exoneration than a reason to exist. </p>\n<p>Demand can be engineered. “We’re giving them what they want” ignores how desire is shaped, even engineered (algorithms, dark patterns, <a href=\"https://blog.jim-nielsen.com/2025/grow-like-a-tree-not-a-cancer/\">growth hacking</a>, etc.).</p>\n<p>Appealing to data as the ultimate authority — especially when fueled by engineered desire — isn’t neutrality, it’s an abdication of responsibility.</p>\n<p>Satiating human desire is not the highest aspiration.</p>\n<p>We can do so much more than merely supply what the data says is in demand.</p>\n<p>Stated as <a href=\"https://adactio.com/journal/16811\">a principle</a>:</p>\n<p>Values <em>over</em> data.</p>\n<p>Data tells you what people consume, not what you <em>should</em> make. Values, ethics, vision, those can help you with the “should”.</p>\n<p>“What is happening?” and “What should happen?” are two completely different questions and should be dealt with as such.</p>\n<p>The more powerful our ability to understand demand, the more important our responsibility to decide whether to respond to it. We can choose <em>not</em> to build something, even though the data suggests we should. We can say no to the data. </p>\n<p>Data can tell you what people clicked on, even help you predict what people <em>will</em> click on, but you get to decide what you will profit from.</p>\n\n    <hr />\n    \n\n    <p>\n      Reply via:\n      \n\n      <a href=\"mailto:jimniels%2Bblog@gmail.com?subject=Re:%20blog.jim-nielsen.com/2026/say-no-to-data/\">Email</a>\n      · <a href=\"https://mastodon.social/@jimniels\">Mastodon</a> ·\n\n      <a href=\"https://bsky.app/profile/jim-nielsen.com\">Bluesky</a>\n    </p>",
  "id": "https://blog.jim-nielsen.com/2026/say-no-to-data/"
}