{
  "title": "Study Finds Obvious Truth Everybody Knows",
  "link": "https://blog.jim-nielsen.com/2026/study-finds-obvious-truth/",
  "published": "Fri, 06 Feb 2026 19:00:00 GMT",
  "summary": "<p>Researchers at Anthropic published their findings around <a href=\"https://www.anthropic.com/research/AI-assistance-coding-skills\">how AI assistance impacts the formation of coding skills</a>:</p>\n<blockquote>\n<p>We found that using AI assistance led to a statistically significant decrease in mastery […] Using AI sped up the task slightly, but this didn’t reach the threshold of statistical significance.</p>\n</blockquote>\n<p>Wait, what? Let me read that again: </p>\n<blockquote>\n<p>using AI assistance led to a statistically significant decrease in mastery</p>\n</blockquote>\n<p>Ouch.</p>\n<p>Honestly, the entire articles reads like those pieces you find on the internet with titles such as “Study Finds Exercise Is Good for Your Health” or “Being Kind to Others Makes People Happier”.</p>\n<p>Here’s another headline for you: Study Finds Doing Hard Things Leads to Mastery.</p>\n<blockquote>\n<p>Cognitive effort—and even getting painfully stuck—is likely important for fostering mastery.</p>\n</blockquote>\n<p>We already know this. Do we really need a study for this?</p>\n<p>So what are their recommendations? Here’s one:</p>\n<blockquote>\n<p>Managers should think intentionally about how to deploy AI tools at scale</p>\n</blockquote>\n<p>Lol, yeah that’s gonna happen. You know what’s gonna happen instead? What always happens when organizational pressures and incentives are aligned to deskill workers.</p>\n<p>Oh wait, they already came to that conclusion in the article:</p>\n<blockquote>\n<p>Given time constraints and organizational pressures, junior developers or other professionals may rely on AI to complete tasks as fast as possible at the cost of skill development</p>\n</blockquote>\n<p>AI is like a creditor: they give you a bunch of money and don’t talk about the trade-offs, just the fact that you’ll be more “rich” after they get involved.</p>\n<p>Or maybe a better analogy is <a href=\"https://en.wikipedia.org/wiki/Rumpelstiltskin\">Rumpelstilskin</a>: the promise is gold, but beware the hidden cost might be your first-born child.</p>\n\n    <hr />\n    \n\n    <p>\n      Reply via:\n      \n\n      <a href=\"mailto:jimniels%2Bblog@gmail.com?subject=Re:%20blog.jim-nielsen.com/2026/study-finds-obvious-truth/\">Email</a>\n      · <a href=\"https://mastodon.social/@jimniels\">Mastodon</a> ·\n\n      <a href=\"https://bsky.app/profile/jim-nielsen.com\">Bluesky</a>\n    </p>",
  "id": "https://blog.jim-nielsen.com/2026/study-finds-obvious-truth/"
}