{
  "title": "In The Beginning There Was Slop",
  "link": "https://blog.jim-nielsen.com/2026/in-the-beginning-slop/",
  "published": "Sun, 11 Jan 2026 19:00:00 GMT",
  "summary": "<p>I’ve been slowly reading <a href=\"https://blog.jim-nielsen.com/2025/internet-phone-book/\">my copy of “The Internet Phone Book”</a> and I recently read an essay in it by Elan Ullendorff called <a href=\"https://escapethealgorithm.substack.com/p/the-new-turing-test\">“The New Turing Test”</a>.</p>\n<p>Elan argues that what matters in a work isn’t the tools used to make it, but the “expressiveness” of the work itself (was it made “from someone, for someone, in a particular context”):</p>\n<blockquote>\n<p>If something feels robotic or generic, it is those very qualities that make the work problematic, not the tools used.</p>\n</blockquote>\n<p>This point reminded me that there was slop before AI came on the scene.</p>\n<p>A lot of blogging was considered a primal form of slop when the internet first appeared: content of inferior substance, generated in quantities much vaster than heretofore considered possible. </p>\n<p>And the truth is, perhaps a lot of the content in blogosphere was “slop”.</p>\n<p>But it wasn’t slop because of the tools that made it — like Movable Type or Wordpress or Blogger. </p>\n<p>It was slop because it lacked thought, care, and intention — the “expressiveness” Elan argues for.</p>\n<p>You don’t need AI to produce slop because slop isn’t made by AI. It’s made by humans — AI is just the popular tool of choice for making it right now.</p>\n<p>Slop existed long before LLMs came onto the scene.</p>\n<p>It will doubtless exist long after too.</p>\n\n    <hr />\n    \n\n    <p>\n      Reply via:\n      \n\n      <a href=\"mailto:jimniels%2Bblog@gmail.com?subject=Re:%20blog.jim-nielsen.com/2026/in-the-beginning-slop/\">Email</a>\n      · <a href=\"https://mastodon.social/@jimniels\">Mastodon</a> ·\n\n      <a href=\"https://bsky.app/profile/jim-nielsen.com\">Bluesky</a>\n    </p>",
  "id": "https://blog.jim-nielsen.com/2026/in-the-beginning-slop/"
}