{
  "title": "Conditions in the Intel 8087 floating-point chip's microcode",
  "link": "http://www.righto.com/2025/12/8087-microcode-conditions.html",
  "published": "2025-12-30T10:00:00.000-08:00",
  "summary": "<p>In the 1980s, if you wanted your computer to do floating-point calculations faster, you could buy\nthe Intel 8087 floating-point coprocessor chip.\nPlugging it into your IBM PC would make operations up to 100 times faster, a big boost for spreadsheets\nand other number-crunching applications.\nThe 8087 uses complicated algorithms to compute trigonometric, logarithmic, and exponential functions.\nThese algorithms are implemented inside the chip in microcode.\nI'm part of a group that is reverse-engineering this microcode.\nIn this post, I examine the 49 types of conditional tests that the 8087's microcode uses inside its algorithms.\nSome conditions are simple, such as checking if a number is zero or negative, while others are specialized,\nsuch as determining what direction to round a number.</p>\n<p>To explore the 8087's circuitry, I opened up an 8087 chip and took numerous photos of the silicon die with a microscope.\nAround the edges of the die, you can see the hair-thin bond wires that connect the chip to its 40 external pins.\nThe complex patterns on the die are formed by its metal wiring, as well as the polysilicon and silicon underneath.\nThe bottom half of the chip is the \"datapath\", the circuitry that performs calculations on 80-bit floating point values. \nAt the left of the datapath, a <a href=\"https://www.righto.com/2020/05/extracting-rom-constants-from-8087-math.html\">constant ROM</a> holds important constants such as &pi;.\nAt the right are the eight registers that the\nprogrammer uses to hold floating-point values; in an unusual design decision,\nthese registers are arranged as a <a href=\"https://www.righto.com/2025/12/8087-stack-circuitry.html\">stack</a>.</p>\n<p><a href=\"https://static.righto.com/images/8087-conditions/8087-die-labeled.jpg\"><img alt=\"Die of the Intel 8087 floating point unit chip, with main functional blocks labeled. The die is 5mm&times;6mm.  Click for a larger image.\" class=\"hilite\" height=\"587\" src=\"https://static.righto.com/images/8087-conditions/8087-die-labeled-w450.jpg\" title=\"Die of the Intel 8087 floating point unit chip, with main functional blocks labeled. The die is 5mm&times;6mm.  Click for a larger image.\" width=\"450\" /></a><div class=\"cite\">Die of the Intel 8087 floating point unit chip, with main functional blocks labeled. The die is 5mm&times;6mm.  Click for a larger image.</div></p>\n<p>The chip's instructions are defined by the large <a href=\"https://www.righto.com/2018/09/two-bits-per-transistor-high-density.html\">microcode ROM</a> in the middle.\nTo execute a floating-point instruction, the 8087 decodes the instruction and the microcode engine starts executing\nthe appropriate micro-instructions from the microcode ROM.\nThe microcode decode circuitry to the right of the ROM generates the appropriate control signals from each micro-instruction.<span id=\"fnref:decode\"><a class=\"ref\" href=\"#fn:decode\">1</a></span>\nThe bus registers and control circuitry handle interactions with the main 8086 processor and the rest of the system.</p>\n<h2>The 8087's microcode</h2>\n<p>Executing an 8087 instruction such as arctan requires hundreds of internal steps to compute the result.\nThese steps are implemented in microcode with micro-instructions specifying each step of the algorithm.\n(Keep in mind the difference between the assembly language instructions used by a programmer and the\nundocumented low-level micro-instructions used internally by the chip.)\nThe microcode ROM holds 1648 micro-instructions, implementing the 8087's instruction set.\nEach micro-instruction is 16 bits long and performs a simple operation such as moving data inside the chip, adding two values, or <a href=\"https://www.righto.com/2020/05/die-analysis-of-8087-math-coprocessors.html\">shifting</a> data.\nI'm working with the \"Opcode Collective\" to reverse engineer the micro-instructions and fully understand the microcode (<a href=\"https://github.com/a-mcego/granite/blob/main/tools/8087mc/bin/8087.md\">link</a>).</p>\n<p>The microcode engine (below) controls the execution of micro-instructions, acting as the mini-CPU inside the 8087.\nSpecifically, it generates an 11-bit micro-address, the address of a micro-instruction in the ROM.\nThe microcode engine implements jumps, subroutine calls, and returns within the microcode.\nThese jumps, subroutine calls, and returns are all conditional; the microcode engine will either perform the\noperation or skip it, depending on the value of a specified condition.</p>\n<p><a href=\"https://static.righto.com/images/8087-conditions/engine.jpg\"><img alt=\"The microcode engine. In this image, the metal is removed, showing the underlying silicon and polysilicon.\" class=\"hilite\" height=\"633\" src=\"https://static.righto.com/images/8087-conditions/engine-w200.jpg\" title=\"The microcode engine. In this image, the metal is removed, showing the underlying silicon and polysilicon.\" width=\"200\" /></a><div class=\"cite\">The microcode engine. In this image, the metal is removed, showing the underlying silicon and polysilicon.</div></p>\n<p>I'll write more about the microcode engine later, but I'll give an overview here.\nAt the top, the Instruction Decode PLA<span id=\"fnref:pla\"><a class=\"ref\" href=\"#fn:pla\">2</a></span> decodes an 8087 instruction to determine the starting address in\nmicrocode.\nBelow that, the Jump PLA holds microcode addresses for jumps and subroutine calls.\nBelow this, six 11-bit registers implement the microcode stack, allowing six levels of subroutine calls inside the\nmicrocode.\n(Note that this stack is completely different from the 8087's register stack that holds eight floating-point values.)\nThe stack registers have associated read/write circuitry.\nThe incrementer adds one to the micro-address to step through the code.\nThe engine also implements relative jumps, using an adder to add an offset to the current location.\nAt the bottom, the address latch and drivers boost the 11-bit address output\nand send it to the microcode ROM.</p>\n<h2>Selecting a condition</h2>\n<p>A micro-instruction can say \"jump ahead 5 micro-instructions if a register is zero\" and the\nmicrocode engine will either perform the jump or ignore it, based on the register value.\nIn the circuitry, the condition causes the microcode engine to either perform the jump or block the jump.\nBut how does the hardware select one condition out of the large set of conditions?</p>\n<p>Six bits of the micro-instruction can specify one of 64 conditions.\nA circuit similar to the idealized diagram below selects the specified condition.\nThe key component is a multiplexer, represented by a trapezoid below.\nA multiplexer is a simple circuit that selects one of its four inputs.\nBy arranging multiplexers in a tree, one of the 64 conditions on the left is selected and becomes the output,\npassed to the microcode engine.</p>\n<p><a href=\"https://static.righto.com/images/8087-conditions/muxtree2.jpg\"><img alt=\"A tree of multiplexers selects one of the conditions. This diagram is simplified.\" class=\"hilite\" height=\"414\" src=\"https://static.righto.com/images/8087-conditions/muxtree2-w400.jpg\" title=\"A tree of multiplexers selects one of the conditions. This diagram is simplified.\" width=\"400\" /></a><div class=\"cite\">A tree of multiplexers selects one of the conditions. This diagram is simplified.</div></p>\n<p>For example, if bits J and K of the microcode are 00, the rightmost multiplexer will select the first input.\nIf bits LM are 01, the middle multiplexer will select the second input, and if bits NO are 10, the left\nmultiplexer will select its third input. The result is that condition 06 will pass through the tree and become the output.<span id=\"fnref:mux\"><a class=\"ref\" href=\"#fn:mux\">3</a></span>\nBy changing the bits that control the multiplexers, any of the inputs can be used.\n(We've arbitrarily given the 16 microcode bits the letter names A through P.)</p>\n<p>Physically, the conditions come from locations scattered across the die. For instance, conditions involving the opcode\ncome from the instruction decoding part of the chip, while conditions involving a register are evaluated\nnext to the register.\nIt would be inefficient to run 64 wires for all the conditions to the microcode engine.\nThe tree-based approach reduces the wiring since the \"leaf\" multiplexers can be located\nnear the associated condition circuitry. Thus, only one wire needs to travel a long distance rather than multiple wires.\nIn other words, the condition selection circuitry is distributed across the chip instead of being implemented as\na centralized module.</p>\n<p>Because the conditions don't always fall into groups of four, the actual implementation is slightly different from\nthe idealized diagram above.\nIn particular, the top-level multiplexer has five inputs, rather than four.<span id=\"fnref:inputs\"><a class=\"ref\" href=\"#fn:inputs\">4</a></span>\nOther multiplexers don't use all four inputs.\nThis provides a better match between the physical locations of the condition circuits and the multiplexers.\nIn total, 49 of the possible 64 conditions are implemented in the 8087.</p>\n<p>The circuit that selects one of the four conditions is called a multiplexer.\nIt is constructed from pass transistors, transistors that are configured to either pass a signal through\nor block it.\nTo operate the multiplexer, one of the select lines is energized, turning on the corresponding pass transistor.\nThis allows the selected input to pass through the transistor to the output, while the other inputs are blocked.</p>\n<p><a href=\"https://static.righto.com/images/8087-conditions/multiplexer.jpg\"><img alt=\"A 4-1 multiplexer, constructed from four pass transistors.\" class=\"hilite\" height=\"180\" src=\"https://static.righto.com/images/8087-conditions/multiplexer-w250.jpg\" title=\"A 4-1 multiplexer, constructed from four pass transistors.\" width=\"250\" /></a><div class=\"cite\">A 4-1 multiplexer, constructed from four pass transistors.</div></p>\n<p>The diagram below shows how a multiplexer appears on the die. The pinkish regions are doped silicon. The white\nlines are polysilicon wires.\nWhen polysilicon crosses over doped silicon, a transistor is formed.\nOn the left is a four-way multiplexer, constructed from four pass transistors. It takes inputs (black) for four conditions,\nnumbered 38, 39, 3a, and 3b.\nThere are four control signals (red) corresponding to the four combinations of bits N and O.\nOne of the inputs will pass through a transistor to the output, selected by the active control signal.\nThe right half contains the logic (four NOR gates and two inverters) to generate the control signals from the\nmicrocode bits.\n(Metal lines run horizontally from the logic to the control signal contacts, but I dissolved the metal for this\nphoto.)\nEach multiplexer in the 8087 has a completely different layout,\nmanually optimized based on the location of the signals and surrounding circuitry.\nAlthough the circuit for a multiplexer is regular (four transistors in parallel), the physical layout looks\nsomewhat chaotic.</p>\n<p><a href=\"https://static.righto.com/images/8087-conditions/mux-diagram.jpg\"><img alt=\"Multiplexers as they appear on the die. The metal layer has been removed to show the polysilicon and silicon. The &quot;tie-die&quot; patterns are due to thin-film effects where the oxide layer wasn't completely removed.\" class=\"hilite\" height=\"256\" src=\"https://static.righto.com/images/8087-conditions/mux-diagram-w500.jpg\" title=\"Multiplexers as they appear on the die. The metal layer has been removed to show the polysilicon and silicon. The &quot;tie-die&quot; patterns are due to thin-film effects where the oxide layer wasn't completely removed.\" width=\"500\" /></a><div class=\"cite\">Multiplexers as they appear on the die. The metal layer has been removed to show the polysilicon and silicon. The \"tie-die\" patterns are due to thin-film effects where the oxide layer wasn't completely removed.</div></p>\n<p>The 8087 uses pass transistors for many circuits, not just multiplexers.\nCircuits with pass transistors are different from regular logic gates\nbecause the pass transistors provide no amplification. Instead, signals get weaker as they go through pass\ntransistors.\nTo solve this problem, inverters or buffers are inserted into the condition tree to boost signals;\nthey are omitted from the diagram above.</p>\n<h2>The conditions</h2>\n<p>Of the 8087's 49 different conditions, some are widely used in the microcode, while others are designed for\na specific purpose and are only used once.\nThe full set of conditions is described in a footnote<span id=\"fnref:conditions\"><a class=\"ref\" href=\"#fn:conditions\">7</a></span> but I'll give some highlights here.</p>\n<p>Fifteen conditions examine the bits of the current instruction's opcode. This allows\none microcode routine to handle a group of similar instructions and then change behavior based on the specific\ninstruction. For example, conditions test if the instruction is multiplication, if the instruction is an FILD/FIST\n(integer load or store), or if the bottom bit of the opcode is set.<span id=\"fnref:instructions\"><a class=\"ref\" href=\"#fn:instructions\">5</a></span></p>\n<p>The 8087 has three temporary registers&mdash;tmpA, tmpB, and tmpC&mdash;that hold values during computation.\nVarious conditions examine the values in the tmpA and tmpB registers.<span id=\"fnref:swap\"><a class=\"ref\" href=\"#fn:swap\">6</a></span>\nIn particular, the 8087 uses an interesting way to store numbers internally: each 80-bit floating-point value also \nhas two \"tag\" bits.\nThese bits are mostly invisible to the programmer and can be thought of as metadata.\nThe tag bits indicate if a register is empty, contains zero, contains a \"normal\" number, or contains a special\nvalue such as NaN (Not a Number) or infinity.\nThe 8087 uses the tag bits to optimize operations.\nThe tags also detect stack overflow (storing to a non-empty stack register) or stack underflow (reading from\nan empty stack register).</p>\n<p>Other conditions are highly specialized. For instance, one condition looks at the rounding mode setting and\nthe sign of the value to determine if the value should be rounded up or down.\nOther conditions deal with exceptions such as numbers that are too small (i.e. denormalized) or numbers that\nlose precision.\nAnother condition tests if two values have the same sign or not.\nYet another condition tests if two values have the same sign or not, but inverts the result if the current\ninstruction is subtraction.\nThe simplest condition is simply \"true\", allowing an unconditional branch.</p>\n<p>For flexibility, conditions can be \"flipped\", either jumping if the condition is true or jumping if the condition is false.\nThis is controlled by bit P of the microcode.\nIn the circuitry, this is implemented by a gate that XORs the P bit with the condition. The result is that the\nstate of the condition is flipped if bit P is set.</p>\n<p>For a concrete example of how conditions are used, consider the\n<a href=\"https://raw.githubusercontent.com/a-mcego/granite/refs/heads/main/tools/8087mc/bin/8087mc_out.txt#:~:text=%230896%09AB%20%20%20%20%20%20I%20%20L%20N%20%20%09c094%09%2Bjmp%2D%3E%230898%20cond%3D0x0a%20opcode%261\">microcode routine</a>\nthat implements <code>FCHS</code> and <code>FABS</code>, the\ninstructions to change the sign and compute the absolute value, respectively.\nThese operations are almost the same (toggling the sign bit versus clearing the sign bit), so the same\nmicrocode routine handles both instructions, with a jump instruction to handle the difference.\nThe <code>FABS</code> and <code>FCHS</code> instructions were designed with identical opcodes,\nexcept that the bottom bit is set for <code>FABS</code>.\nThus, the microcode routine uses a condition that tests the bottom bit, allowing the routine to branch and\nchange its behavior for <code>FABS</code> vs <code>FCHS</code>.</p>\n<p>Looking at the relevant micro-instruction, it has the hex value\n<code>0xc094</code>, or in binary <code>110 000001 001010 0</code>.\nThe first three bits (ABC=110) specify the relative jump operation (100 would jump to a fixed target and 101 would\nperform a subroutine call.)\nBits D through I (<code>000010</code>) indicate the amount of the jump (+`). \nBits J through O (<code>001010</code>, hex 0a) specify the condition to test, in this case, the last bit of the instruction opcode.\nThe final bit (P) would toggle the condition if set, (i.e. jump if false).\nThus, for <code>FABS</code>, the jump instruction will jump ahead one micro-instruction.\nThis has the effect of skipping the next micro-instruction, which sets the appropriate sign bit for\n<code>FCHS</code>.</p>\n<h2>Conclusions</h2>\n<p>The 8087 performs floating-point operations much faster than the 8086 by using\nspecial hardware, optimized for floating-point.\nThe condition code circuitry is one example of this: the 8087\ncan test a complicated condition in a single operation.\nHowever, these complicated conditions make it much harder to understand the microcode.\nBut by a combination of examining the circuitry and looking at the micocode, we're making progress.\nThanks to the members of the \"Opcode Collective\" for their hard work, especially Smartest Blob and Gloriouscow.</p>\n<p>For updates, follow me on\n Bluesky (<a href=\"https://bsky.app/profile/righto.com\">@righto.com</a>),\nMastodon (<a href=\"https://oldbytes.space/@kenshirriff\">@kenshirriff@oldbytes.space</a>),\nor <a href=\"http://www.righto.com/feeds/posts/default\">RSS</a>.</p>\n<h2>Notes and references</h2>\n<div class=\"footnote\">\n<ol>\n<li id=\"fn:decode\">\n<p>The section of the die that I've labeled \"Microcode decode\" performs some of the microcode decoding, but\nlarge parts of the decoding are scattered across the chip, close to the circuitry that needs the signals.\nThis makes reverse-engineering the microcode much more difficult.\nI thought that understanding the microcode would be straightforward, just examining a block of decode circuitry.\nBut this project turned out to be much more complicated and I need to reverse-engineer the entire chip.&#160;<a class=\"footnote-backref\" href=\"#fnref:decode\" title=\"Jump back to footnote 1 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:pla\">\n<p>A PLA is a \"Programmable Logic Array\". It is a technique to implement logic functions with grids of transistors.\nA PLA can be used as a compressed ROM, holding data in a more compact representation.\n(Saving space was very important in chips of this era.)\nIn the 8087, PLAs are used to hold tables of microcode addresses.&#160;<a class=\"footnote-backref\" href=\"#fnref:pla\" title=\"Jump back to footnote 2 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:mux\">\n<p>Note that the multiplexer circuit selects the condition corresponding to the binary value of the bits.\nIn the example, bits 000110 (0x06) select condition 06.&#160;<a class=\"footnote-backref\" href=\"#fnref:mux\" title=\"Jump back to footnote 3 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:inputs\">\n<p>The five top-level multiplexer inputs correspond to bit patterns 00, 011, 10, 110, and 111.\nThat is, two inputs depend on bits J and K, while three inputs depend on bits J, K, and L.\nThe bit pattern 010 is unused, corresponding to conditions 0x10 through 0x17, which aren't implemented.&#160;<a class=\"footnote-backref\" href=\"#fnref:inputs\" title=\"Jump back to footnote 4 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:instructions\">\n<p>The 8087 acts as a co-processor with the 8086 processor.\nThe 8086 instruction set is designed so instructions with a special \"ESCAPE\" sequence in the top 5 bits\nare processed by the co-processor, in this case the 8087.\nThus, the 8087 receives a 16-bit instruction, but only the bottom 11 bits are usable.\nFor a memory operation, the second byte of the instruction is an 8086-style <a href=\"https://en.wikipedia.org/wiki/ModR/M\">ModR/M</a> byte.\nFor instructions that don't access memory, the second byte specifies more of the instruction and sometimes specifies the\nstack register to use for the instruction.</p>\n<p>The relevance of this is that the 8087's microcode engine uses the 11 bits of the instruction to determine\nwhich microcode routine to execute.\nThe microcode also uses various condition codes to change behavior depending on different bits of the\ninstruction.&#160;<a class=\"footnote-backref\" href=\"#fnref:instructions\" title=\"Jump back to footnote 5 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:swap\">\n<p>There is a complication with the tmpA and tmpB registers: they can be swapped with the micro-instruction\n\"ABC.EF\". \nThe motivation behind this is that if you have two arguments, you can use a micro-subroutine to load\nan argument into tmpA, swap the registers, and then use the same subroutine to load the second argument\ninto tmpA. The result is that the two arguments end up in tmpB and tmpA without any special coding in\nthe subroutine.</p>\n<p>The implementation doesn't physically swap the registers, but renames them internally, which is\nmuch more efficient.\nA flip-flop is toggled every time the registers are swapped. If the flip-flop is set, a request goes\nto one register, while if the flip-flop is clear, a request goes to the other register.\n(Many processors use the same trick. For instance, the Intel 8080 has an instruction to exchange the\nDE and HL registers. The Z80 has an instruction to swap register banks. In both cases, a flip-flop\nrenames the registers, so the data doesn't need to move.)&#160;<a class=\"footnote-backref\" href=\"#fnref:swap\" title=\"Jump back to footnote 6 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:conditions\">\n<p>The table below is the real meat of this post, the result of much circuit analysis. These details probably aren't\ninteresting to most people, so I've relegated the table to a footnote.\nDescriptions in italics are provided by Smartest Blob based on examination of the microcode.\nGrayed-out lines are unused conditions.</p>\n<p>The table has five sections, corresponding to the 5 inputs to the top-level condition multiplexer.\nThese inputs come from different parts of the chip, so the sections correspond to different categories of\nconditions.</p>\n<p>The first section consists of instruction parsing, with circuitry near the microcode engine.\nThe description shows the 11-bit opcode pattern that triggers the condition, with 0 bits and 1 bits as\nspecified, and X indicating a \"don't care\" bit that can be 0 or 1.\nWhere simpler, I list the relevant instructions instead.</p>\n<p>The next section indicates conditions on the exponent. I am still investigating these conditions, so\nthe descriptions are incomplete.\nThe third section is conditions on the temporary registers or conditions related to the control register.\nThese circuits are to the right of the microcode ROM.</p>\n<p>Conditions in the fourth section examine the floating-point bus, with circuitry near the bottom of the chip.\nConditions 34 and 35 use a special 16-bit bidirectional shift register, at the far right of the chip.\nThe top bit from the floating-point bus is shifted in. Maybe this shift register is used for CORDIC\ncalculations?\nThe conditions in the final block are miscellaneous, including the always-true condition 3e, which is used\nfor unconditional jumps.</p>\n<p>\n<table class=\"cond\">\n<tr><th>Cond.</th><th>Description</th></tr></p>\n<p><tr class=\"topborder\"><td>00</td><td>not XXX 11XXXXXX</td>\n<tr><td>01</td><td>1XX 11XXXXXX</td>\n<tr><td>02</td><td>0XX 11XXXXXX</td>\n<tr><td>03</td><td>X0X XXXXXXXX</td>\n<tr><td>04</td><td>not cond 07 or 1XX XXXXXXXX</td>\n<tr><td>05</td><td>not FLD/FSTP temp-real or BCD</td>\n<tr><td>06</td><td>110 xxxxxxxx or 111 xx0xxxxx</td>\n<tr><td>07</td><td>FLD/FSTP temp-real</td>\n<tr><td>08</td><td>FBLD/FBSTP</td>\n<tr class=\"unused\"><td>09</td><td><i></i></td>\n<tr><td>0a</td><td>XXX XXXXXXX1</td>\n<tr><td>0b</td><td>XXX XXXX1XXX</td>\n<tr><td>0c</td><td>FMUL</td>\n<tr><td>0d</td><td>FDIV FDIVR</td>\n<tr><td>0e</td><td>FADD FCOM FCOMP FCOMPP FDIV FDIVR FFREE FLD FMUL FST FSTP FSUB FSUBR FXCH</td>\n<tr><td>0f</td><td>FCOM FCOMP FCOMPP FTST</td>\n<tr class=\"unused\"><td>10</td><td><i></i></td>\n<tr class=\"unused\"><td>11</td><td><i></i></td>\n<tr class=\"unused\"><td>12</td><td><i></i></td>\n<tr class=\"unused\"><td>13</td><td><i></i></td>\n<tr class=\"unused\"><td>14</td><td><i></i></td>\n<tr class=\"unused\"><td>15</td><td><i></i></td>\n<tr class=\"unused\"><td>16</td><td><i></i></td>\n<tr class=\"unused\"><td>17</td><td><i></i></td>\n<tr class=\"topborder\"><td>18</td><td>exponent condition</td>\n<tr><td>19</td><td>exponent condition</td>\n<tr><td>1a</td><td>exponent condition</td>\n<tr><td>1b</td><td>exponent condition</td>\n<tr><td>1c</td><td>exponent condition</td>\n<tr><td>1d</td><td>exponent condition</td>\n<tr><td>1e</td><td>eight exponent zero bits</td>\n<tr><td>1f</td><td>exponent condition</td>\n<tr class=\"topborder\"><td>20</td><td>tmpA tag ZERO</td>\n<tr><td>21</td><td>tmpA tag SPECIAL</td>\n<tr><td>22</td><td>tmpA tag VALID</td>\n<tr><td>23</td><td><i>stack overflow</i></td>\n<tr><td>24</td><td>tmpB tag ZERO</td>\n<tr><td>25</td><td>tmpB tag SPECIAL</td>\n<tr><td>26</td><td>tmpB tag VALID</td>\n<tr><td>27</td><td><i>st(i) doesn't exist (A)?</i></td>\n<tr><td>28</td><td>tmpA sign</td>\n<tr><td>29</td><td>tmpB top bit</td>\n<tr><td>2a</td><td>tmpA zero</td>\n<tr><td>2b</td><td>tmpA top bit</td>\n<tr><td>2c</td><td>Control Reg bit 12: infinity control</td>\n<tr><td>2d</td><td>round up/down</td>\n<tr><td>2e</td><td>unmasked interrupt</td>\n<tr><td>2f</td><td>DE (denormalized) interrupt</td>\n<tr class=\"topborder\"><td>30</td><td>top reg bit</td>\n<tr class=\"unused\"><td>31</td><td><i></i></td>\n<tr><td>32</td><td>reg bit 64</td>\n<tr><td>33</td><td>reg bit 63</td>\n<tr><td>34</td><td>Shifted top bits, all zero</td>\n<tr><td>35</td><td>Shifted top bits, one out</td>\n<tr class=\"unused\"><td>36</td><td><i></i></td>\n<tr class=\"unused\"><td>37</td><td><i></i></td>\n<tr class=\"topborder\"><td>38</td><td>const latch zero</td>\n<tr><td>39</td><td>tmpA vs tmpB sign, flipped for subtraction</td>\n<tr><td>3a</td><td>precision exception</td>\n<tr><td>3b</td><td>tmpA vs tmpB sign</td>\n<tr class=\"unused\"><td>3c</td><td><i></i></td>\n<tr class=\"unused\"><td>3d</td><td><i></i></td>\n<tr><td>3e</td><td>unconditional</td>\n<tr class=\"unused\"><td>3f</td><td><i></i></td>\n</table></p>\n<p>This table is under development and undoubtedly has errors.&#160;<a class=\"footnote-backref\" href=\"#fnref:conditions\" title=\"Jump back to footnote 7 in the text\">&#8617;</a></p>\n</li>\n</ol>\n</div>",
  "id": "tag:blogger.com,1999:blog-6264947694886887540.post-52646111832574839"
}