{
  "title": "They made computers behave like annoying salesmen",
  "link": "https://rakhim.exotext.com/they-made-computers-behave-like-annoying-salesmen",
  "published": "Wed, 15 Jan 2025 00:00:00 GMT",
  "summary": "<p>Computers are precise machines. You can give a computer a precise command using an inhumane language, and it should perfome the command. It's not a human, and there is no point of treating it as one. The goal of humanizing user experience isn't to create an illusion of human interaction - it's to make these mechanical commands more accessible while preserving their precise, deterministic nature. </p>\n<p>UX designers and product managers of tech companies did a lot of damange to people's understanding of computers by making the software behave like a human; or to be more precise, behave like an annoying salesman. </p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/Mam8J5UIOOGzSAR80SsCi.png\" /></p>\n<p><em>(Image from &quot;<a href=\"https://blog.prototypr.io/not-now-a91c75ad35b6\">Not Now. Not later either</a>&quot; by Chris Oliver)</em></p>\n<p>We're all familiar with this type. After receiving a clear &quot;no thanks&quot; they deploy increasingly manipulative tactics to meet their &quot;always-be-closing&quot; quotas: &quot;Would this Wednesday work better?&quot; &quot;What would change your mind?&quot; This behavior is frustrating enough from actual salespeople - it's even worse when programmed into our software.</p>\n<p>(<a href=\"https://www.youtube.com/watch?v=GrhSLf0I-HM\">Corporate LLM training session circa 2025</a>)</p>\n<p>Personally, I can tolerate but deeply dislike software that pretends to have ulterior motives. Take YouTube, for instance. When I explicitly say &quot;Not interested&quot; to their damned shorts feature, I get this response:</p>\n<p><img alt=\"youtube web page with a message saying 'shelf will be hidden for 30 days'\" src=\"https://img.exotext.com/1/BRKRAYhSqywqHunBgXt0P.png\" /></p>\n<p>I understand that it's not the &quot;YouTube program&quot; having its own agency and making this decision - it's the team behind it, driven by engagement metrics and growth targets. But does the average user understand this distinction?</p>\n<p>The population (especially the younger generation, who never seen a different kind of technology at all) is being conditioned by the tech industry to accept that software should behave like an unreliable, manipulative human rather than a precise, predictable machine. They're learning that you can't simply tell a computer &quot;I'm not interested&quot; and expect it to respect that choice. Instead, you must engage in a perpetual dance of &quot;not now, please&quot; - only to face the same prompts again and again.</p>\n<hr />\n<p>Subscribe to my totally non-spammy occasional newsletter to get updates about my projects, ideas, and <del>deep insights</del> mildly interesting thoughts about technology and programming. <a href=\"https://buttondown.com/rakhim/archive/\">See archives</a>.</p>\n<form action=\"https://buttondown.com/api/emails/embed-subscribe/rakhim\" class=\"embeddable-buttondown-form\" method=\"post\" target=\"popupwindow\">\n  <input id=\"bd-email\" name=\"email\" type=\"email\" /> \n  <input style=\"margin-top: 0.5em;\" type=\"submit\" value=\"Subscribe\" />\n</form>",
  "id": "https://rakhim.exotext.com/they-made-computers-behave-like-annoying-salesmen"
}