{
  "title": "Pluralistic: Carney isn't a hero (and that's OK) (27 Jan 2026)",
  "link": "https://pluralistic.net/2026/01/27/i-want-to-do-it/",
  "published": "Tue, 27 Jan 2026 17:43:00 +0000",
  "summary": "Today's links Carney isn't a hero (and that's OK): There is nothing harder to stop than an idea whose time has come to pass. Hey look at this: Delights to delectate. Object permanence: Things My Girlfriend and I Have Argued About; AnarchistU; \"Monopolized\"; All bets are off. Upcoming appearances: Where to find me. Recent appearances: Where I've been. Latest books: You keep readin' em, I'll keep writin' 'em. Upcoming books: Like I said, I'll keep writin' 'em. Colophon: All the rest. Carney isn't a hero (and that's OK) (permalink) I blame novelists: it's only in prose that we get the illusion of telepathy, of being inside the mind of another. No wonder novelistic tales of political transformation focus on the moral fortitude of individual leaders. The problem is, it's a destructive lie. Sure, leaders sometimes exhibit moral fortitude and courage. But we can't rely on our leaders to be perfect &#8211; or even pretty good. The only reliable way to get the leadership we deserve is to force our leaders to follow us, by organizing in political blocs that mete out severe punishments when they betray us. Say what you will about the Tea Party, but boy, did they understand this. During the Obama years, any Republican that wavered from the party line was mercilessly tormented by Tea Party activists, who flooded their offices with calls and emails, showed up at their town halls, and at restaurants when they were trying to have dinner, and then they backed their primary opponents. The Tea Party years were a winnowing function for the GOP, and the only Republican politicians who survived were the ones who refused to compromise. This worked for them in world-historic ways. It was thanks to the Tea Party that the GOP was able to steal two Supreme Court seats, for example. Corporate Democrats use the Tea Party as an example of why we can't let the public into progressive politics. After all, corporate Dems already have control over Democratic politicians, and so any organized rank-and-file bloc threatens their ability to push elected politicians to pursue grotesque policies like supporting genocide in Gaza or showering billions on ICE: https://www.msn.com/en-us/news/politics/seven-democrats-just-voted-to-approve-ice-funding-full-list/ar-AA1ULAn7 The seven Dems who voted to fund ICE knew that they were doing something that would be wildly unpopular with the voters who sent them to DC, but they did it anyway, because they aren't afraid of those voters. They treat their voters as ambulatory wallets to be terrorized into donating small sums via relentless text messages about the impending end of democracy in America, even as they vote for the impending end of democracy in America. These seven lawmakers don't just need to be primaried: they need to be made an example of. Their names must be a curse. They must be confronted in public &#8211; long after they are out of office &#8211; by voters brandishing pictures of the people ICE murdered after receiving the funds they voted for. They must be haunted for this decision for the rest of their days. As Voltaire said, \"Sometimes you must execute an admiral to encourage the others.\" Here are their names: Tom Suozzi (New York) Henry Cuellar (Texas) Don Davis (North Carolina) Laura Gillen (New York) Jared Golden (Maine) Vicente Gonzalez (Texas) Marie Glusenkamp Perez (Washington) https://www.msn.com/en-us/news/politics/seven-democrats-just-voted-to-approve-ice-funding-full-list/ar-AA1ULAn7 Politicians &#8211; even the most unhinged and narcissistic ones &#8211; go through life attuned to public rage. Even Trump. Why else would Trump have ordered ICE Obergruppenführer Gregory Bovino \"home with his tail between his legs\"? https://prospect.org/2026/01/27/ice-greg-bovino-minneapolis-one-battle-after-another-sean-penn/ Counting on politicians to do the right thing out of principle is a loser's bet. Far more reliable is to bet on them doing the right thing because they're afraid of being cursed and humiliated and haunted by their betrayal to the end of their days. Don't be fooled by politicians and pearl-clutchers insisting that the norms fairy and \"comity\" are the only way to get things done. We are not in an era of reaching across the aisle in a spirit of public service. We are in the era of fascist goons murdering our neighbors in the street and then dancing a celebratory jig. We arrived at this juncture in large part because we accepted glaring bullshit about \"comity\": https://pluralistic.net/2021/01/30/meme-stocks/#comity This isn't merely frustrated militancy on my part. I'm hoping that you will join me in this understanding of politics: that good leadership is downstream of politicians being terrified of betraying their duty to the public, and we need not rely on moral perfection to make progress. Take the EU's energy transition. For decades, the EU's leaders &#8211; like leaders everywhere &#8211; were in thrall to the fossil fuel industry. They were fully paid-up members of the most extreme wing of the capitalist death cult, determined to render the only planet in the known universe capable of sustaining human life uninhabitable in order to enrich a tiny coterie of already ultrawealthy climate criminals. Then came the Russian invasion of Ukraine, and with it, a continent shivering in the dark, bereft of Russian gas and oil. Suddenly, the most powerful lobbyists in the history of civilization &#8211; fossil fuel pushers &#8211; lost their grip on Europe's leaders. In a few short years, Europe went from a decade behind its energy transition to a decade ahead: https://pluralistic.net/2025/09/23/our-friend-the-electron/#to-every-man-his-castle European politicians didn't just trip and find their spines. A continent full of frozen, furious people made yielding to the fossil fuel lobby unthinkable. Once the penalties for betraying the public inarguably exceeded any conceivable benefits from selling out to Big Oil, Big Oil ate shit. Which brings me to Canadian Prime Minister Mark Carney, a man who didn't so much win office as fail to lose it, after his Conservative opponent Pierre Poilievre saw a collapse in his poll numbers the instant Donald Trump (whom Poilievre had repeatedly associated himself with during the campaign) promised to turn Canada into \"the 51st state.\" Carney is hardly an avatar of progressive politics. As Governor of the Bank of England, he presided over a program of crushing austerity. As Canadian PM, he has fired tens of thousands of civil servants while promising billions to build out national AI so that our government can be handed over to hallucinating chatbots running on processors and software that we can only buy from companies that will do Trump's bidding. Having won office with an \"elbows up\" mandate to resist Trump, Carney proceeded to cave to Trump's demands on even modest measures, such as a plan to end rampant tax cheating by the US tech giants. And yet, earlier this month, Carney travelled to the World Economic Forum in Davos to deliver an extraordinary speech that declared a \"rupture\" in the \"international rules-based order,\" an order that he simultaneously declared to have been a sham all along: https://www.programmablemutter.com/p/davos-is-a-rational-ritual This is an incredibly weird (but good!) speech for Carney to have made. Carney is the epitome of \"Davos Man,\" a technocrat with a long history of using his office and power to inflict real suffering on working people in the name of abstract economic stability. This contradiction has been the source of much opnionating about whether a) Carney is sincere about this, and b) Carney can be trusted to follow through on it. The answers to this are obvious (to me, at least): a) Who cares if he's sincere, because b) He's shown that if he's frightened enough of the public's fury at his capitulation, he will locate his spine. Which means that the future of Carney's ambitious program of \"rupture\" and bold effort to isolate Trump and the USA will depend on our ability to force him to make good on his promises. That means that we have to \"stand on guard\" &#8211; to give no ground to Canadian \"moderates\" who counsel against bold action to defend the country from Trump, lest this make Trump mad. The idea that we can strike a bargain with Trump is indisputably, profoundly stupid. Yet for the past year a sizable fraction of Canada's great and good have been able to insist, in public, that Trump will bargain with us in good faith. Trump undeniably, provably, treats any concession as weakness. He will break his word in a heartbeat. The more we appease him, the more he will demand of us. Any Canadian politician or opinion-former who even hints that we can \"make a deal\" with Trump should be treated as a dangerous lunatic to be isolated and shunned (the only exception being that any time they show their faces in public, they should be relentlessly bollocked for their nation-risking program of appeasement to a fascist madman). Give Trump a centimetre and he'll take a mile. Give him two centimetres and he'll take Greenland. Give him three centimetres and he'll grab Alberta, too. Anyone who insists that Canada should confine itself to ornamental gestures of resistance to Trump (because anything that truly matters will make him mad) is a danger to themselves and the country. This all goes double for people aligned with other national parties: the way we get Carney to live up to his Davos speech is by pouncing any time he even hints that he might go back on his word, poaching his voters by campaigning on a promise to live up the Carney Doctrine (even if Carney won't). Promising to live up to Carney's Davos speech (even if Carney won't) must be the central issue in every by-election and provincial race between now and the next federal election. When we talk about politics and especially political change, there's often talk of \"political will.\" Politicians who break with their own record of weakness and compromise are said to be propelled by \"political will.\" It's all very abstract sounding, but at root, political will is something quite tangible &#8211; it's merely invisible until something gets in its way. Think of political will as something like the wind. You can't tell how windy it is outside unless there's something in the path of the wind, and then it's obvious. For the past decade, there has been a growing worldwide political will blowing for an end to corporate and billionaire power: https://pluralistic.net/2025/06/28/mamdani/#trustbusting It's easy to feel like the project of taking our world back from oligarchs has been becalmed in a windless doldrums for decades. The political will is like the wind: we only see it when something gets in its path. After generations of Davos-style oligarch worship, there are damned few politicians who dare to unfurl a sail and aim the tiller for a world that works for working people. But every time some politician does, that sail bellies out with the wind with an audible snap. These politicians are lionized and lauded for their bravery, and any betrayal is met with bitter recriminations that go on and on and on. Any ship rigged for a better future is propelled by a wind that is a fiercer gale than any we've seen for generations. That's where we all fit in. I'm not asking you to credulously accept Carney's conversion at face value. Rather, I'm asking that you celebrate the vision that Carney articulated while threatening to destroy his political life if he breaks his word. Let every politician know that there is glory in standing up for us &#8211; and let them know that betrayal will see them tossed overboard, to drown in our wake. Hey look at this (permalink) Deaths, detentions and deportations of American citizens in the second Trump administration (h/t Molly White) https://en.wikipedia.org/wiki/Deaths,_detentions_and_deportations_of_American_citizens_in_the_second_Trump_administration Hate Has to Scatter When Minneapolis Arises https://www.hamiltonnolan.com/p/hate-has-to-scatter-when-minneapolis Trump Is Proving Democratic Presidents Weren’t Powerless https://jacobin.com/2026/01/trump-obama-biden-executive-power Charter accused of backdoor attack against fixed wireless (h/t Mitch Wagner) https://www.fierce-network.com/broadband/cables-future-dims-charter-plotting-backdoor-attack-against-fixed-wireless The New Satanic Panic Is Here https://www.usermag.co/p/the-new-satanic-panic-is-here Object permanence (permalink) #25yrsago Things My Girlfriend and I Have Argued About https://web.archive.org/web/20010604131027/http://homepage.ntlworld.com/mil.millington/things.html #20yrsago Law enforcement professionals against the war on drugs https://web.archive.org/web/20060202103138/http://leap.cc/ #20yrsago How DRM tries to resist uninstalling https://blog.citp.princeton.edu/2006/01/29/cd-drm-unauthorized-deactivation-attacks/ #15yrsago EFF: FBI may have committed more than 40K intelligence violations since 9/11 https://www.eff.org/deeplinks/2011/01/eff-releases-report-detailing-fbi-intelligence #15yrsago AnarchistU Toronto: free school classes for February https://web.archive.org/web/20110126075027/https://anarchistu.org/ #10yrsago Florida climate survivors travel to New Hampshire to confront Marco Rubio https://web.archive.org/web/20160201193104/https://act.climatetruth.org/sign/climatevoices2016_videoandpetition/?source=BB #10yrsago Elizabeth Warren’s new 1%: the percentage of fraudulent profits companies pay in fines https://web.archive.org/web/20160129113016/https://theintercept.com/2016/01/29/elizabeth-warren-challenges-clinton-sanders-to-prosecute-corporate-crime-better-than-obama/ #5yrsago David Dayen's MONOPOLIZED https://pluralistic.net/2021/01/29/fractal-bullshit/#dayenu #1yrago All bets are off https://pluralistic.net/2025/01/29/which-side-are-you-on-2/#strike-three-yer-out Upcoming appearances (permalink) Ottawa: Enshittification at Perfect Books, Jan 28 https://www.instagram.com/p/DS2nGiHiNUh/ Toronto: Enshittification and the Age of Extraction with Tim Wu, Jan 30 https://nowtoronto.com/event/cory-doctorow-and-tim-wu-enshittification-and-extraction/ Salt Lake City: Enshittification at the Utah Museum of Fine Arts (Tanner Humanities Center), Feb 18 https://tanner.utah.edu/center-events/cory-doctorow/ Victoria: 28th Annual Victoria International Privacy &#38; Security Summit, Mar 3-5 https://www.rebootcommunications.com/event/vipss2026/ Berkeley: Bioneers keynote, Mar 27 https://conference.bioneers.org/ Berlin: Re:publica, May 18-20 https://re-publica.com/de/news/rp26-sprecher-cory-doctorow Berlin: Enshittification at Otherland Books, May 19 https://www.otherland-berlin.de/de/event-details/cory-doctorow.html Hay-on-Wye: HowTheLightGetsIn, May 22-25 https://howthelightgetsin.org/festivals/hay/big-ideas-2 Recent appearances (permalink) How the Internet Got Worse (Masters in Business) https://www.youtube.com/watch?v=auXlkuVhxMo Enshittification (Jon Favreau/Offline): https://crooked.com/podcast/the-enshittification-of-the-internet-with-cory-doctorow/ Why Big Tech is a Trap for Independent Creators (Stripper News) https://www.youtube.com/watch?v=nmYDyz8AMZ0 Enshittification (Creative Nonfiction podcast) https://brendanomeara.com/episode-507-enshittification-author-cory-doctorow-believes-in-a-new-good-internet/ Enshittification with Plutopia https://plutopia.io/cory-doctorow-enshittification/ Latest books (permalink) \"Canny Valley\": A limited edition collection of the collages I create for Pluralistic, self-published, September 2025 \"Enshittification: Why Everything Suddenly Got Worse and What to Do About It,\" Farrar, Straus, Giroux, October 7 2025 https://us.macmillan.com/books/9780374619329/enshittification/ \"Picks and Shovels\": a sequel to \"Red Team Blues,\" about the heroic era of the PC, Tor Books (US), Head of Zeus (UK), February 2025 (https://us.macmillan.com/books/9781250865908/picksandshovels). \"The Bezzle\": a sequel to \"Red Team Blues,\" about prison-tech and other grifts, Tor Books (US), Head of Zeus (UK), February 2024 (thebezzle.org). \"The Lost Cause:\" a solarpunk novel of hope in the climate emergency, Tor Books (US), Head of Zeus (UK), November 2023 (http://lost-cause.org). \"The Internet Con\": A nonfiction book about interoperability and Big Tech (Verso) September 2023 (http://seizethemeansofcomputation.org). Signed copies at Book Soup (https://www.booksoup.com/book/9781804291245). \"Red Team Blues\": \"A grabby, compulsive thriller that will leave you knowing more about how the world works than you did before.\" Tor Books http://redteamblues.com. \"Chokepoint Capitalism: How to Beat Big Tech, Tame Big Content, and Get Artists Paid, with Rebecca Giblin\", on how to unrig the markets for creative labor, Beacon Press/Scribe 2022 https://chokepointcapitalism.com Upcoming books (permalink) \"Unauthorized Bread\": a middle-grades graphic novel adapted from my novella about refugees, toasters and DRM, FirstSecond, 2026 \"Enshittification, Why Everything Suddenly Got Worse and What to Do About It\" (the graphic novel), Firstsecond, 2026 \"The Memex Method,\" Farrar, Straus, Giroux, 2026 \"The Reverse-Centaur's Guide to AI,\" a short book about being a better AI critic, Farrar, Straus and Giroux, June 2026 Colophon (permalink) Today's top sources: Currently writing: \"The Post-American Internet,\" a sequel to \"Enshittification,\" about the better world the rest of us get to have now that Trump has torched America (1004 words today, 15484 total) \"The Reverse Centaur's Guide to AI,\" a short book for Farrar, Straus and Giroux about being an effective AI critic. LEGAL REVIEW AND COPYEDIT COMPLETE. \"The Post-American Internet,\" a short book about internet policy in the age of Trumpism. PLANNING. A Little Brother short story about DIY insulin PLANNING This work &#8211; excluding any serialized fiction &#8211; is licensed under a Creative Commons Attribution 4.0 license. That means you can use it any way you like, including commercially, provided that you attribute it to me, Cory Doctorow, and include a link to pluralistic.net. https://creativecommons.org/licenses/by/4.0/ Quotations and images are not included in this license; they are included either under a limitation or exception to copyright, or on the basis of a separate license. Please exercise caution. How to get Pluralistic: Blog (no ads, tracking, or data-collection): Pluralistic.net Newsletter (no ads, tracking, or data-collection): https://pluralistic.net/plura-list Mastodon (no ads, tracking, or data-collection): https://mamot.fr/@pluralistic Medium (no ads, paywalled): https://doctorow.medium.com/ Twitter (mass-scale, unrestricted, third-party surveillance and advertising): https://twitter.com/doctorow Tumblr (mass-scale, unrestricted, third-party surveillance and advertising): https://mostlysignssomeportents.tumblr.com/tagged/pluralistic \"When life gives you SARS, you make sarsaparilla\" -Joey \"Accordion Guy\" DeVilla READ CAREFULLY: By reading this, you agree, on behalf of your employer, to release me from all obligations and waivers arising from any and all NON-NEGOTIATED agreements, licenses, terms-of-service, shrinkwrap, clickwrap, browsewrap, confidentiality, non-disclosure, non-compete and acceptable use policies (\"BOGUS AGREEMENTS\") that I have entered into with your employer, its partners, licensors, agents and assigns, in perpetuity, without prejudice to my ongoing rights and privileges. You further represent that you have the authority to release me from any BOGUS AGREEMENTS on behalf of your employer. ISSN: 3066-764X",
  "id": "https://pluralistic.net/?p=12322"
}