{
  "title": "NixCon 2025 Trip Report 🐝",
  "link": "https://michael.stapelberg.ch/posts/2025-09-21-nixcon-2025-trip-report/",
  "published": "2025-09-21T09:34:00+02:00",
  "summary": "<p>I liked the NixOS meetup earlier this year, and at the end of the meetup they\ntold everyone about NixCon 2025, which would be happening in Switzerland this\nyear, at the very same location, the <a href=\"https://www.ost.ch/\">University Of Applied Sciences\nOST</a> in Rapperswil, so I decided to go! In this trip\nreport, I want to give you a rough impression of how I experienced this awesome\nconference :)</p>\n<p><em>The bee in the title is a NixCon inside joke ;)</em></p>\n<h2 id=\"friday\">Friday</h2>\n<p>I arrived at about 09:30 on a rainy Friday morning, meaning I hurried from the\ntrain station into OST building 1 to show my ticket QR code and pick up my\nconference badge and custom name tag that I pre-ordered. The custom ones have\nyour name engraved and come with a strong magnet to attach them to your clothes:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<a href=\"https://michael.stapelberg.ch/posts/2025-09-21-nixcon-2025-trip-report/IMG_5775.jpg\"><img alt=\"regular and custom name tag\" height=\"450\" src=\"https://michael.stapelberg.ch/posts/2025-09-21-nixcon-2025-trip-report/IMG_5775_hu_f608afe3d2f3ee1.jpg\" style=\"border: 1px solid #000;\" title=\"regular and custom name tag\" width=\"600\" /></a>\n\n\n\n<p>After grabbing a bite to eat, I headed to the main lecture hall for the opening\nsession. <a href=\"https://www.ost.ch/en/person/farhad-d-mehta-8699\">Prof. Dr. Farhad\nMehta</a> from OST, as well as\nthe entire NixCon orga team, welcomed the 450 registered attendees to the 10th\nNixCon! I recognized many familiar faces from the Nix meetup, but many hands\nwent up when the audience was asked for whom it was the first time at NixCon, or\nin Switzerland in general.</p>\n<p>I want to thank Prof. Mehta in particular for making possible such meetups and\nevents! 👏</p>\n<p>If you work at a university, school or other organisation that has access to\nrooms, consider offering to host a meetup (on a regular basis, or even just\nonce)! Locations are always hard to find, so offering a space is a great\ncontribution to Open Source.</p>\n<h3 id=\"what-if-github-actions-were-local-first-and-built-using-nix\">“What if GitHub Actions were local-first and built using Nix?”</h3>\n<p>The first technical talk of the day was “What if GitHub Actions were local-first\nand built using Nix?” by Domen Kožar, the person behind\n<a href=\"https://cachix.org\">cachix.org</a>, which is a hosted Nix cache. The talk pitched\n<a href=\"https://cloud.devenv.sh/\">cloud.devenv.sh</a>, which is a Nix-based CI solution\n(like GitHub Actions) using <a href=\"https://devenv.sh/\">devenv</a>.</p>\n<p>By using this solution, you solve the problem that you can’t easily / completely\nrun GitHub Actions locally (yes, we all know about\n<a href=\"https://github.com/nektos/act\">act</a>), and you get to (?) write Nix configs\ninstead of YAML configs.</p>\n<p>The solution seems nice, but I found the talk a little unstructured because the\npresenter jumped around between slides so much. One crucial question was left\nunanswered: How do you integrate this custom solution with your GitHub projects?\nTo me, diverging from the default way of configuring GitHub Actions does not\nseem worth it for my projects. YMMV.</p>\n<p><a href=\"https://media.ccc.de/v/nixcon2025-56408-what-if-github-actions\">→ watch the recording (46 minutes) on\nmedia.ccc.de</a></p>\n<h3 id=\"rewriting-the-hydra-queue-runner-in-rust\">“Rewriting the Hydra Queue Runner in Rust”</h3>\n<p>Next up: “Rewriting the Hydra Queue Runner in Rust” by Simon Hauser from\n<a href=\"https://helsinki-systems.de/\">Helsinki Systems</a>, a small German software\ncompany. <a href=\"https://github.com/NixOS/hydra\">Hydra</a> is the component in the\nNixOS infrastructure which schedules builds: when nixpkgs changes, this is\nthe component that runs the build whose result ends up on\n<a href=\"https://cache.nixos.org\">cache.nixos.org</a> (the Debian equivalent is\n<a href=\"https://wiki.debian.org/buildd\">buildd</a>).</p>\n<p>Simon explained that bottlenecks in the current queue runner result in\nstranding of infrastructure: the project has machines available that it\ncannot use fully. He outlined how they replaced a crufty SSH-based automation\nwith a well-designed gRPC protocol. I got the impression that a group of\npeople was involved in developing and reviewing this design, which is a great\nsign for a healthy project.</p>\n<p>One thing that was unfortunately missing from the talk were metrics. It would\nhave been great to see a few graphs that illustrate just how much better the\nrewritten queue runner is.</p>\n<p>Currently, the new queue runner is already used for Nix Community builds, but\nnot yet in production for NixOS itself. Hopefully soon, though!</p>\n<p><a href=\"https://media.ccc.de/v/nixcon2025-56409-rewriting-the-hydra-que\">→ watch the recording (27 minutes) on\nmedia.ccc.de</a></p>\n<h3 id=\"you-cant-spell-devshell-without-hell\">“You can&rsquo;t spell &ldquo;devshell&rdquo; without &ldquo;hell&rdquo;”</h3>\n<p>This talk was presented by Zach Mitchell from <a href=\"https://flox.dev/\">Flox</a>, which\nis a Nix-based dev environment solution. Thus far, I use <code>nix-shell</code> or <code>nix develop</code> (see <a href=\"/posts/2025-07-27-dev-shells-with-nix-4-quick-examples/\">Development shells with Nix: four quick\nexamples</a>), so I was\ncurious what I’d learn from this talk.</p>\n<p>Zach explained that both, <code>nix-shell</code> and <code>nix develop</code> were originally\nwritten to debug Nix package builds, not to provide general-purpose\ndevelopment environments. For users, this manifests as not being able to use\nyour favorite shell — <code>nix develop</code> only supports Bash. One might read about\n<code>nix develop -c exec &lt;shell&gt;</code>, but that’s wrong, because then the shell’s RC\nfiles run <strong>after</strong> Nix setup, possibly destroying parts of the setup.</p>\n<p>One interesting thing I learnt is that the Nix garbage collector scans\n<code>/proc</code> to avoid removing Nix store paths that are still needed by running\nprocesses.</p>\n<p>Zach mentioned <a href=\"https://github.com/zmitchell/proctrace\">https://github.com/zmitchell/proctrace</a>, which is a\nbpftrace-based profiler that tracks forks/execs and generates gantt chart\nsyntax of the timing. Sounds cool, but is unfortunately broken right now…?\nToo bad.</p>\n<p><a href=\"https://media.ccc.de/v/nixcon2025-56410-you-cant-spell-devshell\">→ watch the recording (45 minutes) on\nmedia.ccc.de</a></p>\n<h3 id=\"the-nix-binary-cache-and-aws\">“The Nix Binary Cache and AWS”</h3>\n<p>In this fireside chat, Tarus Balog shared how he ended up at AWS after 20 years\nof Open Source, and how his team wants to give back to the community. One\nspecific way in which they’re doing that is by hosting cache.nixos.org.</p>\n<p><a href=\"https://media.ccc.de/v/nixcon2025-56403-the-nix-binary-cache-an\">→ watch the recording (24 minutes) on\nmedia.ccc.de</a></p>\n<h3 id=\"nix-based-development-environments-at-shopify-reprise\">“Nix-based development environments at Shopify (reprise)”</h3>\n<p>Josh Heinrichs from Shopify shared how they adopted Nix (again!), and I think\nreal-world enterprise adoption stories like these are very interesting.</p>\n<p>In summary, Shopify had a <code>dev</code> command (since 2016), which offered declarative\nconfiguration and then dispatched to <code>apt</code> (Linux) or <code>homebrew</code> (macOS). In the\nfirst attempt to move to Nix, the effort didn’t reach stable footing (some folks\ncouldn’t use it yet) and then a company-wide shift to cloud development\nhappened, where the easier solution was to “just use ubuntu”.</p>\n<p>A few years in, folks are apparently not so happy with the cloud development\nenvironments and one day, Shopify CEO <a href=\"https://en.wikipedia.org/wiki/Tobias_L%C3%BCtke\">Tobias\nLütke</a> finds\n<a href=\"https://devenv.sh\">devenv</a>, which is a Nix-based solution that is remarkably\nsimilar to Shopify’s <code>dev</code>. So Tobi adopts devenv for one of their services and\nbecomes supportive of using Nix. This time around, they spend a lot more time on\na successful rollout within the organization, meaning incremental adoption,\ngetting all stakeholders on board, etc.</p>\n<p>The takeaway is that one specific, well-supported use-case can be the adoption\ndriver. And once you have your development environments on a Nix-based solution,\nyou can more easily adopt other parts of the ecosystem as well.</p>\n<p><a href=\"https://media.ccc.de/v/nixcon2025-56413-nix-based-development-e\">→ watch the recording (19 minutes) on\nmedia.ccc.de</a></p>\n<h3 id=\"my-first-nix-aha-a-newcomers-perspective\">“My first Nix Aha!: A Newcomer’s Perspective”</h3>\n<p>In a similar spirit to the Shopify talk, Kavisha Kumar from ASML shared how she\ngot into Nix after seeing a colleague use <code>nix-shell</code> to obtain a clean\ndevelopment shell.</p>\n<p>Kavisha spent a lot of time at ASML to teach others about why and how to use\nNix. She shared a number of nice metaphors that explained Nix concepts through\nthe subject area of video gaming.</p>\n<p>I think many people are excited about Nix, but have trouble conveying that\nexcitement to others. Kavisha showed us a good way that worked for her.</p>\n<p><a href=\"https://media.ccc.de/v/nixcon2025-56414-my-first-nix-aha-a-newc\">→ watch the recording (19 minutes) on\nmedia.ccc.de</a></p>\n<h3 id=\"lightning-talks\">Lightning Talks</h3>\n<p>The rest of the day was filled with lightning talks.</p>\n<p>Cole Mickens from <a href=\"https://determinate.systems/\">Determinate Systems</a> explained\nwhat features they are currently shipping in their downstream distribution\n“Determinate Nix” (features will be upstreamed): lazy trees (a performance\noptimization for evaluating Flakes), parallel evaluation (brings evaluation\ntimes down from 16s to 7s) and a native Linux builder for mac. Next up are Flake\nSchemas, which I haven’t read about yet.</p>\n<p>Yvan Sraka from <a href=\"https://numtide.com/\">Numtide</a>, a Nix and DevOps consultancy,\nshowed how he manages Linux machines for friends and family with NixOS. He has\nhis own configuration layer on top of NixOS and only uses the system as a\nbase. Most actual programs are used through AppImage, Flatpaks,\n<a href=\"https://github.com/Mic92/envfs\">envfs</a> and\n<a href=\"https://github.com/nix-community/nix-ld\">nix-ld</a>. The latter two are solutions\nto use FHS based programs (those that expect <code>/usr/bin</code> and other standard\nlocations to be present) on non-FHS systems like NixOS. I had heard of nix-ld\nbefore, but not of envfs.</p>\n<p>Jacek Galowicz from <a href=\"https://nixcademy.com\">Nixcademy</a> showed how to use\nsystemd-sysupdate and systemd-repart to implement A/B style updates with NixOS\nand systemd. It’s great to see that this technique is more and more mainstream,\nas I am also using A/B style updating successfully in\n<a href=\"https://gokrazy.org/\">gokrazy</a>.</p>\n<h2 id=\"saturday\">Saturday</h2>\n<p>The weather on Saturday was a lot better, so I made sure to get a seat with a\nview of Lake Zürich:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<a href=\"https://michael.stapelberg.ch/posts/2025-09-21-nixcon-2025-trip-report/IMG_5754.jpg\"><img alt=\"lake view!\" height=\"450\" src=\"https://michael.stapelberg.ch/posts/2025-09-21-nixcon-2025-trip-report/IMG_5754_hu_91ced09efd5ff807.jpg\" style=\"border: 1px solid #000;\" title=\"lake view!\" width=\"600\" /></a>\n\n\n\n<h3 id=\"the-bikes-have-been-shed-the-official-nix-formatter\">“The bikes have been shed: The official Nix formatter”</h3>\n<p>In this talk, Silvan Mosberger from Tweag (and one of the main NixCon\norganizers!), explains how the official formatting tool for .nix files came to\nbe.</p>\n<p>I was delighted to hear <code>gofmt</code>, the official Go formatter, being mentioned as a\nsource of inspiration. Just like in other language ecosystems, introducing\nuniform formatting eliminates time-consuming back-and-forth in code review over\nadhering to coding style. Unfortunately, the formatting folks did not replicate\none key aspect to gofmt’s success: gofmt has no options. As the famous Go\nproverb goes:</p>\n<blockquote>\n<p>Gofmt&rsquo;s style is no one&rsquo;s favorite, yet gofmt is everyone&rsquo;s favorite!</p>\n</blockquote>\n<p>Meaning that it’s more important that everyone uses the same style, compared to\neveryone being able to express their personal style preferences.</p>\n<p><a href=\"https://media.ccc.de/v/nixcon2025-56375-the-bikes-have-been-she\">→ watch the recording (20 minutes) on\nmedia.ccc.de</a></p>\n<h3 id=\"mastering-nixos-integration-tests-advanced-techniques-for-fast-and-robust-multi-vm-tests\">“Mastering NixOS Integration Tests: Advanced Techniques for Fast and Robust Multi-VM Tests”</h3>\n<p>In this two-hour workshop, Jacek Galowicz from\n<a href=\"https://nixcademy.com\">Nixcademy</a>, who is not only a Nix teacher, but also\nhappens to be the maintainer of the NixOS integration test driver, shows us how\nto write complex integration tests with a few lines of Nix and Python.</p>\n<p>Jacek showed an integration test example: a Bittorrent service, consisting of\ntracker, clients, firewalls and multiple networks! Nixpkgs contains over 1000\nsuch integration tests, and running one on your laptop is easy.</p>\n<p>The various ways to debug your tests seem pretty cool: using vsock instead of\nport forwardings, and enabling a debug hook that will make a failed test hang\nand wait to be debugged.</p>\n<p>I thought this was a great overview and Jacek is an engaging teacher. I would\nrecommend booking his classes!</p>\n<h3 id=\"when-not-to-nix-working-with-external-config-and-sops-nix\">“When Not to Nix: Working with External Config and SOPS Nix”</h3>\n<p>Ryota spoke about when to use Nix and when not to use Nix. For example, you\ncould manage your dotfiles (config files) with Nix, or you could decide not\nto. Having recently migrated more and more machines and configurations to Nix, I\nfound myself agreeing with this talk: It’s important to understand what you’ll\nget out of declaratively or statefully managed configs, and when which approach\nis better.</p>\n<p><a href=\"https://media.ccc.de/v/nixcon2025-56381-when-not-to-nix-working\">→ watch the recording (19 minutes) on\nmedia.ccc.de</a></p>\n<h3 id=\"lightning-talks-1\">Lightning Talks</h3>\n<p>The rest of the day I spent in lightning talks, some of which were sponsored\ntalk slots. I learnt about, in no particular order:</p>\n<ul>\n<li><a href=\"https://www.cloudhypervisor.org/\">Cloud Hypervisor</a>, a KVM based hypervisor like qemu, but written in Rust.</li>\n<li><a href=\"https://nixbuild.net/\">nixbuild.net</a>, a pay-as-you-go offering for extra\nbuild capacity you can rent. On Sunday I heard someone say that their company\nis using nixbuild.net and it’s very smooth.</li>\n<li><a href=\"https://nix-ci.com/\">NixCI</a>, a Nix-based hosted CI. So, the cloud.devenv.sh\nservice we heard about on Friday is a competitor to this service.</li>\n<li><a href=\"https://flox.dev/nixinthewild/\">Nix in the Wild</a> is an effort by Flox where\nthey do 45-60 minute interviews about Nix success stories. This might help you\nconvince folks in your organization.</li>\n<li><a href=\"https://clan.lol\">clan</a> is a fleet management solution.</li>\n<li><a href=\"https://novacustom.com/\">NovaCustom</a>, a one-person laptop/PC company. The\nlaptops come with coreboot and work with NixOS.</li>\n<li>ExpressVPN is migrating their internal server setup (TrustedServer) from\nDebian to NixOS! Deploying weekly in 105+ countries.</li>\n<li>Cyberus, a German company, is offering NixOS LTS releases, compliant with the\nEU Cyber Resilience Act obligations.</li>\n<li>David’s <a href=\"https://github.com/dnr/styx\">styx</a> project is a more\nbandwidth-efficient download mechanism for NixOS updates. This uses\n<a href=\"https://en.wikipedia.org/wiki/EROFS\">EROFS</a>, which seems like an interesting\nalternative to SquashFS images.</li>\n</ul>\n<p>After all the talks, we met outside for a group picture followed by barbecue at\nthe lake:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<a href=\"https://michael.stapelberg.ch/posts/2025-09-21-nixcon-2025-trip-report/NixCon2025_arik-grahl.de_CC-BY-SA-4.0-3200w-featured.jpg\"><img alt=\"NixCon 2025 group picture\" height=\"400\" src=\"https://michael.stapelberg.ch/posts/2025-09-21-nixcon-2025-trip-report/NixCon2025_arik-grahl.de_CC-BY-SA-4.0-3200w-featured_hu_8ba18aa31755731f.jpg\" style=\"border: 1px solid #000;\" title=\"NixCon 2025 group picture\" width=\"600\" /></a>\n\n\n\n<p><em>NixCon 2025 by Arik Grahl. Licensed under CC BY-SA 4.0.</em></p>\n<h2 id=\"sunday\">Sunday</h2>\n<p>Before the conference, I wasn’t sure if I would even bother showing up for\nSunday (Hack day), but on Sunday, I was like “of course!”, and it was a great\ndecision!</p>\n<p>Many people were still around and were working on their projects. It felt like\nthe answer to any Nix question was just one chat message away — there was\nexpertise and helping hands from many parts of the project.</p>\n<p>I ended up meeting a couple of people I only knew from online interactions\nbefore, and we also talked a lot about meetups. Now, I am invited to multiple\nmeetups to give a talk :D</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>This was a wonderful conference! The orga team and all contributors did a great\njob!</p>\n<p>As always, the OST in Rapperswil is a great venue for Open Source events.</p>\n<p>Ticket sales and talk submission / scheduling were done using the\n<a href=\"http://pretix.eu/\">Pretix</a> and <a href=\"https://pretalx.com/p/about/\">Pretalx</a> Open\nSource systems, which makes me proud to have contributed to Pretix.</p>\n<p>The selection of talks was great: Some deeply technical, some covering only the\nhuman side of things, and many somewhere in between. I got the impression that\nall the presenters I saw genuinely cared about their topic, so the overall\nenergy was very good!</p>\n<p>(You can watch the talk recordings at <a href=\"https://media.ccc.de/c/nixcon2025\">media.ccc.de: NixCon\n2025</a>.)</p>\n<p>Also outside of the talks, I had many friendly interactions and interesting\nconversations. There is a lot of interest and adoption of Nix, which is great to\nsee!</p>\n<p>The production level of the conference was <em>very high</em> for such a\nvolunteer-driven event. For example, the very cool sounding break music between\ntalks was created specifically for NixCon: <a href=\"https://tonstrstudio.bandcamp.com/album/lava\">“Lava” by\ntonstr.studio</a>. Similarly, the\nwelcome bag contained dark Swiss chocolate, specifically made for NixCon (see\npicture below). I don’t even like dark chocolate, but this one was delicious!</p>\n<p>Thanks again to all helpers, and I look forward to coming back soon!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<a href=\"https://michael.stapelberg.ch/posts/2025-09-21-nixcon-2025-trip-report/IMG_5755.jpg\"><img alt=\"NixCon 2025 Swiss chocolate\" height=\"800\" src=\"https://michael.stapelberg.ch/posts/2025-09-21-nixcon-2025-trip-report/IMG_5755_hu_8736ee28b37b1d95.jpg\" style=\"border: 1px solid #000;\" title=\"NixCon 2025 Swiss chocolate\" width=\"600\" /></a>",
  "id": "https://michael.stapelberg.ch/posts/2025-09-21-nixcon-2025-trip-report/"
}