{
  "title": "HN Popularity Contest",
  "link": "https://refactoringenglish.com/tools/hn-popularity/methodology/",
  "published": "Thu, 13 Mar 2025 00:00:00 +0000",
  "summary": "<h2 id=\"what-counts-as-a-personal-blog\">What counts as a personal blog?</h2>\n<ul>\n<li>I count a site as a personal blog if:\n<ul>\n<li>the site contains written content (not just an app or a video)</li>\n<li>the site is authored by a single person</li>\n</ul>\n</li>\n<li>A blog still counts as a personal blog even if the blogger is a professional journalist (e.g., <a href=\"https://krebsonsecurity.com/\">Brian Krebs</a>) or blogging on their company&rsquo;s website (e.g., <a href=\"https://devblogs.microsoft.com/oldnewthing/\">Raymond Chen</a>).</li>\n<li>Social media (Twitter / Mastodon) doesn&rsquo;t count as a personal blog.</li>\n<li>Podcasts websites count as blogs if they&rsquo;re hosted by a single person and are independently owned.</li>\n<li>I exclude github.com links even though some people post blogs there.\n<ul>\n<li>It&rsquo;s too hard to filter out all the non-blog links to github.com.</li>\n<li>Pages under the <code>github.io</code> domain are eligible.</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"aggregating-scores\">Aggregating scores</h2>\n<ul>\n<li>I aggregate scores across all submissions that received a score of at least 20 and are not dead or deleted.\n<ul>\n<li>e.g., If a single link was submitted 100 times and never scored at least 20, none of those submissions would increase the aggregate score for the domain.</li>\n</ul>\n</li>\n<li>Duplicate submissions of the same URL all count as long as each submission received at least 20 points.</li>\n<li>I aggregate together domains when the author moved domains as long as the new domain is the canonical URL for the old content.\n<ul>\n<li>e.g., all submissions from <code>christine.website</code> count towards <code>xeiaso.net</code>, their new canonical URL.</li>\n</ul>\n</li>\n<li>I do not aggregate together blogs by the same author at different domains if they contain distinct content.\n<ul>\n<li>e.g., <code>kalzumeus.com</code> and <code>bitsaboutmoney.com</code> count separately, even though Patrick McKenzie is the author of both.</li>\n</ul>\n</li>\n<li>To reduce the size of the dataset, I only include domains that have accumulated at least 500 points across all submissions.</li>\n</ul>\n<h2 id=\"update-frequency\">Update frequency</h2>\n<p>The data automatically updates on the second day of each month, but I sometimes do out of band updates.</p>",
  "id": "https://refactoringenglish.com/tools/hn-popularity/methodology/"
}