{
  "title": "A4 Paper Stories",
  "link": "https://susam.net/a4-paper-stories.html",
  "published": "Tue, 06 Jan 2026 00:00:00 +0000",
  "summary": "<p>\n  I sometimes resort to a rather common measuring technique that is\n  neither fast, nor accurate, nor recommended by any standards body\n  and yet it hasn't failed me whenever I have had to use it.  I will\n  describe it here, though calling it a technique might be overselling\n  it.  Please do not use it for installing kitchen cabinets or\n  anything that will stare back at you every day for the next ten\n  years.  It involves one tool: a sheet of A4 paper.\n</p>\n<p>\n  Like most sensible people with a reasonable sense of priorities, I\n  do not carry a ruler with me wherever I go.  Nevertheless, I often\n  find myself needing to measure something at short notice, usually in\n  situations where a certain amount of inaccuracy is entirely\n  forgivable.  When I cannot easily fetch a ruler, I end up doing what\n  many people do and reach for the next best thing, which for me is a\n  sheet of A4 paper, available in abundant supply where I live.\n</p>\n<p>\n  From photocopying night-sky charts to serving as a scratch pad for\n  working through mathematical proofs, A4 paper has been a trusted\n  companion since my childhood days.  I use it often.  If I am\n  carrying a bag, there is almost always some A4 paper inside: perhaps\n  a printed research paper or a mathematical problem I have worked on\n  recently and need to chew on a bit more during my next train ride.\n</p>\n<h2 id=\"dimensions\">Dimensions<a href=\"#dimensions\"></a></h2>\n<p>\n  The dimensions of A4 paper are the solution to a simple, elegant\n  problem.  Imagine designing a sheet of paper such that, when you cut\n  it in half parallel to its shorter side, both halves have exactly\n  the same aspect ratio as the original.  In other words, if the\n  shorter side has length \\( x \\) and the longer side has length \\( y\n , \\) then\n\n  \\[\n    \\frac{y}{x} = \\frac{x}{y / 2}\n  \\]\n\n  which gives us\n\n  \\[\n    \\frac{y}{x} = \\sqrt{2}.\n  \\]\n\n  Test it out.  Suppose we have \\( y/x = \\sqrt{2}.  \\)  We cut the\n  paper in half parallel to the shorter side to get two halves, each\n  with shorter side \\( x' = y / 2 = x \\sqrt{2} / 2 = x / \\sqrt{2} \\)\n  and longer side \\( y' = x.  \\)  Then indeed\n\n  \\[\n    \\frac{y'}{x'}\n    = \\frac{x}{x / \\sqrt{2}}\n    = \\sqrt{2}.\n  \\]\n\n  In fact, we can keep cutting the halves like this and we'll keep\n  getting even smaller sheets with the aspect ratio \\( \\sqrt{2} \\)\n  intact.  To summarise, when a sheet of paper has the aspect ratio \\(\n  \\sqrt{2}, \\) bisecting it parallel to the shorter side leaves us\n  with two halves that preserve the aspect ratio.  A4 paper has this\n  property.\n</p>\n<p>\n  But what are the exact dimensions of A4 and why is it called A4?\n  What does 4 mean here?  Like most good answers, this one too begins\n  by considering the numbers \\( 0 \\) and \\( 1.  \\)  Let me elaborate.\n</p>\n<p>\n  Let us say we want to make a sheet of paper that is \\( 1 \\,\n  \\mathrm{m}^2 \\) in area and has the aspect-ratio-preserving property\n  that we just discussed.  What should its dimensions be?  We want\n\n  \\[\n    xy = 1 \\, \\mathrm{m}^2\n  \\]\n\n  subject to the condition\n\n  \\[\n    \\frac{y}{x} = \\sqrt{2}.\n  \\]\n\n  Solving these two equations gives us\n\n  \\[\n    x^2 = \\frac{1}{\\sqrt{2}} \\, \\mathrm{m}^2\n  \\]\n\n  from which we obtain\n\n  \\[\n    x = \\frac{1}{\\sqrt[4]{2}} \\, \\mathrm{m}, \\quad\n    y = \\sqrt[4]{2} \\, \\mathrm{m}.\n  \\]\n\n  Up to three decimal places, this amounts to\n\n  \\[\n    x = 0.841 \\, \\mathrm{m}, \\quad\n    y = 1.189 \\, \\mathrm{m}.\n  \\]\n\n  These are the dimensions of A0 paper.  They are precisely the\n  dimensions specified by the ISO standard for it.  It is quite large\n  to scribble mathematical solutions on, unless your goal is to make a\n  spectacle of yourself and cause your friends and family to reassess\n  your sanity.  So we need something smaller that allows us to work in\n  peace, without inviting commentary or concerns from passersby.  We\n  take the A0 paper of size\n\n  \\[\n    84.1 \\, \\mathrm{cm} \\times 118.9 \\, \\mathrm{cm}\n  \\]\n\n  and bisect it to get A1 paper of size\n\n  \\[\n    59.4 \\, \\mathrm{cm} \\times 84.1 \\, \\mathrm{cm}.\n  \\]\n\n  Then we bisect it again to get A2 paper with dimensions\n\n  \\[\n    42.0 \\, \\mathrm{cm} \\times 59.4 \\, \\mathrm{cm}.\n  \\]\n\n  And once again to get A3 paper with dimensions\n\n  \\[\n    29.7 \\, \\mathrm{cm} \\times 42.0 \\, \\mathrm{cm}.\n  \\]\n\n  And then once again to get A4 paper with dimensions\n\n  \\[\n    21.0 \\, \\mathrm{cm} \\times 29.7 \\, \\mathrm{cm}.\n  \\]\n\n  There we have it.  The dimensions of A4 paper.  These numbers are\n  etched in my memory like the multiplication table of \\( 1.  \\)  We\n  can keep going further to get A5, A6, etc.  We could, in theory, go\n  all the way up to A\\( \\infty.  \\)  Hold on, I think I hear someone\n  heckle.  What's that?  Oh, we can't go all the way to A\\( \\infty?  \\)\n  Something about atoms, was it?  Hmm.  Security!  Where's security?\n  Ah yes, thank you, sir.  Please show this gentleman out, would you?\n</p>\n<p>\n  Sorry for the interruption, ladies and gentlemen.  Phew!  That\n  fellow!  Atoms?  Honestly.  We, the mathematically inclined, are not\n  particularly concerned with such trivial limitations.  We drink our\n  tea from doughnuts.  We are not going to let the size of atoms\n  dictate matters, now are we?\n</p>\n<p>\n  So I was saying that we can bisect our paper like this and go all\n  the way to A\\( \\infty.  \\)  That reminds me.  Last night I was at a\n  bar in Hoxton and I saw an infinite number of mathematicians walk\n  in.  The first one asked, \"Sorry to bother you, but would it be\n  possible to have a sheet of A0 paper?  I just need something to\n  scribble a few equations on.\"  The second one asked, \"If you happen\n  to have one spare, could I please have an A1 sheet?\"  The third one\n  said, \"An A2 would be perfectly fine for me, thank you.\"  Before the\n  fourth one could ask, the bartender disappeared into the back for a\n  moment and emerged with two sheets of A0 paper and said, \"Right.\n  That should do it.  Do know your limits and split these between\n  yourselves.\"\n</p>\n<p>\n  In general, a sheet of A\\( n \\) paper has the dimensions\n\n  \\[\n    2^{-(2n + 1)/4} \\, \\mathrm{m} \\times\n    2^{-(2n - 1)/4} \\, \\mathrm{m}.\n  \\]\n\n  If we plug in \\( n = 4, \\) we indeed get the dimensions of A4 paper:\n\n  \\[\n    0.210 \\, \\mathrm{m} \\times 0.297 \\, \\mathrm{m}.\n  \\]\n</p>\n<h2 id=\"measuring-stuff\">Measuring Stuff<a href=\"#measuring-stuff\"></a></h2>\n<p>\n  Let us now return to the business of measuring things.  As I\n  mentioned earlier, the dimensions of A4 are lodged firmly into my\n  memory.  Getting hold of a sheet of A4 paper is rarely a challenge\n  where I live.  I have accumulated a number of A4 paper stories over\n  the years.  Let me share a recent one.  I was hanging out with a few\n  folks of the nerd variety one afternoon when the conversation\n  drifted, as it sometimes does, to a nearby computer monitor that\n  happened to be turned off.  At some point, someone confidently\n  declared that the screen in front of us was 27 inches.  That sounded\n  plausible but we wanted to confirm it.  So I reached for my trusted\n  measuring instrument: an A4 sheet of paper.  What followed was\n  neither fast, nor especially precise, but it was more than adequate\n  for settling the matter at hand.\n</p>\n<p>\n  I lined up the longer edge of the A4 sheet with the width of the\n  monitor.  One length.  Then I repositioned it and measured a second\n  length.  The screen was still sticking out slightly at the end.  By\n  eye, drawing on an entirely unjustified confidence built from years\n  of measuring things that never needed measuring, I estimated the\n  remaining bit at about \\( 1 \\, \\mathrm{cm}.  \\)  That gives us a\n  width of\n\n  \\[\n    29.7 \\, \\mathrm{cm} +\n    29.7 \\, \\mathrm{cm} +\n     1.0 \\, \\mathrm{cm}\n    =\n    60.4 \\, \\mathrm{cm}.\n  \\]\n\n  Let us round that down to \\( 60 \\, \\mathrm{cm}.  \\)  For the height,\n  I switched to the shorter edge.  One full \\( 21 \\, \\mathrm{cm} \\)\n  fit easily.  For the remainder, I folded the paper parallel to the\n  shorter side, producing an A5-sized rectangle with dimensions \\(\n  14.8 \\, \\mathrm{cm} \\times 21.0 \\, \\mathrm{cm}.  \\)  Using the \\(\n  14.8 \\, \\mathrm{cm} \\) edge, I discovered that it overshot the top\n  of the screen slightly.  Again, by eye, I estimated the excess at\n  around \\( 2 \\, \\mathrm{cm}.  \\)  That gives us\n\n  \\[\n    21.0 \\, \\mathrm{cm} +\n    14.8 \\, \\mathrm{cm}\n    -2.0 \\, \\mathrm{cm}\n    =\n    33.8 \\, \\mathrm{cm}.\n  \\]\n\n  Let us round this up to \\( 34 \\, \\mathrm{cm}.  \\)  The ratio \\( 60 /\n  34 \\approx 1.76 \\) is quite close to \\( 16/9, \\) a popular aspect\n  ratio of modern displays.  At this point the measurements were\n  looking good.  So far, the paper had not embarrassed itself.\n  Invoking the wisdom of the Pythagoreans, we can now estimate the\n  diagonal as\n\n  \\[\n    \\sqrt{(60 \\, \\mathrm{cm})^2 + (34 \\, \\mathrm{cm})^2}\n    \\approx 68.9 \\,\\mathrm{cm}.\n  \\]\n\n  Finally, there is the small matter of units.  One inch is \\( 2.54 \\,\n  \\mathrm{cm}, \\) another figure that has embedded itself in my head.\n  Dividing \\( 68.9 \\) by \\( 2.54 \\) gives us roughly \\( 27.2 \\,\n  \\mathrm{in}.  \\)  So yes.  It was indeed a \\( 27 \\)-inch display.  My\n  elaborate exercise in showing off my A4 paper skills was now\n  complete.  Nobody said anything.  A few people looked away in\n  silence.  I assumed they were reflecting.  I am sure they were\n  impressed deep down.  Or perhaps... no, no.  They were definitely\n  impressed.  I am sure.\n</p>\n<p>\n  Hold on.  I think I hear another heckle.  What is that?  There are\n  mobile phone apps that can measure things now?  Really?  Right.\n  Security.  Where's security?\n</p>\n<!-- ### -->\n<p>\n  <a href=\"https://susam.net/a4-paper-stories.html\">Read on website</a> |\n  <a href=\"https://susam.net/tag/absurd.html\">#absurd</a> |\n  <a href=\"https://susam.net/tag/mathematics.html\">#mathematics</a>\n</p>",
  "id": "a4pps"
}