{
  "title": "How to Preserve Your Writing for a Hundred Years",
  "link": "https://idiallo.com/blog/preserve-your-writing-for-a-hundred-years?src=feed",
  "published": "Fri, 23 Jan 2026 12:00:00 GMT",
  "summary": "<p>There was a question on Hacker News where a user asked how he could <a href=\"https://news.ycombinator.com/item?id=46642372\">ensure his writing would endure for a hundred years</a>. At first, I treated it as a technology problem. Storage, formats, domains, backups. If the goal is durability, then the best technology we've invented so far is still paper. Print it. Put it on a shelf. Problem solved.</p>\n\t\t\t<p>But that answer was too neat and it reminded me of a story a friend once told me. He found an old book in his basement, more than a hundred years old. The paper had survived, the binding held, the ink was still legible. He was excited. This felt like discovering a voice from the past, a time capsule. But when he read it, the book was... bad. The writing was unremarkable. The ideas went nowhere. The author wasn't well known, and no trace of him existed online. Eventually, the book ended up back in a box and was donated along with other used items.</p>\n\n<p>Here was a book that had solved the storage problem perfectly, and yet it had failed at endurance. It survived a hundred years only to disappear again, this time for good.</p>\n\n<p>The original question was framed wrong. Endurance isn't a storage problem. Instead of thinking about why or how <em>you</em> should preserve your writing, the real question is why <em>anyone else</em> would.</p>\n\n<p>Time is a filter. Most writing doesn't survive, and that isn't an injustice. It's the natural outcome of abundance. The world has always produced more words than it can remember. Survival is selective, not fair. No amount of sturdy paper, redundant servers, or prepaid domains can force people to care. The unit of preservation of an idea is not the quality of the paper. It's the reader.</p>\n\n<p>Writing endures only when someone chooses to carry it forward.</p>\n\n<p>Most often, that endurance doesn't look like preservation at all. It looks like disappearance followed by reappearance under a different name. Ideas don't survive by staying intact; they survive by being rewritten.</p>\n\n<div class=\"image\"> \n  <img alt=\"tv set\" src=\"https://cdn.idiallo.com/images/assets/609/tv.jpg\" />\n</div>\n\n<p>I once read <em>Amusing Ourselves to Death</em> by Neil Postman, published in 1985. The book is an analysis of mass media and public discourse, framed through two earlier works: <em>Brave New World</em> by Aldous Huxley (1932) and <em>1984</em> by George Orwell (1949). Without Postman, I might never have read either. To me, those books exist not because their paper endured, but because their ideas were made relevant again.</p>\n\n<p>Following that thread led further back. Orwell and Huxley were both influenced by <em>We</em> by Yevgeny Zamyatin (1924). Zamyatin's book isn't remembered because every copy was carefully preserved. It's remembered because its ideas escaped its pages and migrated into other minds, other books, other futures.</p>\n\n<p>The chain doesn't stop there. After <em>We</em>, I discovered <em>The Machine Stops</em> by E. M. Forster, published in 1909. More than a century later, it reads like modern science fiction. It's not far‑fetched to see echoes of it in contemporary works like <a href=\"https://en.wikipedia.org/wiki/Silo_(series)\">the <em>Silo</em> series</a>. Maybe the authors never read Forster. It doesn't matter. The ideas aligned anyway. That's how endurance works.</p>\n\n<p>The original paper these books were printed on has almost certainly withered. But the content didn't depend on that paper. It hitched a ride on readers instead.</p>\n\n<p>This is why worrying about the perfect preservation mechanism misses the point. An unread book is just a well‑preserved object. An idea that gets reused, even poorly, even without credit, has already won.</p>\n\n<p>In the original post on Hacker News, the author mentions preserving the writing for his children. The part he missed is that children don't read archives. They read fragments. They read stories told by others. They inherit ideas indirectly, not complete works bound and labeled. A box of printed blog posts is just an archive that documents how your ideas evolved over time.</p>\n\n<p>My first suggestion was a joke:</p>\n\n<blockquote>\n  <p>I suggest you start converting your writing into short digestible Tiktok dance moves...</p>\n</blockquote>\n\n<p>And a commenter pointed out that TikTok content is even more ephemeral than other mediums. Not only it won't last digitally, the medium encourages forgettable content. But that's where the readers are. Not that I am seriously suggesting you share on TikTok, but I <em>do</em> suggest you share recklessly wherever it is relevant.</p>\n\n<div class=\"image\"> \n  <img alt=\"tiktok studio\" src=\"https://cdn.idiallo.com/images/assets/609/tiktok.jpg\" />\n</div>\n\n<p>Publish widely. Let your ideas bump into other people's thoughts. Print your writing in a book format and donate it to a library. Not because it will help the physical copy endure, but it gives the idea a chance to be read by someone else. Even if your own writing doesn't survive, its derivatives might.</p>\n\n<p>The books that endure are not the ones made of the strongest materials. They're the ones that are read, reused, argued with, and rewritten. Writing doesn't last because it's preserved. It lasts because someone found it worth carrying forward.</p>\n\n<hr />\n\n<p>There is one last story I want to share.</p>\n\n<p>Mikhail Bulgakov completed <em>The Master and Margarita</em> around 1940. It was never published in his lifetime. The manuscript was censored, rewritten, smuggled, copied by hand, and reassembled across borders. Different versions circulated quietly, some missing chapters, others patched with new inserts meant to replace what had been cut. The most complete version would not be published until 1973, more than three decades after Bulgakov’s death.</p>\n\n<p>Even today, there is no single agreed-upon \"true\" version of the book. Scholars still debate which passages reflect Bulgakov’s final intent. But that question no longer matters. The idea was powerful enough to punch through what was meant to be an unbreakable barrier. The Soviet Union tried to stop the book. It failed.</p>\n\n<p><em>The Master and Margarita</em> is now listed as one of the most influential novels of the twentieth century, despite never making it to print while its author was alive. Not because it was carefully preserved, but because people refused to let it disappear.</p>\n\n<p>When we think about preserving our ideas, it’s tempting to focus on permanence like formats, domains, archives, and durability. But preservation has never been something an author can fully control. You can only share your ideas as widely as you can. After that, time, society, and history decide whether they are worth carrying forward.</p>\n\n<p>That decision was never yours to begin with.</p>",
  "id": "https://idiallo.com/blog/preserve-your-writing-for-a-hundred-years?src=feed"
}