{
  "title": "Secure File Transfer",
  "link": "http://danieldelaney.net/cd/",
  "published": "Fri, 20 Apr 2018 00:00:00 +0000",
  "summary": "<div class=\"hero\">\n  <img alt=\"Advanced process builder\" src=\"/images/cd-process-builder.png\" />\n</div>\n\n<p>During my time at frog, I lead a team of designers to transform a secure file transfer app owned by IBM. In addition to leading the team in Austin I helped manage designers working out of frog’s new studio in India, reviewing their work and setting priorities.</p>\n\n<p>frog itself has a long and storied history in design, and I felt lucky to work with such an amazing team of serious veteran designers.</p>\n\n<p><img alt=\"frog Atrium\" src=\"/images/cd-frog-atrium.jpg\" />\n<img alt=\"Apple\" src=\"/images/cd-frog-apple.jpg\" /></p>\n\n<h2 id=\"research\">Research</h2>\n<p>The first part of the program was spent on research, interviewing stakeholders and gaining an understanding of how the product worked and where it needed to go. User research was conducted remotely with a variety of large clients in finance.</p>\n\n<p>Our research showed that the short-term focus needed to be on fixing some glaring UI issues, whereas the long-term focus should be on evolving the software to be centrally managed.</p>\n\n<p><img alt=\"Research\" src=\"/images/cd-research-mess.jpg\" />\n<img alt=\"Shruti\" src=\"/images/cd-shruti-sticky.jpg\" /></p>\n\n<h2 id=\"visual-design\">Visual Design</h2>\n<p>I spent time guiding the visual designers on my team, helping them to understand the unique requirements associated with this kind of product. Special attention needed to the meaning of color in the context of an secure enterprise product, and IBM has strict brand and accessibility guidelines.</p>\n\n<p><img alt=\"Mood board\" src=\"/images/cd-mood-board.png\" /></p>\n\n<h2 id=\"interaction-design\">Interaction Design</h2>\n<p><img alt=\"Marvel\" src=\"/images/cd-marvel.png\" /></p>\n\n<h2 id=\"willy\">Willy</h2>\n<p><img alt=\"Willy\" src=\"/images/cd-willy-ground.jpg\" /></p>",
  "id": "http://danieldelaney.net/cd/"
}