{
  "title": "Thank you Google for breaking my YouTube addiction",
  "link": "https://rakhim.exotext.com/thank-you-google-for-breaking-my-youtube-addiction",
  "published": "Sat, 17 May 2025 00:00:00 GMT",
  "summary": "<p>Over the past few years, Google has done a surprisingly great job of making YouTube less interesting and engaging — and in turn, less addictive. Maybe they've got some ethical guidelines in the top management now? If so, well done, Google.</p>\n<p>Back in the day, when YouTube was mostly about your subscriptions, it was mildly addictive. You’d watch a C++ talk, and the sidebar would actually show you other useful C++ videos. It was relevant, and it kept you watching without feeling like you were drowning in content.</p>\n<p>Then they introduced the algorithmic home feed, and that’s when things got intense. You’d open YouTube and get hit with an endless grid of videos tailored to your weird, eclectic mix of interests. Every refresh was like, “Oh, wow, more stuff I didn’t even know I wanted to watch!” It was like YouTube was infinite. </p>\n<p>Now? Now it feels like YouTube is trying to bore us into logging off. The homepage just recycles the same 10-20 videos for weeks. It's like a kid in high school trying really hard to expand two sentences into a required 2-page essay by <a href=\"https://jayd.ml/2025/04/30/someone-at-youtube-needs-glasses.html\">increasing the line height and font size</a>, and re-phrasing the same point over and over again.</p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/zgJZ_xguAECU-NQNWUykX.jpg\" />\n<em>YouTube app on Apple TV feels particularly empty. The same few videos shuffled on each row.</em></p>\n<p>Watch two bee videos, and suddenly YouTube decides you’re a bee person for life. Over a decade of watch history, interests, searches, playlists — none of that matters anymore. The user is into bees now. </p>\n<p>The search now serves up a couple of videos from channels you've interacted with, prioritizing them over the actual relevance, throws in completely unrelated recommendations, and then sprinkles random Shorts on top. It’s like they’re trying to convince you there’s nothing good left to watch.</p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/PVnazyRa12Es4UyRKeozA.jpg\" />\n<em>Interested in nautical route planning algorithms? Sure, but what about sexy girls and cars?</em></p>\n<p>Honestly, it’s kind of brilliant. If you wanted to make YouTube less addictive, this is how you’d do it — by making it feel pointless and lame. So, thanks, Google. You're actually doing the &quot;don't be evil&quot; thing!</p>",
  "id": "https://rakhim.exotext.com/thank-you-google-for-breaking-my-youtube-addiction"
}