{
  "title": "speed reading (the meaning of language)",
  "link": "https://computer.rip/2025-12-08-speed-reading.html",
  "published": "08 Dec 2025 00:00:00 UT",
  "summary": "<p>One of the difficult things about describing a grift, or at least what became\na grift, is judging the sincerity with which the whole thing started. Scams\noften crystallize around a kernel of truth: genuinely good intentions that\nstart rolling down the hill to profitability and end up crashing through every\nsolid object along the way. I'm not totally sure about Evelyn Wood; she seems\nto have had all the best in mind but still turned so quickly to hotel conference\nroom seminars that I have trouble lending her the benefit of the doubt.</p>\n<p>Still, she was a teacher, and I am inclined to be sympathetic to teachers. Funny,\nthen, that Wood's journey to fame started with another teacher. His curious\nreading behavior, whether interpreted as intense attention or half-assed inattention,\nset into motion one of the mid-century's greatest and, perhaps, most embarrassing\nexecutive self-help sensations.</p>\n<p>In 1929, Evelyn Wood earned a bachelor's in English at the University of Utah.\nThe following two decades are a bit obscure; she took various\nhigh-school jobs around Utah leading ultimately to Salt Lake City's Jordan\nHigh School. There, as a counselor to girl students, Wood found that many\nstudents struggled because of their reading. Assigned books were arduous,\nhandouts discarded. These students struggled to read so severely that it\nhampered their performance in every area. She launched a remedial reading\nprogram of her own design, during which she made her first discovery: as\nher students learned to read faster, their comprehension improved. Then\ntheir grades—in every subject—followed suit. Reading, she learned, was a\nfoundational skill. A person could learn more, do more, <em>achieve more,</em> if\nonly they could read faster.</p>\n<p>Wood became fascinated with reading, probably the reason for her return to\nthe University of Utah for a master's degree in speech. Around 1946, she turned\nher thesis in to Dr. Lowell Lees. Lees was the chair of the Speech and\nTheater Department, and had a hand in much of the development of Utah theater\nfrom the Great Depression until his death in the 1950s. A period photo of Lees\ndepicts him with a breastplate-microphone intercom headset and a look of\nconcentration, hands on the levers of a mechanical variac dimmer rack. He is\nbackstage of either &quot;Show Boat&quot; or &quot;A Midsummer Night's Dream&quot; at the\nuniversity's summer theater festival. A theater department chair on lights\nseems odd, yes, but theater was Lees passion.</p>\n<p>Perhaps reading was not. When Wood turned her thesis into Lees, he &quot;read,\ngraded, and returned the thesis within a matter of minutes.&quot; Wood was amazed\nthat he seemed to just leaf through the pages, but then\nstill had insightful questions to ask. Perhaps I am too cynical. It feels\nmost likely to me that Lees was already familiar with the contents (he was probably Wood's advisor and would have\ndiscussed the research plenty of times before) and just didn't bother to read\nthe final document. To Wood, though, something more remarkable had\nhappened. With a series of tests, she convinced herself that Dr. Lees could read\nover 6,000 words per minute with full comprehension.</p>\n<p><img alt=\"Evelyn Wood Reading Dynamics advertisement\" src=\"https://computer.rip/f/speed.jpg\" /></p>\n<p>A typical American college graduate can read at about 250 words per minute, at\nleast if the material isn't too challenging. Some people, Wood contends, are\n&quot;10x readers.&quot; They read so quickly, and with such good understanding, that\nthey simply outpace the rest of us at every intellectual pursuit. What's more,\nWood could make <em>you</em> one of those people. As she tells it, she spent two years,\nprobably in the 1950s, tracking down fifty some examples of other exceptional\nreaders. She published &quot;Reading Skills&quot; in 1958, a book evidently based on some\nof this research but more focused on remedial skills for grade students than\nexecutive achievement.</p>\n<p>The introduction of Reading Skills tells us of ten different students. Anna was\npretty, but she couldn't read. Joseph hated school, because he couldn't read.\nCarl's hair is a mess, and his parents neglectful. He also can't read. All of\nthem became proficient readers through Wood's program. But Wood had more in mind\nthan grade students. A year later, with her business-educated husband, she\nbrought her reading program to adults by launching a chain of training centers\nunder the name <em>Evelyn Wood Reading Dynamics.</em></p>\n<blockquote>\n<p>Books neither bored nor scared me any longer. I could read almost any book\nwithin an hour, and more important, I better understood that which I read.</p>\n</blockquote>\n<p>Reading Dynamics became a sensation. Over the following years, Evelyn Wood\ninstitutes opened across the country. The speed reading movement received a\nconsiderable boost from President John F. Kennedy—he claimed to read at\n1,200 words per minute, a skill he learned in part through a correspondence\nspeed reading course. It wasn't one of Evelyn Wood's, but that detail was\nmostly lost on the public and the success of the Kennedies became linked to\nReading Dynamics. He seems to have bought the same course for his brother\nTed, and encouraged his staff to take speed reading courses as well. Reading\nDynamics didn't miss the marketing opportunity, and indeed the very first\ndedicated Institute opened in Washington, D.C. and advertised specifically\nto politicians. Senators and representatives were among her earliest students\nand her strongest advocates.</p>\n<p>Evelyn Wood Reading Dynamics underwent several changes of ownership through\nthe 1960s, but Wood stayed on as developer of the training materials. Soon\nthere were more than 60 institutes, and newspaper ads directed the interested\npublic to &quot;free mini-lessons&quot; held in the meeting rooms of fine hotels across\nthe country. It became a franchise system, with the Woods personally owning\nthe franchise for Utah and Idaho. The company's fortunes have trended up\nand down with those of speed reading as a concept, but genuine Evelyn Wood speed reading\ncourses are still available today from business training firm Pryor. There\nhas been a bit of a reckoning: far from the 1,000+ WPM rates promised by early\nEvelyn Wood marketing material, Pryor now advertises &quot;a potential rate of\n400-700 words per minute.&quot; These numbers align with the upper end of reading\nspeeds observed among the general population. In effect, Pryor no longer\nclaims that speed reading courses will make you a faster reader than more\nconventional methods of training reading, like just doing a lot of it.</p>\n<p>The science has never really been with speed reading. As early as 1959, when\nReading Dynamics hit Washington, researchers and educators called Wood's\ndata and methods into question. As with most self-help materials, Wood's\nwriting was heavy on anecdotes and light on quantitative analysis. Certain\nelements of her method contradicted psychology's growing understanding of\nhuman language and perception. At the core of the problem, though, was her\npromise of comprehension.</p>\n<p>It is obvious that a person can &quot;read&quot; a document very quickly, if we relax\nour definition of &quot;read.&quot; This is just as obvious to the developers of speed\nreading courses. Many advise students to start by skimming, flipping through\nthe whole book or document and taking in the headings and subjects. You\ncan certainly get through a book under an hour that way, but of course, you\nhaven't exactly read it. Think of it as a lossy process: the less time you\nspend on a document, the less you comprehend and retain its contents. That\nseems pretty intuitive, doesn't it?</p>\n<p>But Wood disagreed, or at least, the company she founded did. It can be a\nlittle difficult to untangle Evelyn Wood's original theory from the many\ngenerations of Reading Dynamics and competing speed reading systems that\nfollowed. Subsequent owners of Reading Dynamics, which included companies\nlike the publisher of Encyclopedia Britannica, made significant revisions\nto the material. By the 1970s, Wood's role was more as a celebrity spokesperson\nthan a teacher. In any case, Reading Dynamics came to emphasize a key\nprinciple that reading faster actually improves comprehension. The most\nskilled readers, Reading Dynamics taught, don't even read words. They\nscan a page vertically, not horizontally, taking in an entire line at a\ntime by peripheral vision. There is no need to sound out, read, recognize,\nor even really see individual words, as the mind actually processes language\nin large chunks at a time. Reading occurs mostly subconsciously, so in a way\nall you have to do is see the text and <em>believe</em> that you have read it, and\nyou will retain the content.</p>\n<p>In a 2016 review paper on speed reading, a team of psychologists deliver\nbad news: it just doesn't hold up. Laboratory studies confirm that the eye\nonly has the acuity to distinguish words in a small area, and that reading\nrequires fixating on just about every word individually. That doesn't\neven matter, though, because other laboratory experiments strongly suggest\nthat the limiting factor on reading speed is not the eyes at all but the\nmind. Even when clever computer techniques are developed to present text\nmore quickly, comprehension trails off at about the same speed. In fact,\nwhen humans read, we <em>regard</em> an even smaller area of our vision than the\nlimits of the fovea would suggest. When looking at a word, we are basically\nblind to anything further than about seven characters away.</p>\n<p>The problems with speed reading are not merely theoretical, though. The\nresearchers considered studies of actual speed readers, people who had\neither completed speed reading courses or claimed to naturally read at\nexceptional speeds. Almost no studies can be found that support the claim\nof faster reading with retained comprehension. Speed readers perform poorly\non comprehension tests on new material. People who &quot;speed read&quot; a document\ngenerally show similar comprehension to people who have no speed reading\ntraining but skimmed the document in the same period of time. When\nspeed readers have performed better, researchers suspect the result comes more\nfrom advanced familiarity with the material (a common problem with speed\nreading courses that use the same texts repeatedly), broader general\neducation (you retain more from non-fiction material if you already knew\nthe information to begin with), and greater experience and confidence in\n&quot;interpolating&quot; by speculating as to the content of the text that wasn't\nactually read.</p>\n<p>Ultimately, eye tracking experiments tend to confirm the worst. People who\nspeed read don't do all that much actual reading. Skilled\nspeed readers skip much of the text completely, and tend to make things up\nwhen asked about things they never fixated on. Most interesting, there seems\nto be a certain Dunning-Kruger effect at play. People who have speed-read a\nbook on a subject, for example, tend to rate their knowledge of the subject\nhighly and then perform very poorly on questions about it (often scoring similar\nto chance on multiple choice tests). Speed reading, it turns out, is\na placebo. It makes you feel like you have read something, even though\nyou haven't.</p>\n<p>And yet we still have speed reading. Wood's efforts were perhaps sincere,\nbut the commercial imperative of the growing Reading Dynamics institutes\nsteered the whole thing away from evidence-based methods and\ntowards ideas with an increasingly tenuous connection to reality. The on-again,\noff-again success of Reading Dynamics left a lot of room for imitators, or\ninnovators, depending on your perspective. Evelyn Wood's original strain of\nspeed reading has mostly fallen away, replaced by a new set of courses that\nbuild on Wood's ideas—the worst of them.</p>\n<p>Take, for example, the work of Paul Scheele. Scheele is one of those business\nconference motivational speaker types, the kind of person who is introduced\nwith a vast and impressive resume but who doesn't seem to have really done\nanything. With a PhD in &quot;Leadership and Change,&quot; he founded Scheele Learning Systems to\nmarket a series of innovations. His work is so\ninterconnected with other self-help and new-age grifts that it can be hard to\nuntangle what comes from where, but one of their key programs clearly builds\non the Evelyn Wood method: PhotoReading.</p>\n<p>The basic concept of PhotoReading is that the mind is able to subconsciously\nprocess far more information than the conscious mind. In a marketing sheet,\nhe writes:</p>\n<blockquote>\n<p>Your conscious mind can handle seven pieces of information at a time, while\nyour subconscious mind can handle a staggering 20,000 pieces of information.\nThat's the difference between regular reading and PhotoReading.</p>\n</blockquote>\n<p>So imagine a future in which you pick up a book, flip through the pages, and\nin a matter of minutes gain a full command of the material contained therein.\nThe key is that you don't actually have to read anything, you just have to\n<em>see</em> it and your subconscious mind files every word away for later retrieval.</p>\n<p>Well, of course, it's not quite that simple. There's a whole technique to it,\na technique that you can learn from a self-guided digital course for only\n$530. Sure, that might seem a little steep, but consider that it's a package that\nincludes not only the course but &quot;The PhotoReading Activator Paraliminal CD.&quot;\nParaliminal activation or paraliminal hypnosis is another major product from\nScheele Learning Systems, although I think it's licensed at least in part\nfrom a different organization (Centerpointe Research Institute) founded by\ndifferent cranks (&quot;transcendental meditation&quot; enthusiasts Bill Harris and Wes\nWait). The idea of paraliminal activation is roughly halfway between\nsubliminal inducement videos <sup class=\"footnote-ref\" id=\"fnref-1\"><a href=\"#fn-1\">1</a></sup> and binaural beats <sup class=\"footnote-ref\" id=\"fnref-2\"><a href=\"#fn-2\">2</a></sup>, in that it's\nboth of them mixed together. Incidentally, a lot of subliminal videos\nare like that anyway, so I'm not sure that Scheele is offering anything you\ncan't get for free. All of these organizations offer rotating carousels of\nendorsements from famous and successful customers. The fact that these\nhappy customers are almost invariably self-help authors or business conference\nmotivational speakers goes unremarked upon.</p>\n<p>Scheele's ultimate claim is that PhotoReading allows you &quot;to 'mentally\nphotograph' the printed page at 25,000 words per minute.&quot; 600-800 WPM is an\nexcellent, exceptional reading rate among the normal population. For today's\nspeed reading industry, though, 25,000 WPM is the bar to meet. &quot;Harry Potter\nand the Deathly Hallows&quot; counts up to about 198,000 words. An experienced\nPhotoReader, then, ought to be able to complete it in around eight minutes.\nWell, celebrity speed reader Ann Jones says it took her 47, so\nno one is perfect. She knocked out &quot;Go Set a Watchman&quot; in 25 and a half, and\nthat on live television. Yes, for the most successful speed readers, people\nwho claim rates in excess of 10,000 WPM, there's almost always some aspect\nof performance involved... whether that's television appearances or elected\noffice. 25,000 WPM became cemented because it's the rate at which the Guinness\nWorld Records clocked celebrity speed reader Howard Berg. Actually, there's a\nwoman who claims to have a Guinness World Record at 80,000 WPM, but it's hard\nto substantiate as Guinness stopped publishing the speed reading record at all\ndecades ago. I suppose it became too questionable for even them.</p>\n<p>The reason I'm so fascinated by speed reading is its close interconnection to\nthe concept of the executive. One of the earliest newspaper ads for Reading\nDynamics reads &quot;For Executives, Businessmen, Students, Housewives.&quot; The\nhousewives part doesn't quite fit the theme, but I think that might be better\nunderstood with the Utah LDS context of the housewife side hustle. Multi-level\nmarketing schemes were becoming a cornerstone of the Salt Lake City business\nscene during the 1960s, a role they still fill today, and MLM brands like Avon\nfound their success in part by melding the two worlds of the housewife and the\nbusiness executive. Feminine products sold with masculine hustle, you might\nventure; some housewives were applying themselves to business with a zeal that\nwould make a railroad baron blush.</p>\n<p>For students, the motivation is more obvious. Much of education comes down to\nreading, and we all remember the feeling of a paper due in two days on a book\nthat you haven't yet opened. For the student, getting good comprehension of a\ntext in a fraction of the time is an incredible offer. So promising was speed\nreading for education that, in its early days, it found considerable adoption\nin the educational establishment. Many universities offered speed reading\ncourses, some even made them core curriculum. A particularly prominent speed\nreading course at Harvard served as the pattern on which many others were\ntaught. Besides a series of demonstration films developed Harvard, devices\ncalled &quot;reading regulators&quot; or &quot;reading accelerators&quot; were popular lab equipment\nfor these courses. They automated Evelyn Wood's idea of running a ruler down\nthe page, sliding a metal shield down the page faster and faster to force the\nstudent to read at a higher and higher rate. For a few years, speed reading\nfor universities became an entire industry, but it was short lived. Academic\nspeed reading courses faded away as criticisms of Wood's theories became\nbetter known and attempts at validating speed reading continued to fail.</p>\n<p>&quot;Speed reading,&quot; it turns out, did not work out in education. But perhaps\nthat's a matter of framing. If we consider the broader landscape of &quot;things\nthat promise to save you time reading,&quot; speed reading is just one in a long\nline of ideas. It turns out that students have been trying to skip the reading\nfor just about as long as there has been reading—consider Monarch Notes, a\nline of book summaries and critical commentary already available a hundred\nyears ago. From Monarch to CliffsNotes to Chegg, students have looked to a\nwhole sector of the publishing industry to do the hard work of actually reading\nbooks for them. You could say that the purpose of these digests or study guides\nis to help a student maintain the appearance that they have read a text even\nthough they have not, by imparting only the parts of the text that are most\nimportant... important either because they are key to the plot or theme, <em>or</em>\nbecause they are likely to appear on exams or be expected in papers.</p>\n<p>While students have an obvious need for these types of summaries (scoring well\non assignments with less time invested), the appeal to the business executive\nmight seem a little fuzzier. Well, unless we take the cynical view that the\nultimate goal of an executive is to <em>look smart,</em> and I'm not sure that you\nreally have to be so cynical to accept that as truth.</p>\n<p>Summarizations are obviously &quot;lossy,&quot; in that a digest form of a book cannot\npossibly contain the full information of the original book. Similarly, the\nweight of scientific evidence, as well as most credible practical experience,\ntells us that speed reading is a lossy process. There is, as the psychologists\nput it, no silver bullet in reading. Comprehension takes time; less time means\nless comprehension; and while you likely can improve your reading speed it will\ntake years of practice.</p>\n<p>And yet book summaries are an even larger industry than speed reading, and one\nthat is both older and better adapted to the modern age. There clearly is a\nmarket for fast, low-comprehension reading of large texts. The audience is not\npurely made up of people seeking to create the appearance of work they have not\ndone, although that's clearly a large part of it. Consider the magazine book\nreview: long a staple of magazines, book reviews serve two purposes. They give\nyou an idea of whether or not a book is worth reading, but they also summarize\nthe book, or at least explain the major themes. That gives you some of the\ncontent of the book, the major ideas and a few choice details, in just a page\nof three-column prose. A third of that might be taken up by a wine club ad,\nto boot.</p>\n<p>The case of the magazine book review reminds us that there is a <em>serious,</em>\na <em>respectable</em> application for summaries. The perfect example might be the\nlawyer or doctor, people who are paid explicitly for their expertise and\neducation but who also make heavy use of digests and summaries and desk\nreferences. There is a lot of information in the modern world, even in any\ngiven field, and no one can keep track of all of it. You might need to\nspeed read, to use the CliffsNotes, just to keep up with the state of the\nfield and find the things that you do need to read in their full length.</p>\n<p>And so we have seen the dual facets of the executive demand for speed reading:\nthe businessman, the leader, the executive is the perfect intersection of the\nprofessional need to find what to read and the personal need to look like you\nhave done a lot of reading. Executives are expected to know what's out there,\nbut also to seem like they already know all of it. It's a matter of opinion\nwhich of these is more prominent, but I think we can all agree that publications\nlike <em>CTO Magazine</em> are aimed at that dual purpose.</p>\n<p>Well, these days, publications like <em>CTO Magazine</em> are mostly aimed at drumming\nup AI hype. That's the other thing about business publishing: it is itself a\nbusiness, and as beholden to the trends as any other.</p>\n<p>The funny thing about speed reading is that it has <em>never</em> been that credible.\nEvelyn Wood's theories were inconsistent with the research and, frankly, a bit\n&quot;out there&quot; even as she developed them into a business in the 1960s. Experiments\non speed reading, some of them conducted by the same people selling courses,\nhave always shown iffy to clearly negative results. And yet speed reading has,\nin its good times, enjoyed a level of credibility and popularity that seems out\nof step with even its promises and certainly with its outcomes.</p>\n<p>US Presidents Kennedy, Carter, and Nixon were all speed readers. Carter and Nixon\nboth arranged Evelyn Wood Reading Dynamics courses for their staff, and it seems\nthat Kennedy probably purchased some sort of course for White House staff as\nwell. This was very much perceived as an endorsement from the top, and speed\nreading became not just a new innovation in education, not just a trend, but\npractically a requirement for any serious leader. Marketing, and the celebrity\nadoption that it intentionally engineered, outpaced the results. Evelyn Wood's\nnewspaper ads and reputation got so far out front of the actual pedagogy that\ntoday's speed reading industry, spinning ever farther from reason, continues to\ncoast on the same set of presidents.</p>\n<p>That's not to say that there has been nothing new in speed reading. In 1984,\npsychologist Mary C. Potter described a method called &quot;rapid serial visual\npresentation&quot; or RSVP. The idea of RSVP is to eliminate the whole eye movement\npart of reading entirely, instead using a computer to present one word at a time,\neach centered in the same location. In theory, the words can be presented faster\nand faster until the user is reading more quickly than the visual system allows.\nWell, that's <em>a</em> theory at least. It's inconsistent with later research suggesting\nthat reading speed is limited by cognition rather than perception, but most of\nthat wasn't yet known at the time. Even so, Potter doesn't seem to have viewed\nRSVP as a speed reading technique. She described it as a method for cognitive\nresearch, one that could enable new experiments and improve old results by\ncontrolling for the many variables involved in scanning a page of text.</p>\n<p>The idea of RSVP as a speed reading technique seems to have been popularized\nby software startup Spritz, who launched an RSVP speed reading application in\n2014. Spritz seems to have spun it as &quot;text streaming,&quot; although I think that\nmight have been a later branding innovation. The claims of Spritz are relatively\nmodest, only 1,000 WPM in most cases and sometimes as low as 600 WPM. These are\nspeeds achievable (even if only narrowly) without technical assistance for\nexceptionally fast readers. Even so, it doesn't really work out. Research on the\nRSVP method of speed reading finds that comprehension decreases with increasing\nspeed. Amusingly, some experiments show that RSVP results in decreased comprehension\neven when run at the same speed the subject reads naturally. Psychologists tend\nto attribute that effect to the fact that RSVP prevents going back and rereading\na sentence that you didn't fully understand—a behavior that seems to be a\nnatural and even required part of good reading, despite the fact that Evelyn Wood\nand virtually every speed reading theorist since has outlawed it.</p>\n<p>The fact that the RSVP concept is fundamentally at odds with blinking is probably\nthe major cause of a reported increase in fatigue, as well, but none of these\nshortcomings have prevented the massive popularity of RSVP within the tech\nindustry especially. Spritz, the company, has gone basically nowhere, but the\nconcept has graduated from TED talks to a huge inventory of browser extensions,\nmobile apps, CLI tools, and various and sundry GitHub projects that all make the\nsame claims about increased reading speed. &quot;Speed Reading Makes a Comeback&quot; was\nthe title of an NBC News spot on Iris Reading, more of a traditional Wood-style\nspeed reading training company that has since wholeheartedly embraced the RSVP\nconcept.</p>\n<p>If software is part of the speed reading story, and a particularly core part of\nit today, we will have to take on the elephant in the room: in a certain sense,\na very real sense, summarizing text is now the largest single driver of the US\neconomy.</p>\n<p>The appeal of summarization to the business executive has never gone away; the\nunderlying technology has just evolved. Since the 2022 launch of ChatGPT,\ntelevision spots, bus shelter ads, and the collective buzz of the south end of\nthe San Francisco Peninsula have promised first and foremost that AI will\nrelieve us of the obligation of reading. An LLM can read your email, read the\nnews, read a book, or read the comments. Actually, the LLM has <em>already</em> read\na lot of these things. On command, it can summarize them to you.</p>\n<p>AI advertising seems to imagine a world that is, well, oddly familiar: one in\nwhich students, housewives, and, yes, business executives can save hours of\neach day by using the LLM to, in effect, read at 25,000 WPM. It also seems\nthat the same basic principles apply: the LLM's output loses some of the content\nof the original material. It might also gain some content, a benefit of all of\nthe other things that the LLM has also been trained on. Still: there's always\na certain rounding out, a sanding down of the details.</p>\n<p>What strikes me most about LLM summaries is just how <em>long</em> they are. When I\nhave asked Claude to summarize reading notes, it has routinely produced output\nthat is <em>longer than the original notes.</em> This problem can probably be addressed\nby prompting, although my efforts at appending everything from &quot;be brief&quot; to\n&quot;for the love of God keep it to one paragraph&quot; have failed to produce a good\nresult. Maybe I'm holding it wrong, maybe I'm an idiot, I possess no qualifications\nin this area besides decades as a natural language user and an unfinished degree\nin technical writing. But experience suggests that my coworkers have the same\nproblem. I see AI generated meeting summaries, AI generated issue descriptions,\nAI generated sales documents. One of their common properties is that they are\nastoundingly, uselessly verbose.</p>\n<p>Of course, modern AI can do so much more than summarize text. &quot;Generative AI&quot;\npromises not only to summarize, but also to create something new. Perhaps that's\nwhy the LLM is so verbose. I, personally, find that I make up for my lackluster\ninterpersonal skills by writing. Perhaps LLMs make up for their similar limitations,\ntheir fundamentally text-based, screen-resident nature, by using the one tool\nthat they have. The LLM cannot think or feel, yet it can write. So it writes: a\nsimple question answered with such energy that it merits four distinct bulleted\nlists, each with an emoji-laden heading and an introductory paragraph. I suppose\nI can sympathize. We must imagine Grok happy.</p>\n<div class=\"beg\">\n<hr />\n<p>I put a lot of time into writing this, and I hope that you enjoy reading\nit. If you can spare a few dollars, consider <a href=\"https://ko-fi.com/jbcrawford\">supporting me on\nko-fi</a>. You'll receive an occasional extra,\nsubscribers-only post, and defray the costs of providing artisanal, hand-built\nworld wide web directly from Albuquerque, New Mexico.</p>\n<hr />\n</div>\n<p>I do not mean to criticize AI <em>too</em> harshly, although I think the level of\ncriticism that this entire industry phenomena deserves is high enough that\nyou have to go big.</p>\n<p>But the relationship between speed reading and the LLM—between Sam Altman and\nEvelyn Wood—is vague but vivid. The software industry's imagined future, in\nwhich people use LLMs to generate text that other people use LLMs to summarize,\ngenuinely haunts me. AI has created a profound contradiction: it promises the\nproductivity gains of speed reading, the ease of CliffsNotes, but it doesn't\njust shorten text. It also <em>lengthens</em> it. My joking reference to Camus, shoddy\nas it is, becomes more meaningful. ChatGPT pushes the written word up the hill,\nit watches it roll back down again.</p>\n<p>I read &quot;The Myth of Sisyphus&quot; for the same reason everyone else did: high\nschool. IB English HL. Yes, I went to one of those schools. If you are not\nfamiliar you can look it up and one of the top results, at least for me, is\na clearly LLM-generated article that is four or five times longer than it\nshould be based on the factual content. You can have your web browser's LLM\nfeature summarize it back down for you, if you want. The result comes out a\nlot less useful than the Wikipedia article but it is, as they say, disruptive\nnonetheless.</p>\n<blockquote>\n<p>If the purpose of reading is solely to acquire information and accumulate\nthought units, then surely speed and efficiency are the essential criteria.\nRegressing is obviously a morbid symptom since it is destructive of time\nand energy, while horizontal reading not only taxes the optic muscles, but\nrequires that the same tome remain clutched by fingers which could be more\nprofitably employed in reaching for yet another volume.</p>\n</blockquote>\n<p>We're all full of opinions on the era of AI. I am perhaps not as pessimistic\nas you might think: the machine learning innovations of the last few years\nclearly do have useful applications. Even summarizing text has its time and\nplace. I suppose that what frustrates me most about it all is the lack of\nambition. LLMs train on text, take text as input, and generate text as output.\nA room of Silicon Valley visionaries, presented with this astounding tool,\ncame up with such world-changing applications as &quot;reading emails&quot; and &quot;writing\nemails.&quot; The whole industry is still struggling to move past this trivial,\nboring, frequently nonproductive use.</p>\n<blockquote>\n<p>As for lip motions, any toddler knows that the mouth is tardier than the eye,\nand retardation is one of the most dreaded words in an educator's terminology.\nFurthermore, the speed cult is quick to point out that slow readers are\nrarely careful ones, and generally speaking, comprehension appears to increase\nwith reading velocity. Speed reading, it would appear, is all profit and no\nloss and if it can make good its claims at linking efficiency and comprehension,\nthen it is well that its methodology and objectives are incorporated into\nany reading program.</p>\n</blockquote>\n<p>There is the potential, the AI's industries advocates say, of AI actually\nexpanding human creativity. Machine learning methods of producing &quot;art,&quot; whether\ntext or image or audio or video, will lower the barrier of entry to artistic\nproduction. Of course, that depends a lot on how you define &quot;artistic production,&quot;\nbut at least it's a rare promise of a better future rather than a worse one.\nIt only takes a brief interaction with the modern internet to realize that we\ndo live in an age blessed with text. We are rich in the written word like never\nbefore, so wealthy with words that they crowd out the actual information. Search\nresults are mostly AI-generated, but the search engine doesn't want you to look\nat them anyway, it's provided its own AI-generated treatise. The headings, the\nparagraphs, the bulleted lists, they run down the page, drip from our screens,\nthey leave our desks filthy with content.</p>\n<blockquote>\n<p>But prior to debating the plausibility of the claims in an Evelyn Wood brochure,\nit would seem logical to consider the desirability of the goals—goals which\nappear to have slipped unchallenged into the realm of pedagogical axioms.\nAre such facile reading practices worthy of unqualified adulation? A careful\nlook at their implications suggests that such seeming saints can in fact be\ndevils.</p>\n</blockquote>\n<p>It's enough to drive you to madness. Why do we use computers to write text that\nno one will read? Why do we use computers to read text that no one wrote?</p>\n<p>Years ago, in college, during a previous AI winter, I sat in my room reading a\nshitty science fiction novel. Leo, from across the hall, walked in. &quot;What class\nis that for?&quot; he asked.</p>\n<p>&quot;Not for a class,&quot; I responded.</p>\n<p>&quot;So you're just reading it?&quot;</p>\n<blockquote>\n<p>Taken by themselves, the cardinal virtues of reading efficiency can collectively\ndemean the entire reading process by treating it as a function rather than as\nan art.</p>\n</blockquote>\n<p>There is nothing new under the sun. We have done this all before: we have fixated\non reading as production, production as profitable, and reading thus, ultimately,\nunimportant. A detail to be optimized away. An expense. ChatGPT didn't start this.\nIt won't end it. That's what I remind myself: we are living through just another\nstep in the evolution of culture.</p>\n<p>But then I still worry. What if this is it? Between short-form video and AI,\nbetween social media's pivot to stoking fascism and the publishing industry's pivot\nto reprinting AO3, what if language arts are done?</p>\n<p>None of these people care. That's the one thing I can say confidently, or at\nleast say that I truly believe. These people building the cutting edge of\nnatural language, these industry titans who style themselves as the loyalists\nof our nation and revolutionaries of the arts, they don't give a damn about\nwriting or reading. Text is an asset, an asset to extract, refine, and dispense.\nThey're just trying to make it through the news and their Twitter feeds and a\nhalf dozen pop-science books as fast as possible so that they can be, feel, or\nat least look like they're well-read. They assume that everyone else feels the\nsame way.</p>\n<blockquote>\n<p>How can any teacher extol the pleasures of reading when classroom practice\nimplicitly asserts that books are mines to be stripped and not pastures in\nwhich to dwell and delight?</p>\n</blockquote>\n<p>I've been quoting from Leonard R. Mendelsohn, whose paper &quot;Jetting to Utopia:\nThe Speed Reading Phenomenon&quot; ignores the question of whether or not speed\nreading works and instead considers whether or not it is a good idea. His\ncontext was the classroom of the 1970s: speed reading had caught on in education,\nand Mendelsohn worried. Well-intentioned teachers were training their students\nto absolutely optimize the mechanics of reading. In the process, Mendelsohn\nfeared, they had forgotten the point.</p>\n<blockquote>\n<p>Reading can provide fodder for the brain by the ready conversion of wood\npulp and printer's ink into social poise, persuasiveness, and a financially\nrewarding livelihood.</p>\n</blockquote>\n<p>Things have changed a great deal since Mendelsohn's day. The wood pulp is gone,\nso too the printer ink, and so too the financial rewards. Writing is, I suppose,\nmore of an art than ever before, as my chosen industry devotes its full might\nto destroying my chosen avocation.</p>\n<blockquote>\n<p>Although reading might be branded with the explicit label &quot;fun,&quot; it is not\nlong before the apt student reaches the conclusion that speed, concepts,\nand information are all one knows and all one needs to know.</p>\n</blockquote>\n<p>Mendelsohn's paper ran in the journal &quot;Language Arts.&quot; It's about four pages\nlong, about 2,300 words. It took me around ten minutes to read. An accomplished\nstudent of Evelyn Wood could read it in just a couple of minutes. With some\nchiding to stay brief and cut it out with the bulleted lists, Claude summarized\nit in a few sentences.</p>\n<p>For the journal, though, the paper is not quite long enough. Its last page is\nonly half full. The journal editor made up the difference, they found some\nfiller. It's a poem about clouds.</p>\n<p>ChatGPT can do so much, but it can't do the work of a poet. It can't match\nChrista Kessler, age 10, Powhatan School, Boyce, Virginia. She wrote &quot;Clouds&quot;\nalmost fifty years ago, an editor used it to round out the layout of a journal,\nJSTOR coughed it up along with my article, and now I am thinking about how clouds really\n<em>are</em> interludes in the middle of a great blue sea.</p>\n<p>That's what it's like to read slow. That's what it means to write.</p>\n<div class=\"footnotes\">\n<ol>\n<li id=\"fn-1\">\n<p>If you don't immediately know the exact kind of YouTube video I'm talking\nabout, maybe &quot;become a catgirl subliminal&quot; will jog your mind. Or just look it\nup and find out for yourself. Remember to stay hydrated.<a class=\"footnote\" href=\"#fnref-1\">&#8617;</a></p></li>\n<li id=\"fn-2\">\n<p>One of the hard things about writing about these kinds of fringe or\nparascientific topics is that they get all tangled up in each other and I have\na hard time not getting lost on tangents. Fortunately I think that many of my\nreaders have the same kind of internet exposure that I do and are probably\nfamiliar with the concept or claims made about binaural beats. You might be\nless aware that the whole thing dates back to the 1970s and perennially pops\nup in any kind of self-help or &quot;neurogenics&quot; or whatever context, including\nmany speed reading courses. To be fair, back in the 1970s the idea was new and\nfull of potential. Now it is not; decades of scientific investigation have\nfailed to produce clear evidence that binaural beats do anything.<a class=\"footnote\" href=\"#fnref-2\">&#8617;</a></p></li>\n</ol>\n</div>",
  "id": "https://computer.rip/2025-12-08-speed-reading.html"
}