{
  "title": "A USB interface to the \"Mother of All Demos\" keyset",
  "link": "http://www.righto.com/2025/03/mother-of-all-demos-usb-keyset-interface.html",
  "published": "2025-03-23T08:25:00.000-07:00",
  "summary": "<p>In the early 1960s, Douglas Engelbart started investigating how computers could augment human intelligence: <!-- https://youtu.be/yJDv-zdhzMY?si=m8GpQSIqnYfNnFsf&t=130)-->\n\"If, in your office, you as an intellectual worker\nwere supplied with a computer display backed up by a computer that was alive for you all day and was instantly responsive to every\naction you had, how much value could you derive from that?\"\nEngelbart developed many features of modern computing that we now take for granted: the mouse,<span id=\"fnref:mouse\"><a class=\"ref\" href=\"#fn:mouse\">1</a></span> hypertext, shared documents, windows,\nand a graphical user interface.\nAt the 1968 Joint Computer Conference, Engelbart demonstrated these innovations in a groundbreaking presentation, now known as\n\"The Mother of All Demos.\"</p>\n<!-- [Engelbart using the keyset to edit text. Note that the display doesn't support lower case text; instead, upper case is indicated by a line above the character. Adapted from <a href=\"https://youtu.be/UhpTiWyVa6k?si=cqfTbRsOxTy8eE01\">The Mother of All Demos</a>.](keyset-video2.jpg \"w500\")  -->\n\n<p><a href=\"https://static.righto.com/images/engelbart/interface.jpg\"><img alt=\"The keyset with my prototype USB interface.\" class=\"hilite\" height=\"364\" src=\"https://static.righto.com/images/engelbart/interface-w500.jpg\" title=\"The keyset with my prototype USB interface.\" width=\"500\" /></a><div class=\"cite\">The keyset with my prototype USB interface.</div></p>\n<p>Engelbart's demo also featured an input device known as the keyset, but unlike his other innovations, the keyset failed to catch on.\nThe 5-finger keyset lets you type without moving your hand, entering characters by pressing multiple keys simultaneously as a chord.\nChristina Englebart, his daughter, loaned one of Engelbart's keysets to me.\nI constructed an interface to connect the keyset to USB, so that it can be used with a modern computer.\nThe video below shows me typing with the keyset, using the mouse buttons to select upper case and special characters.<span id=\"fnref:keys\"><a class=\"ref\" href=\"#fn:keys\">2</a></span></p>\n\n\n<p>I wrote this blog post to describe my USB keyset interface.\nAlong the way, however, I got sidetracked by the history of The Mother of All Demos and how it obtained that name.\nIt turns out that Engelbart's demo isn't the first demo to be called \"The Mother of All Demos\".</p>\n<h2>Engelbart and The Mother of All Demos</h2>\n<!--\nAs SRI put it, Doug Engelbart envisioned harnessing the power of computers as tools for collaboration and the augmentation of our collective\nintelligence to work on humanity's most important problems.\n-->\n\n<p>Engelbart's work has its roots in\nVannevar Bush's 1945 visionary essay, \"<a href=\"https://worrydream.com/refs/Bush%20-%20As%20We%20May%20Think%20(Life%20Magazine%209-10-1945).pdf\">As We May Think</a>.\"\nBush envisioned thinking machines, along with the \"memex\", a compact machine holding a library of collective knowledge with hypertext-style links: \"The Encyclopedia Britannica could be reduced to the volume of a matchbox.\"\nThe memex could search out information based on associative search, building up a hypertext-like trail of connections.</p>\n<p>In the early 1960s, Engelbart was inspired by Bush's essay and set out\nto develop means to augment human intellect: \"increasing the capability of a man to approach a complex problem situation, to gain comprehension to suit his particular needs, and to derive solutions to problems.\"<span id=\"fnref:1962\"><a class=\"ref\" href=\"#fn:1962\">3</a></span>\nEngelbart founded the Augmentation Research Center at the Stanford Research Institute (now SRI), where\nhe and his team created a system called NLS (oN-Line System).</p>\n<p><a href=\"https://static.righto.com/images/engelbart/shopping-list.jpg\"><img alt=\"Engelbart editing a hierarchical shopping list.\" class=\"hilite\" height=\"351\" src=\"https://static.righto.com/images/engelbart/shopping-list-w500.jpg\" title=\"Engelbart editing a hierarchical shopping list.\" width=\"500\" /></a><div class=\"cite\">Engelbart editing a hierarchical shopping list.</div></p>\n<p>In 1968, Engelbart demonstrated NLS to a crowd of two thousand people\nat the Fall Joint Computer Conference.\nEngelbart gave the demo from the stage, wearing a crisp shirt and tie and a headset microphone.\nEngelbart created hierarchical documents, such as the shopping list above, and moved around them with hyperlinks.\nHe demonstrated how text could be created, moved, and edited with the keyset and mouse.\nOther documents included graphics, crude line drawing by today's standards but cutting-edge for the time.\nThe computer's output was projected onto a giant screen, along with video of Engelbart.</p>\n<p><a href=\"https://static.righto.com/images/engelbart/keyset-video.jpg\"><img alt=\"Engelbart using the keyset to edit text. Note that the display doesn't support lowercase text; instead, uppercase is indicated by a line above the character. Adapted from The Mother of All Demos.\" class=\"hilite\" height=\"354\" src=\"https://static.righto.com/images/engelbart/keyset-video-w500.jpg\" title=\"Engelbart using the keyset to edit text. Note that the display doesn't support lowercase text; instead, uppercase is indicated by a line above the character. Adapted from The Mother of All Demos.\" width=\"500\" /></a><div class=\"cite\">Engelbart using the keyset to edit text. Note that the display doesn't support lowercase text; instead, uppercase is indicated by a line above the character. Adapted from <a href=\"https://youtu.be/UhpTiWyVa6k?si=cqfTbRsOxTy8eE01\">The Mother of All Demos</a>.</div></p>\n<p>Engelbart sat at a specially-designed Herman Miller desk<span id=\"fnref:herman-miller\"><a class=\"ref\" href=\"#fn:herman-miller\">6</a></span> that held the\nkeyset, keyboard, and mouse, shown above.\nWhile Engelbart was on stage in San Francisco,\nthe SDS 940<span id=\"fnref:sds940\"><a class=\"ref\" href=\"#fn:sds940\">4</a></span> computer that ran the NLS software was 30 miles to the south in Menlo Park.<span id=\"fnref:moad-video\"><a class=\"ref\" href=\"#fn:moad-video\">5</a></span></p>\n<p>To the modern eye, the demo resembles a PowerPoint presentation over Zoom, as\nEngelbart collaborated with\nJeff Rulifson and Bill Paxton, miles away in Menlo Park.\n(Just like a modern Zoom call, the remote connection started with \"We're not hearing you. How about now?\")\nJeff Rulifson browsed the NLS code, jumping between code files with hyperlinks and expanding subroutines by clicking on them.\nNLS was written in custom <a href=\"https://bitsavers.org/pdf/sri/arc/NLS_Programmers_Guide_Jan76.pdf\">high-level languages</a>, which they developed\nwith a \"compiler compiler\" called <a href=\"https://en.wikipedia.org/wiki/TREE-META\">TREE-META</a>.\nThe NLS system held interactive documentation as well as tracking bugs and changes.\nBill Paxton interactively drew a diagram and then demonstrated how NLS could be used as a database, retrieving information by searching on keywords.\n(Although Engelbart was stressed by the live demo, Paxton told me that he was \"too young and inexperienced to be concerned.\")</p>\n<p><a href=\"https://static.righto.com/images/engelbart/demo-english.jpg\"><img alt=\"Bill Paxton, in Menlo Park, communicating with the conference in San Francisco.\" class=\"hilite\" height=\"326\" src=\"https://static.righto.com/images/engelbart/demo-english-w500.jpg\" title=\"Bill Paxton, in Menlo Park, communicating with the conference in San Francisco.\" width=\"500\" /></a><div class=\"cite\">Bill Paxton, in Menlo Park, communicating with the conference in San Francisco.</div></p>\n<p>Bill English, an electrical engineer, not only built the first mouse for Engelbart but was also the hardware mastermind behind the demo.\nIn San Francisco, the screen images were projected on a 20-foot screen by a Volkswagen-sized\nEidophor projector, bouncing light off a modulated oil film.\nNumerous cameras, video switchers and mixers created the video image.\nTwo leased microwave links and half a dozen antennas connected SRI in Menlo Park to the demo in San Francisco.\nHigh-speed modems send the mouse, keyset, and keyboard signals from the demo back to SRI.\nBill English spent months assembling the hardware and network for the demo and then managed the demo behind the scenes, assisted by a team of about 17 people.</p>\n<p>Another participant was the famed counterculturist Stewart Brand, known for the <a href=\"https://en.wikipedia.org/wiki/Whole_Earth_Catalog\">Whole Earth Catalog</a>\nand the WELL, one of the oldest online virtual communities.\nBrand advised Engelbart on the presentation, as well as running a camera. He'd often point the camera at a monitor to generate swirling psychedelic\nfeedback patterns, reminiscent of the LSD that he and Engelbart had experimented with.</p>\n<p>The demo received press attention such as\na San Francisco Chronicle article titled \"Fantastic World of Tomorrow's Computer\".\nIt stated, \"The most fantastic glimpse into the computer future was taking place in a windowless room on the third floor of the Civic Auditorium\"\nwhere Engelbart \"made a computer in Menlo Park do secretarial work for him that ten efficient secretaries couldn't do in twice the time.\"\nHis goal: \"We hope to help man do better what he does&mdash;perhaps by as much as 50 per cent.\"\nHowever, the demo received little attention in the following decades.<span id=\"fnref:attention\"><a class=\"ref\" href=\"#fn:attention\">7</a></span></p>\n<p>Engelbart continued his work at SRI for almost a decade, but as Engelbart commented with frustration,\n“There was a slightly less than universal perception of our value at SRI”.<span id=\"fnref:levy\"><a class=\"ref\" href=\"#fn:levy\">8</a></span>\nIn 1977, SRI sold the Augmentation Research Center to Tymshare, a time-sharing computing company.\n(Timesharing was the cloud computing of the 1970s and 1980s,\nwhere companies would use time on a centralized computer.)\nAt Tymshare, Engelbart's system was renamed AUGMENT and marketed as an office automation service, but Engelbart himself was sidelined from development,\na situation that he <a href=\"https://stanford.edu/dept/SUL/sites/engelbart/engfmst3-ntb.html\">described</a> as\nsitting in a corner and becoming invisible.</p>\n<p>Meanwhile, Bill English and some other SRI researchers<span id=\"fnref:researchers\"><a class=\"ref\" href=\"#fn:researchers\">9</a></span> migrated four miles south to Xerox PARC and worked on the Xerox Alto computer.\nThe Xerox Alto incorporated many ideas from the Augmentation Research Center including the graphical user interface, the mouse, and the keyset.\nThe Alto's keyset \nwas almost identical to the Engelbart keyset, as can be seen in the photo below.\nThe Alto's keyset was most popular for the networked 3D shooter game \"<a href=\"https://www.digibarn.com/collections/games/xerox-maze-war/index.html\">Maze War</a>\", with the clicking of keysets echoing through the hallways of Xerox PARC.</p>\n<p><a href=\"https://static.righto.com/images/engelbart/alto.jpg\"><img alt=\"A Xerox Alto with a keyset on the left.\" class=\"hilite\" height=\"359\" src=\"https://static.righto.com/images/engelbart/alto-w500.jpg\" title=\"A Xerox Alto with a keyset on the left.\" width=\"500\" /></a><div class=\"cite\">A Xerox Alto with a keyset on the left.</div></p>\n<p>Xerox famously failed to commercialize the ideas from the Xerox Alto, but Steve Jobs recognized the importance of interactivity, the graphical user interface, and the mouse\nwhen he visited Xerox PARC in 1979.\nSteve Jobs provided the Apple Lisa and Macintosh ended up with a graphical user interface and the mouse (streamlined to one button instead of three), but he left the keyset behind.<span id=\"fnref:parc\"><a class=\"ref\" href=\"#fn:parc\">10</a></span></p>\n<p>When McDonnell Douglas acquired Tymshare in 1984, Engelbart and his software&mdash;now called Augment&mdash;had a new home.<span id=\"fnref:augment\"><a class=\"ref\" href=\"#fn:augment\">11</a></span>\nIn 1987, McDonnell Douglas released a text editor and outline processor for the IBM PC called\n<a href=\"https://archive.org/details/1987-augment-mini-base-users-guide_202503\">MiniBASE</a>, \none of the few PC applications that supported a keyset.\nThe functionality of MiniBASE was almost identical to Engelbart's 1968 demo, but in 1987, MiniBASE\nwas competing against GUI-based word processors such as MacWrite and Microsoft Word, so MiniBASE had little impact.\nEngelbart left McDonnell Douglas in 1988, forming a research foundation called the <a href=\"https://www.nytimes.com/1988/09/05/business/business-people-computer-scientist-forming-a-foundation.html\">Bootstrap Institute</a> to continue his research independently.</p>\n<h2>The name: \"The Mother of All Demos\"</h2>\n<p>The name \"The Mother of All Demos\" has its roots in the Gulf War.\nIn August 1990, Iraq invaded Kuwait, leading to war between Iraq and a coalition of the United States and 41 other countries.\nDuring the months of buildup prior to active conflict, Iraq's leader, Saddam Hussein,\nexhorted the Iraqi people to prepare for \"<a href=\"https://www.nytimes.com/1990/09/22/world/confrontation-in-the-gulf-leaders-bluntly-prime-iraq-for-mother-of-all-battles.html\">the mother of all battles</a>\",<span id=\"fnref:mother\"><a class=\"ref\" href=\"#fn:mother\">12</a></span> a phrase that caught the attention of the media.\nThe battle didn't proceed as Hussein hoped: during <a href=\"https://www.nytimes.com/1991/02/28/world/war-gulf-president-bush-halts-offensive-combat-kuwait-freed-iraqis-crushed.html\">exactly 100 hours</a> of ground combat, the US-led coalition liberated Kuwait, pushed into Iraq, crushed the Iraqi forces,\nand declared a ceasefire.<span id=\"fnref:gulf-war\"><a class=\"ref\" href=\"#fn:gulf-war\">13</a></span>\nHussein's mother of all battles became the <a href=\"https://www.nytimes.com/1991/02/27/arts/critic-s-notebook-human-images-help-add-drama-to-war-coverage.html\">mother of all surrenders</a>.</p>\n<p>The phrase \"mother of all ...\" became the 1990s equivalent of a meme, used as a slightly-ironic superlative.\nIt was applied to everything\nfrom <a href=\"https://www.nytimes.com/1993/06/18/sports/us-open-golf-notebook-fore-the-mother-of-all-traffic-jams.html\">The Mother of All Traffic Jams</a> to <a href=\"https://amzn.to/4bzQ7Tc\">The Mother of All Windows Books</a>, from <a href=\"https://cooking.nytimes.com/recipes/1132-the-mother-of-all-butter-cookies\">The Mother of All Butter Cookies</a> to Apple calling mobile devices\n<a href=\"https://www.nytimes.com/1992/07/19/business/the-executive-computer-mother-of-all-markets-or-a-pipe-dream-driven-by-greed.html\">The Mother of All Markets</a>.<span id=\"fnref:mobile\"><a class=\"ref\" href=\"#fn:mobile\">14</a></span></p>\n<p>In 1991, this superlative was applied to a computer demo, but it wasn't Engelbart's demo.\nAndy Grove, Intel's president, gave a keynote speech at Comdex 1991 entitled <a href=\"https://www.youtube.com/watch?v=CwvOeKqXv18\">The Second Decade: Computer-Supported Collaboration</a>,\na live demonstration of his vision for PC-based video conferencing and wireless communication in the PC's second decade.\nThis complex hour-long demo required almost six months to prepare, with 15 companies collaborating.\nIntel called this demo \"The Mother of All Demos\", a name repeated in the New York Times, San Francisco Chronicle, Fortune, and PC Week.<span id=\"fnref:intel\"><a class=\"ref\" href=\"#fn:intel\">15</a></span>\nAndy Grove's demo was a hit, with over 20,000 people requesting a video tape, but the demo was soon forgotten.</p>\n<p><a href=\"https://static.righto.com/images/engelbart/nytimes-moad.jpg\"><img alt=\"On the eve of Comdex, the New York Times wrote about Intel's &quot;Mother of All Demos&quot;. Oct 21, 1991, D1-D2.\" class=\"hilite\" height=\"357\" src=\"https://static.righto.com/images/engelbart/nytimes-moad-w350.jpg\" title=\"On the eve of Comdex, the New York Times wrote about Intel's &quot;Mother of All Demos&quot;. Oct 21, 1991, D1-D2.\" width=\"350\" /></a><div class=\"cite\">On the eve of Comdex, the New York Times <a href=\"https://www.nytimes.com/1991/10/21/business/computer-industry-gathers-amid-chaos.html\">wrote</a> about Intel's \"Mother of All Demos\". Oct 21, 1991, D1-D2.</div></p>\n<p>In 1994, <em>Wired</em> writer Steven Levy wrote <a href=\"https://amzn.to/4kCE63A\">Insanely Great: The Life and Times of Macintosh, the Computer that Changed Everything</a>.<span id=\"fnref2:levy\"><a class=\"ref\" href=\"#fn:levy\">8</a></span>\nIn the second chapter of this comprehensive book, Levy explained how Vannevar Bush and Doug Engelbart \"sparked a chain reaction\" that led to the Macintosh.\nThe chapter described Engelbart's 1968 demo in detail including a throwaway line saying, \"<a href=\"https://archive.org/details/insanely_great_levy_hard_cover_1994_pdf__mlib/page/42/mode/1up\">It was the mother of all demos.</a>\"<span id=\"fnref:vandam\"><a class=\"ref\" href=\"#fn:vandam\">16</a></span>\nBased on my research, I think this is the source of the name \"The Mother of All Demos\" for Engelbart's demo.</p>\n<p>By the end of the century, multiple publications echoed Levy's catchy phrase.\nIn February 1999, the San Jose Mercury News had a <a href=\"https://web.archive.org/web/19991003082606/http://www.mercurycenter.com/svtech/news/special/engelbart/part4.htm\">special article</a> on Engelbart, saying that the demonstration was \"still called 'the mother of all demos'\", a description echoed by\nthe industry publication <a href=\"https://archive.org/details/sim_computerworld_1999-05-10_33_19/page/n83/mode/1up\">Computerworld</a>.<span id=\"fnref:still\"><a class=\"ref\" href=\"#fn:still\">17</a></span>\nThe book <a href=\"https://archive.org/details/nerds20100step/page/124/mode/2up\">Nerds: A Brief History of the Internet</a> stated that the demo \"has entered legend as 'the mother of all demos'\".\nBy this point, Engelbart's fame for the \"mother of all demos\" was cemented and the phrase became near-obligatory when writing about him.\nThe classic Silicon Valley history <a href=\"https://archive.org/details/fireinvalleymaki0000frei\">Fire in the Valley</a> (1984), for example,\ndidn't even mention Engelbart but in the <a href=\"https://archive.org/details/fireinvalleymaki00frei_0/page/303\">second edition</a> (2000),\n\"The Mother of All Demos\" had its own chapter.</p>\n<h2>Interfacing the keyset to USB</h2>\n<p>Getting back to the keyset interface,\nthe keyset consists of five microswitches, triggered by the five levers.\nThe switches are wired to a standard DB-25 connector.\nI used a <a href=\"https://www.pjrc.com/store/teensy36.html\">Teensy 3.6</a> microcontroller board for the interface, since this board can act both as a USB device\nand as a USB host.\nAs a USB device, the Teensy can emulate a standard USB keyboard.\nAs a USB host, the Teensy can receive input from a standard USB mouse.</p>\n<p>Connecting the keyset to the Teensy is (almost) straightforward, wiring the switches to five data inputs on the Teensy and the common line connected to ground.\nThe Teensy's input lines can be configured with pullup resistors inside the microcontroller. The result is that a data line shows <code>1</code> by default and\n<code>0</code> when the corresponding key is pressed.\nOne complication is that the keyset apparently has a 1.5 kΩ between the leftmost button and ground, maybe to indicate that the device is plugged in.\nThis resistor caused that line to always appear low to the Teensy.\nTo counteract this and allow the Teensy to read the pin, I connected a 1 kΩ pullup resistor to that one line.</p>\n<h3>The interface code</h3>\n<p>Reading the keyset and sending characters over USB is mostly straightforward, but there are a few complications.\nFirst, it's unlikely that the user will press multiple keyset buttons at exactly the same time. Moreover, the button contacts may bounce.\nTo deal with this, I wait until the buttons have a stable value for 100 ms (a semi-arbitrary delay) before sending a key over USB.</p>\n<p>The second complication is that with five keys, the keyset only supports 32 characters. To obtain upper case, numbers, special characters, and control\ncharacters, the keyset is designed to be used in conjunction with mouse buttons.\nThus, the interface needs to act as a USB host, so I can plug in a USB mouse to the interface.\nIf I want the mouse to be usable as a mouse, not just buttons in conjunction with the keyset, the interface mus forward mouse events over USB.\nBut it's not that easy, since mouse clicks in conjunction with the keyset shouldn't be forwarded. Otherwise, unwanted clicks will happen while\nusing the keyset.</p>\n<p>To emulate a keyboard, the code uses the <a href=\"https://docs.arduino.cc/language-reference/en/functions/usb/Keyboard/\">Keyboard</a> library. This library provides\nan API to send characters to the destination computer.\nInconveniently, the simplest method, <code>print()</code>, supports only regular characters, not special characters like <code>ENTER</code> or <code>BACKSPACE</code>. For those, I needed to\nuse the lower-level <code>press()</code> and <code>release()</code> methods.\nTo read the mouse buttons, \nthe code uses the <a href=\"https://github.com/PaulStoffregen/USBHost_t36\">USBHost_t36</a> library, the Teensy version of the <a href=\"https://docs.arduino.cc/libraries/usb-host-shield-library-2.0/\">USB Host</a> library.\nFinally, to pass mouse motion through to the destination computer, I use the <a href=\"https://docs.arduino.cc/language-reference/en/functions/usb/Mouse/\">Mouse</a> library.</p>\n<p>If you want to make your own keyset, Eric Schlaepfer has a model <a href=\"https://github.com/schlae/engelbart-keyset\">here</a>.</p>\n<h2>Conclusions</h2>\n<p>Engelbart claimed <!-- https://web.stanford.edu/class/history34q/readings/Engelbart/Engelbart_AugmentWorkshop.html --> that learning a keyset wasn't\ndifficult&mdash;a six-year-old kid could learn it in less than a week&mdash;but I'm not willing to invest much time into learning it. In my brief use of the keyset, I found it very difficult to use physically.\nPressing four keys at once is difficult, with the worst being all fingers except the ring finger. Combining this with a mouse button or two at the same time\ngave me the feeling that I was sight-reading a difficult piano piece.\nMaybe it becomes easier with use, but I noticed that Alto programs tended to treat the keyset as function keys, rather than a mechanism for typing with chords.<span id=\"fnref:alto\"><a class=\"ref\" href=\"#fn:alto\">18</a></span>\nDavid Liddle of Xerox PARC <a href=\"https://archive.computerhistory.org/resources/access/text/2020/06/102792010-05-01-acc.pdf#page=9\">said</a>, \"We found that [the keyset] was tending to slow people down, once you got away from really hot [stuff] system programmers.\nIt wasn't quite so good if you were giving it to other engineers, let alone clerical people and so on.\"</p>\n<p>If anyone else has a keyset that they want to connect via USB (unlikely as it may be), my code is on\n<a href=\"https://github.com/shirriff/keyset-to-usb-interface\">github</a>.<span id=\"fnref:hackaday\"><a class=\"ref\" href=\"#fn:hackaday\">19</a></span>  Thanks to Christina Engelbart for loaning me the keyset. Thanks to Bill Paxton for answering my questions.\nFollow me on Bluesky (<a href=\"https://bsky.app/profile/righto.com\">@righto.com</a>) or <a href=\"https://www.righto.com/feeds/posts/default\">RSS</a> for updates.</p>\n<h2>Footnotes and references</h2>\n<div class=\"footnote\">\n<ol>\n<li id=\"fn:mouse\">\n<p>Engelbart's use of the mouse wasn't arbitrary, but based on research.\nIn 1966, shortly after inventing the mouse, Engelbart carried out a\n<a href=\"https://archive.org/details/nasa_techdoc_19660020914\">NASA-sponsored study</a>\nthat evaluated six input devices: two types of joysticks, a Graphacon positioner, the mouse,\na light pen, and a control operated by the knees (leaving the hands free).\nThe mouse, knee control, and light pen performed best, with users finding the mouse satisfying to use. Although inexperienced subjects had some trouble with the mouse, experienced subjects considered\nit the best device.</p>\n<p><a href=\"https://static.righto.com/images/engelbart/devices.jpg\"><img alt=\"A joystick, Graphacon, mouse, knee control, and light pen were examined as input devices. Photos from the study.\" class=\"hilite\" height=\"546\" src=\"https://static.righto.com/images/engelbart/devices-w600.jpg\" title=\"A joystick, Graphacon, mouse, knee control, and light pen were examined as input devices. Photos from the study.\" width=\"600\" /></a><div class=\"cite\">A joystick, Graphacon, mouse, knee control, and light pen were examined as input devices. Photos from <a href=\"https://archive.org/details/nasa_techdoc_19660020914\">the study</a>.</div></p>\n<p><!-- -->&#160;<a class=\"footnote-backref\" href=\"#fnref:mouse\" title=\"Jump back to footnote 1 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:keys\">\n<p>The information sheet below from the Augmentation Research Center shows what keyset chords correspond to each character.\nI used this encoding for my interface software.\nEach column corresponds to a different combination of mouse buttons.</p>\n<p><a href=\"https://static.righto.com/images/engelbart/keyset-sheet-front.jpg\"><img alt=\"The information sheet for the keyset specifies how to obtain each character.\" class=\"hilite\" height=\"626\" src=\"https://static.righto.com/images/engelbart/keyset-sheet-front-w400.jpg\" title=\"The information sheet for the keyset specifies how to obtain each character.\" width=\"400\" /></a><div class=\"cite\">The information sheet for the keyset specifies how to obtain each character.</div></p>\n<p>The special characters above are <code>&lt;CD&gt;</code> (Command Delete, i.e. cancel a partially-entered command), <code>&lt;BC&gt;</code> (Backspace Character), <code>&lt;OK&gt;</code> (confirm command), <code>&lt;BW&gt;</code>(Backspace Word), <code>&lt;RC&gt;</code> (Replace Character), <code>&lt;ESC&gt;</code> (which does filename completion).</p>\n<p>NLS and the Augment software have the concept of a <a href=\"https://dougengelbart.org/content/view/218/\">viewspec</a>, a view specification that controls the\nview of a file.\nFor instance, viewspecs can expand or collapse an outline to show more or less detail, filter the content, or show authorship of sections.\nThe keyset can select viewspecs, as shown below.</p>\n<p><a href=\"https://static.righto.com/images/engelbart/keyset-sheet-back.jpg\"><img alt=\"Back of the keyset information sheet.\" class=\"hilite\" height=\"621\" src=\"https://static.righto.com/images/engelbart/keyset-sheet-back-w400.jpg\" title=\"Back of the keyset information sheet.\" width=\"400\" /></a><div class=\"cite\">Back of the keyset information sheet.</div></p>\n<p>Viewsets are explained in more detail in <a href=\"https://youtu.be/UhpTiWyVa6k?si=FsrEOWVd4QCszEGI&amp;t=316\">The Mother of All Demos</a>.\nFor my keyset interface, I ignored viewspecs since I don't have software to use these inputs, but\nit would be easy to modify the code to output the desired viewspec characters.</p>\n<p><!-- -->&#160;<a class=\"footnote-backref\" href=\"#fnref:keys\" title=\"Jump back to footnote 2 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:1962\">\n<p>See <a href=\"https://www.dougengelbart.org/pubs/augment-3906.html\">Augmenting Human Intellect: A Conceptual Framework</a>, Engelbart's 1962 report.&#160;<a class=\"footnote-backref\" href=\"#fnref:1962\" title=\"Jump back to footnote 3 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:sds940\">\n<p>Engelbart <a href=\"https://dougengelbart.org/pubs/papers/scanned-original/1968-augment-3954-A-Research-Center-for-Augmenting-Human-Intellect.pdf\">used</a> an SDS 940 computer running the Berkeley Timesharing System.\nThe computer had 64K words of core memory, with 4.5 MB of drum storage for swapping and 96 MB of disk storage for files.\nFor displays, the computer drove twelve 5\" high-resolution CRTs, but these weren't viewed directly.\nInstead, each CRT had a video camera pointed at it and the video was redisplayed on a larger display in a work station in each office.</p>\n<p>The SDS 940 was a large 24-bit scientific computer, built by Scientific Data Systems.\nAlthough SDS built the first integrated-circuit-based commercial computer in 1965 (the <a href=\"https://en.wikipedia.org/wiki/Scientific_Data_Systems#SDS_92\">SDS 92</a>),\nthe SDS 940 was a transistorized system.\nIt consisted of multiple refrigerator-sized cabinets, as shown below. Since each memory cabinet held 16K words and the computer at SRI had 64K,\nSRI's computer had two additional cabinets of memory.</p>\n<p><a href=\"https://static.righto.com/images/engelbart/sds940.jpg\"><img alt=\"Front view of an SDS 940 computer. From the Theory of Operation manual.\" class=\"hilite\" height=\"370\" src=\"https://static.righto.com/images/engelbart/sds940-w800.jpg\" title=\"Front view of an SDS 940 computer. From the Theory of Operation manual.\" width=\"800\" /></a><div class=\"cite\">Front view of an SDS 940 computer. From the <a href=\"http://www.bitsavers.org/pdf/sds/9xx/940/980126A_940_TheoryOfOperation_Mar67.pdf\">Theory of Operation</a> manual.</div></p>\n<p>In the late 1960s, Xerox wanted to get into the computer industry, so Xerox\n<a href=\"https://www.nytimes.com/1969/05/16/archives/xerox-joins-computer-industry-xerox-entering-computer-field.html\">bought</a> Scientific Data Systems in 1969 for $900 million (about $8 billion in current dollars).\nThe acquisition was a disaster. After steadily losing money, Xerox decided to <a href=\"https://www.nytimes.com/1975/07/22/archives/computer-making-will-end-at-xerox-844million-writeoff-is-taken-in.html\">exit</a> the mainframe computer business in 1975.\nXerox's CEO summed up the purchase: \"With hindsight, we would not have done the same thing.\"&#160;<a class=\"footnote-backref\" href=\"#fnref:sds940\" title=\"Jump back to footnote 4 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:moad-video\">\n<p>The Mother of All Demos is on <a href=\"https://www.youtube.com/watch?v=UhpTiWyVa6k\">YouTube</a>,\nas well as a five-minute <a href=\"https://www.youtube.com/watch?v=B6rKUf9DWRI\">summary</a> for the impatient.&#160;<a class=\"footnote-backref\" href=\"#fnref:moad-video\" title=\"Jump back to footnote 5 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:herman-miller\">\n<p>The desk for the keyset and mouse was designed by Herman Miller, the office furniture company.\nHerman Miller worked with SRI to design the\ndesks, chairs, and office walls as part of their plans for the office of the future.\nHerman Miller invented the cubicle office in 1964, creating a modern replacement for the commonly used open office arrangement.&#160;<a class=\"footnote-backref\" href=\"#fnref:herman-miller\" title=\"Jump back to footnote 6 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:attention\">\n<p>Engelbart's demo is famous now, but for many years it was ignored.\nFor instance, Electronic Design had a long\n<a href=\"https://archive.org/details/bitsavers_ElectronicignV17N0319690201_71033514/page/25/mode/1up\">article</a>\non Engelbart's work in 1969 (putting the system on the cover), but there was no mention of the demo.</p>\n<p><a href=\"https://static.righto.com/images/engelbart/electronic-design.jpg\"><img alt=\"Engelbart's system was featured on the cover of Electronic Design. Feb 1, 1969. (slightly retouched)\" class=\"hilite\" height=\"398\" src=\"https://static.righto.com/images/engelbart/electronic-design-w500.jpg\" title=\"Engelbart's system was featured on the cover of Electronic Design. Feb 1, 1969. (slightly retouched)\" width=\"500\" /></a><div class=\"cite\">Engelbart's system was featured on the <a href=\"https://archive.org/details/bitsavers_ElectronicignV17N0319690201_71033514/mode/1up\">cover</a> of Electronic Design. Feb 1, 1969. (slightly retouched)</div></p>\n<p>But by the 1980s, the Engelbart demo started getting attention.\nThe 1986 documentary <a href=\"https://archive.org/details/XD303_86KTEH54_SiliconVllyBoomtown?start=1884.5\">Silicon Valley Boomtown</a> had a long\nsection on Engelbart's work and the demo. By 1988, the New York Times was referring to the demo as <a href=\"https://www.nytimes.com/1988/09/05/business/business-people-computer-scientist-forming-a-foundation.html\">legendary</a>.&#160;<a class=\"footnote-backref\" href=\"#fnref:attention\" title=\"Jump back to footnote 7 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:levy\">\n<p>Levy had written about Engelbart a decade earlier, in the May 1984 issue of the magazine <a href=\"https://guidebookgallery.org/articles/ofmiceandmen\">Popular Computing</a>.\nThe article focused on the mouse, recently available to the public through the Apple Lisa and the IBM PC (as an option).\nThe big issue at the time was how many buttons a mouse should have: three like Engelbart's mouse, the one button that Apple used, or two buttons \nas Bill Gates preferred.\nBut Engelbart's larger vision also came through in Levy's interview along with his frustration that most of his research had been ignored,\novershadowed by the mouse.\nNotably, there was no mention of Engelbart's 1968 demo in the article.&#160;<a class=\"footnote-backref\" href=\"#fnref:levy\" title=\"Jump back to footnote 8 in the text\">&#8617;</a><a class=\"footnote-backref\" href=\"#fnref2:levy\" title=\"Jump back to footnote 8 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:researchers\">\n<p>The SRI researchers who moved to Xerox include Bill English, Charles Irby, Jeff Rulifson, Bill Duval, and Bill Paxton (<a href=\"https://web.stanford.edu/class/history34q/readings/Engelbart/Engelbart_AugmentWorkshop.html\">details</a>).&#160;<a class=\"footnote-backref\" href=\"#fnref:researchers\" title=\"Jump back to footnote 9 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:parc\">\n<p>In 2023, Xerox donated the entire Xerox PARC research center to SRI. The research center remained in Palo Alto but became part of SRI.\nIn a sense, this closed the circle, since many of the people and ideas from SRI had gone to PARC in the 1970s.\nHowever, both PARC and SRI had changed radically since the 1970s, with the cutting edge of computer research moving elsewhere.&#160;<a class=\"footnote-backref\" href=\"#fnref:parc\" title=\"Jump back to footnote 10 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:augment\">\n<p>For a detailed discussion of the Augment system, see <a href=\"https://archive.org/details/seyboldreportonw00medi\">Tymshare's Augment: Heralding a New Era</a>, Oct 1978.\nAugment provided a \"broad range of information handling capability\" that was not available elsewhere.\nUnlike other word processing systems, Augment was targeted at the professional, not clerical workers,\npeople who were \"eager to explore the open-ended possibilities\" of the interactive process.</p>\n<p>The main complaints about Augment were its price and that it was not easy to use. Accessing Engelbart's NLS system over ARPANET cost an eye-watering $48,000 a year (over $300,000 a year in current dollars).\nTymshare's Augment service was cheaper (about $80 an hour in current dollars), but still much more expensive than a standard word processing\nservice.</p>\n<p>Overall, the article found that Augment users were delighted with the system: \"It is stimulating to belong to the electronic intelligentsia.\"\nUsers found it to be \"a way of life—an absorbing, enriching experience\".&#160;<a class=\"footnote-backref\" href=\"#fnref:augment\" title=\"Jump back to footnote 11 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:mother\">\n<p>William Safire provided background in the New York Times, <a href=\"https://www.nytimes.com/1991/02/24/magazine/on-language-degrading-attrition.html\">explaining</a>\nthat \"the mother of all battles\"\noriginally referred to the battle of Qadisiya in A.D. 636, and Saddam Hussein was referencing that ancient battle.\nA translator <a href=\"https://www.nytimes.com/1991/03/07/opinion/l-mother-of-battles-mistranslates-arabic-834791.html\">responded</a>, however,\nthat the Arabic expression would be better translated as \"the great battle\" than \"the mother of all battles.\"&#160;<a class=\"footnote-backref\" href=\"#fnref:mother\" title=\"Jump back to footnote 12 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:gulf-war\">\n<p>The end of the Gulf War left Saddam Hussein in control of Iraq and left thousands of US troops in Saudi Arabia.\nThese factors would turn out to be catastrophic in the following years.&#160;<a class=\"footnote-backref\" href=\"#fnref:gulf-war\" title=\"Jump back to footnote 13 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:mobile\">\n<p>At the Mobile '92 conference, Apple's CEO, John Sculley, said personal communicators could be \"the mother of all markets,\"\nwhile Andy Grove of Intel said that the idea of a wireless personal communicator in every pocket is \"a pipe dream driven by greed\"\n(<a href=\"https://www.nytimes.com/1992/07/19/business/the-executive-computer-mother-of-all-markets-or-a-pipe-dream-driven-by-greed.html\">link</a>).\nIn hindsight, Sculley was completely right and Grove was completely wrong.&#160;<a class=\"footnote-backref\" href=\"#fnref:mobile\" title=\"Jump back to footnote 14 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:intel\">\n<p>Some references to Intel's \"Mother of all demos\" are\n<a href=\"https://www.nytimes.com/1991/10/21/business/computer-industry-gathers-amid-chaos.html\">Computer Industry Gathers Amid Chaos</a>, New York Times, Oct 21, 1991 \nand \"Intel's High-Tech Vision of the Future: Chipmaker proposes using computers to dramatically improve productivity\", San Francisco Chronicle, Oct 21, 1991, p24.\nThe title of an article in Microprocessor Report, \"Intel Declares Victory in the Mother of All Demos\" (Nov. 20, 1991), alluded to the recently-ended war.\n<a href=\"https://archive.org/details/fortune135janluce/page/n401/mode/1up\">Fortune</a> wrote about Intel's demo in the  Feb 17, 1997 issue.\nA longer description of Intel's demo is in the book <a href=\"https://books.google.com/books?id=VazSDwAAQBAJ&amp;pg=PA264\">Strategy is Destiny</a>.&#160;<a class=\"footnote-backref\" href=\"#fnref:intel\" title=\"Jump back to footnote 15 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:vandam\">\n<p>Several sources claim that Andy van Dam was the first to call Engelbart's demo \"The Mother of All Demos.\" Although van Dam attended the 1968 demo,\nI couldn't find any evidence that he coined the phrase. \nJohn Markoff, a technology journalist for The New York Times, wrote a book <a href=\"https://books.google.com/books?id=cTyfxP-g2IIC&amp;pg=PT228&amp;dq=%22van+dam%22+%22mother+of+all+demos%22&amp;hl=en&amp;newbks=1&amp;newbks_redir=0&amp;sa=X&amp;ved=2ahUKEwiC4ajp7JKMAxWKLkQIHTMiGLoQ6AF6BAgGEAM#v=onepage&amp;q=%22van%20dam%22%20%22mother%20of%20all%20demos%22&amp;f=false\">What the Dormouse Said: How the Sixties Counterculture Shaped the Personal Computer Industry</a>.\nIn this book, Markoff wrote about Engelbart's demo, saying \"Years later, his talk remained 'the mother of all demos' in the words of Andries van Dam, a Brown University computer scientist.\"\nAs far as I can tell, van Dam used the phrase but only after it had already been popularized by Levy.&#160;<a class=\"footnote-backref\" href=\"#fnref:vandam\" title=\"Jump back to footnote 16 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:still\">\n<p>It's curious to write that the demonstration was <em>still</em> called the \"mother of all demos\" when the phrase was just a few years old.&#160;<a class=\"footnote-backref\" href=\"#fnref:still\" title=\"Jump back to footnote 17 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:alto\">\n<p>The photo below shows a keyset from the Xerox Alto.\nThe five keys are labeled with separate functions&mdash;Copy, Undelete, Move, Draw, and Fine&mdash;\nfor use with <a href=\"https://xeroxparcarchive.computerhistory.org/indigo/da/AlePaper.dm!1_/.Ale.paper.html\">ALE</a>,\na program for IC design.\nALE supported\n<a href=\"https://xeroxparcarchive.computerhistory.org/ivy/sweet/alto/ale/.ALE.press!1.pdf\">keyset chording</a>\nin combination with the mouse.</p>\n<p><a class=\"footnote-backref\" href=\"#fnref:alto\" title=\"Jump back to footnote 18 in the text\">&#8617;</a><a href=\"https://static.righto.com/images/engelbart/alto-keyset.jpg\"><img alt=\"Keyset from a Xerox Alto, courtesy of Digibarn.\" class=\"hilite\" height=\"415\" src=\"https://static.righto.com/images/engelbart/alto-keyset-w500.jpg\" title=\"Keyset from a Xerox Alto, courtesy of Digibarn.\" width=\"500\" /></a><div class=\"cite\">Keyset from a Xerox Alto, courtesy of Digibarn.</div></p>\n</li>\n<li id=\"fn:hackaday\">\n<p>After I implemented this interface, I came across a project that constructed a 3D-printed chording keyset, also using a Teensy for the USB interface. You can find that project <a href=\"https://www.pjrc.com/engelbart-chording-keyset/\">here</a>.&#160;<a class=\"footnote-backref\" href=\"#fnref:hackaday\" title=\"Jump back to footnote 19 in the text\">&#8617;</a></p>\n</li>\n</ol>\n</div>",
  "id": "tag:blogger.com,1999:blog-6264947694886887540.post-4116959493954575947"
}