{
  "title": "Failing upwards: the Twitter encrypted DM failure",
  "link": "https://mjg59.dreamwidth.org/71188.html",
  "published": "Tue, 18 Mar 2025 23:58:52 GMT",
  "summary": "Almost two years ago, Twitter launched encrypted direct messages. I wrote about their technical implementation <a href=\"https://mjg59.dreamwidth.org/66791.html\">at the time</a>, and to the best of my knowledge nothing has changed. The short story is that the actual <em>encryption</em> primitives used are entirely normal and fine - messages are encrypted using AES, and the AES keys are exchanged via NIST P-256 elliptic curve asymmetric keys. The asymmetric keys are each associated with a specific device or browser owned by a user, so when you send a message to someone you encrypt the AES key with all of their asymmetric keys and then each device or browser can decrypt the message again. As long as the keys are managed appropriately, this is infeasible to break.<br /><br />But how do you know what a user's keys are? I also wrote about this <a href=\"https://mjg59.dreamwidth.org/62598.html\">last year</a> - key distribution is a hard problem. In the Twitter DM case, you ask Twitter's server, and if Twitter wants to intercept your messages they replace your key. The documentation for the feature <a href=\"https://help.x.com/en/using-x/encrypted-direct-messages\">basically admits this</a> - if people with guns showed up there, they could very much compromise the protection in such a way that all future messages you sent were readable. It's also impossible to prove that they're not already doing this without every user verifying that the public keys Twitter hands out to other users correspond to the private keys they hold, something that Twitter provides no mechanism to do.<br /><br />This isn't the only weakness in the implementation. Twitter may not be able read the messages, but every encrypted DM is sent through exactly the same infrastructure as the unencrypted ones, so Twitter can see the time a message was sent, who it was sent to, and roughly how big it was. And because pictures and other attachments in Twitter DMs aren't sent in-line but are instead replaced with links, the implementation would encrypt the links but not the attachments - this is \"solved\" by simply blocking attachments in encrypted DMs. There's no forward secrecy - if a key is compromised it allows access to not only all new messages created with that key, but also all previous messages. If you log out of Twitter the keys are still stored by the browser, so if you can potentially be extracted and used to decrypt your communications. And there's no group chat support at all, which is more a functional restriction than a conceptual one.<br /><br />To be fair, these are hard problems to solve! <a href=\"https://signal.org\">Signal</a> solves all of them, but Signal is the product of a large number of highly skilled experts in cryptography, and even so it's taken years to achieve all of this. When Elon announced the launch of encrypted DMs he indicated that new features would be developed quickly - he's since publicly mentioned the feature a grand total of <a href=\"https://x.com/elonmusk/status/1810131200939299254\">once</a>, in which he mentioned further feature development that just didn't happen. None of the limitations mentioned in the documentation have been addressed in the 22 months since the feature was launched.<br /><br />Why? Well, it turns out that the feature was developed by a total of two engineers, neither of whom is still employed at Twitter. The tech lead for the feature was <a href=\"https://www.linkedin.com/in/stanleynetworks/\">Christopher Stanley</a>, who was actually a SpaceX employee at the time. Since then he's ended up at DOGE, where he apparently <a href=\"https://x.com/maggieNYT/status/1901820644087472537\">set off alarms when attempting to install Starlink</a>, and who today is apparently <a href=\"https://finance.yahoo.com/news/musk-ally-doge-member-stanley-013902235.html\">being appointed to the board of Fannie Mae</a>, a government-backed mortgage company.<br /><br />Anyway. Use Signal.<br /><br /><img alt=\"comment count unavailable\" height=\"12\" src=\"https://www.dreamwidth.org/tools/commentcount?user=mjg59&amp;ditemid=71188\" style=\"vertical-align: middle;\" width=\"30\" /> comments",
  "id": "https://mjg59.dreamwidth.org/71188.html"
}