{
  "title": "A Navajo weaving of an integrated circuit: the 555 timer",
  "link": "http://www.righto.com/2025/09/marilou-schultz-navajo-555-weaving.html",
  "published": "2025-09-06T07:39:00.000-07:00",
  "summary": "<p>The noted Diné (Navajo) weaver Marilou Schultz recently completed an intricate weaving\ncomposed of\nthick white lines on a black background, punctuated with reddish-orange diamonds.\nAlthough this striking rug may appear abstract, it shows the internal circuitry of a tiny silicon chip known\nas the 555 timer.\nThis chip has hundreds of applications in\neverything from a sound generator to a windshield wiper controller.\nAt one point, the 555 was the world's best-selling integrated circuit with billions sold.\nBut how did the chip get turned into a rug?</p>\n<p><a href=\"https://static.righto.com/images/navajo-555/rug-555.jpg\"><img alt=\"&quot;Popular Chip&quot; by Marilou Schultz.\n Photo courtesy of First American Art Magazine.\" class=\"hilite\" height=\"665\" src=\"https://static.righto.com/images/navajo-555/rug-555-w500.jpg\" title=\"&quot;Popular Chip&quot; by Marilou Schultz.\n Photo courtesy of First American Art Magazine.\" width=\"500\" /></a><div class=\"cite\">\"Popular Chip\" by Marilou Schultz.\n Photo courtesy of <a href=\"https://firstamerican.art/\">First American Art Magazine</a>.</div></p>\n<p>The 555 chip is constructed from a tiny flake of silicon with a layer of metallic wiring on top.\nIn the rug, this wiring is visible as the thick white lines, while the silicon forms the black background.\nOne conspicuous feature of the rug is the reddish-orange diamonds around the perimeter.\nThese correspond to the connections between the silicon chip and its eight pins. Tiny golden bond wires&mdash;thinner than a human hair&mdash;are attached to the square bond pads to provide these connections.\nThe circuitry of the 555 chip contains 25 transistors, silicon devices that can switch\non and off.\nThe rug is dominated by three large transistors, the filled squares with a <span style=\"font-family: sans-serif;\">王</span> pattern inside, while the remaining transistors are represented by small dots.</p>\n<p>The weaving was inspired by a photo of the 555 timer die taken by\nAntoine Bercovici\n(<a href=\"https://x.com/siliconinsid\">Siliconinsider</a>); I suggested this photo to Schultz as a possible subject\nfor a rug.  The diagram below compares the \nweaving (left) with the die photo (right).\nAs you can see, the weaving closely follows the actual chip, but there are a few artistic differences.\nFor instance, two of the bond pads have been removed, the circuitry at the top has been simplified,\nand the part number at the bottom has been removed.</p>\n<p><a href=\"https://static.righto.com/images/navajo-555/comparison.jpg\"><img alt=\"A comparison of the rug (left) and the original photograph (right).\nDark-field image of the 555 timer is courtesy of Antoine Bercovici.\" class=\"hilite\" height=\"440\" src=\"https://static.righto.com/images/navajo-555/comparison-w700.jpg\" title=\"A comparison of the rug (left) and the original photograph (right).\nDark-field image of the 555 timer is courtesy of Antoine Bercovici.\" width=\"700\" /></a><div class=\"cite\">A comparison of the rug (left) and the original photograph (right).\nDark-field image of the 555 timer is courtesy of Antoine Bercovici.</div></p>\n<p>Antoine took the die photo with a dark field microscope, a special type of microscope that\nproduces an image on a black background.\nThis image emphasizes the metal layer on the top of the die.\nIn comparison, a standard bright-field microscope produced the image below.\nWhen a chip is manufactured, regions of silicon are \"doped\" with impurities to create transistors\nand resistors.\nThese regions are visible in the image below as subtle changes in the color of the silicon.</p>\n<p><a href=\"https://static.righto.com/images/navajo-555/RCA-CA555.jpg\"><img alt=\"The RCA CA555 chip. Photo courtesy of Tiny Transistors.\" class=\"hilite\" height=\"402\" src=\"https://static.righto.com/images/navajo-555/RCA-CA555-w330.jpg\" title=\"The RCA CA555 chip. Photo courtesy of Tiny Transistors.\" width=\"330\" /></a><div class=\"cite\">The RCA CA555 chip. Photo courtesy of <a href=\"https://www.tinytransistors.net/2021/08/05/the-555-timer-part-2/\">Tiny Transistors</a>.</div></p>\n<p>In the weaving, the chip's design appears almost monumental, making it easy to forget that the\nactual chip is microscopic.\nFor the photo below,\nI obtained a version of the chip packaged in a metal can, rather than the typical rectangle of\nblack plastic.\nCutting the top off the metal can reveals the tiny chip inside, with eight gold bond wires connecting the\ndie to the pins of the package.\nIf you zoom in on the photo, you may recognize the three large transistors that dominate the rug.</p>\n<p><a href=\"https://static.righto.com/images/navajo-555/1-penny.jpg\"><img alt=\"The 555 timer die inside a metal-can package, with a penny for comparison. Click this image (or any other) for a larger version.\" class=\"hilite\" height=\"336\" src=\"https://static.righto.com/images/navajo-555/1-penny-w500.jpg\" title=\"The 555 timer die inside a metal-can package, with a penny for comparison. Click this image (or any other) for a larger version.\" width=\"500\" /></a><div class=\"cite\">The 555 timer die inside a metal-can package, with a penny for comparison. Click this image (or any other) for a larger version.</div></p>\n<p>The artist, Marilou Schultz, has been creating chip rugs since 1994, when Intel commissioned a\nrug based on the Pentium as a gift to AISES (American Indian Science &amp; Engineering Society).\nAlthough Schultz learned weaving as a child, the Pentium rug was a challenge due to its complex pattern\nand lack of symmetry; a day's work might add just an inch to the rug.\nThis dramatic weaving was created with wool from the long-horned Navajo-Churro sheep, colored with\ntraditional plant dyes.</p>\n<p><a href=\"https://static.righto.com/images/navajo-555/pentium-rug.jpg\"><img alt=\"&quot;Replica of a Chip&quot;, created by Marilou Schultz, 1994. Wool. Photo taken at the National Gallery of Art, 2024.\" class=\"hilite\" height=\"560\" src=\"https://static.righto.com/images/navajo-555/pentium-rug-w500.jpg\" title=\"&quot;Replica of a Chip&quot;, created by Marilou Schultz, 1994. Wool. Photo taken at the National Gallery of Art, 2024.\" width=\"500\" /></a><div class=\"cite\">\"Replica of a Chip\", created by Marilou Schultz, 1994. Wool. Photo taken at the National Gallery of Art, 2024.</div></p>\n<p>For the 555 timer weaving, Schultz experimented with different materials. Silver and gold metallic threads\nrepresent the aluminum and copper in the chip.\nThe artist explains that \"it took a lot more time to incorporate the metallic threads,\" but it was\nworth the effort because \"it is spectacular to see the rug with the metallics in the dark with a little light hitting it.\"\nAniline dyes provided the black and lavender colors.\nAlthough natural logwood dye\nproduces a beautiful purple, it fades over time, so Schultz used an aniline dye instead.\nThe lavender colors are dedicated to the weaver's mother, who passed away in February;\npurple was her favorite color.</p>\n<h2>Inside the chip</h2>\n<p>How does the 555 chip produce a particular time delay?\nYou add external components&mdash;resistors and a capacitor&mdash;to select the time.\nThe capacitor is filled (charged) at a speed controlled by the resistor. When the capacitor get \"full\",\nthe 555 chip switches operation and starts emptying (discharging) the capacitor.\nIt's like filling a sink: if you have a large sink (capacitor) and a trickle of water (large resistor),\nthe sink fills slowly. But if you have a small sink (capacitor) and a lot of water (small resistor),\nthe sink fills quickly.\nBy using different resistors and capacitors, the 555 timer can provide time intervals from microseconds\nto hours.</p>\n<p>I've constructed an interactive chip browser that shows how the regions of the rug correspond to specific\nelectronic components in the physical chip. Click on any part of the rug to learn the function of\nthe corresponding component in the chip.</p>\n<div class=\"chipcanvasholder\" id=\"die555canvasholder\" style=\"height: 482px;\">\n<canvas id=\"die555can2\"></canvas>\n<canvas id=\"die555can1\"></canvas>\n</div>\n\n<div class=\"chiptext\" id=\"chiptext555\" style=\"width: 736px;\">Click the die or schematic for details...</div>\n<div class=\"chipcanvasholder\" id=\"schematic555canvasholder\" style=\"display: none;\">\n<canvas id=\"schematic555can2\"></canvas>\n<canvas id=\"schematic555can1\"></canvas>\n</div>\n\n\n\n\n\n\n<!--\n<script src=\"jquery.min.js\"></script>\n<script src=\"die-555.js\"></script>\n<script src=\"schematic-555.js\"></script>\n<script src=\"notes-555.js\"></script>\n<script src=\"chip-viewer-555.js\"></script>\n-->\n\n\n\n<p>For instance, two of the large square transistors turn the chip's output on or off, while the third\nlarge transistor discharges the capacitor when it is full. (To be precise, the capacitor goes between 1/3 full\nand 2/3 full to avoid issues near \"empty\" and \"full\".)\nThe chip has circuits called comparators that detect when the capacitor's voltage reaches 1/3 or 2/3,\nswitching between emptying and filling at those points.\nIf you want more technical details about the 555 chip, see my previous articles:\n<a href=\"https://www.righto.com/2022/01/silicon-die-teardown-look-inside-early.html\">an early 555 chip</a>,\na <a href=\"https://www.righto.com/2016/02/555-timer-teardown-inside-worlds-most.html\">555 timer</a> similar to the rug,\nand a more modern <a href=\"https://www.righto.com/2016/04/teardown-of-cmos-555-timer-chip-how.html\">CMOS version of the 555</a>.</p>\n<h2>Conclusions</h2>\n<p>The similarities between Navajo weavings and the patterns in integrated circuits have long been <a href=\"https://archive.computerhistory.org/resources/access/text/2017/01/102770254-05-01-acc.pdf\">recognized</a>.\nMarilou Schultz's weavings of integrated circuits make these visual metaphors into concrete works of art.\nThis connection is not just metaphorical, however; in the 1960s, the semiconductor company Fairchild employed numerous Navajo workers to assemble chips in Shiprock, New Mexico.\nI wrote about this complicated history in <a href=\"https://www.righto.com/2024/08/pentium-navajo-fairchild-shiprock.html\">The Pentium as a Navajo Weaving</a>.</p>\n<!--\nThe 555 timer is an old chip, introduced in 1971, so it is much simpler than modern chips: 25 transistors\nversus billions.\nThis simplicity results in the striking patterns in its design.\nNowadays, the 555 timer is obsolete for most applications since it is easier to perform tasks in software\nwith an inexpensive microcontroller chip.\nEven so, the 555 timer is still manufactured in massive quantities.\n-->\n\n<p>This work is being shown at SITE Santa Fe's <a href=\"https://www.sitesantafe.org/en/once-within-a-time/\">Once Within a Time</a> exhibition (running until January 2026).\nI haven't seen the exhibition in person, so let me know if you visit it.\nFor more about Marilou Schultz's art, see <a href=\"https://hyperallergic.com/1014669/marilou-schultz-dine-weaver-who-turns-microchips-into-art\">The Diné Weaver Who Turns Microchips Into Art</a>, or\n<a href=\"https://www.youtube.com/watch?v=lyVDvYURpqo\">A Conversation with Marilou Schultz</a> on YouTube.</p>\n<p>Many thanks to Marilou Schultz for discussing her art with me.\nThanks to <a href=\"https://firstamerican.art/\">First American Art Magazine</a> for providing the photo of her 555 rug.\nFollow me on Mastodon (<a href=\"https://oldbytes.space/@kenshirriff\">@kenshirriff@oldbytes.space</a>),\nBluesky (<a href=\"https://bsky.app/profile/righto.com\">@righto.com</a>),\nor <a href=\"https://www.righto.com/feeds/posts/default\">RSS</a> for updates.</p>",
  "id": "tag:blogger.com,1999:blog-6264947694886887540.post-2507101691857573991"
}