{
  "title": "Everyone's okay with their AI, just not yours",
  "link": "https://idiallo.com/blog/ai-is-ok-just-not-yours?src=feed",
  "published": "Wed, 28 Jan 2026 12:00:00 GMT",
  "summary": "<p>There's a strange contradiction happening in tech right now. Companies are forcing employees to integrate AI into their workflows, celebrating productivity gains and AI-assisted everything. Yet when job candidates use AI during interviews, they're treated like they've committed career suicide.</p>\n\t\t\t<p>Every colleague I talk to has a story. The candidate's eyes darting left and right, reading an answer as it generates in real-time. The awkward \"could you repeat that?\" while they discreetly type the question. The unnatural pauses as they wait for ChatGPT to spit out a response on their bandwidth-choked connection.</p>\n\n<p>\"Wait, are you using AI?\" </p>\n\n<p>There's no good answer. The jig is up.</p>\n\n<div class=\"image\">\n    <img alt=\"The Jig is up\" src=\"https://cdn.idiallo.com/images/assets/611/jig.jpg\" />\n</div>\n\n<p>The interviewer ends the session, logs into Slack to share the story. \"Can you believe the nerve of this guy?\" Then opens Cursor to check if the AI has finished writing their unit tests.</p>\n\n<p>Everyone seems to have their own personal definition of acceptable AI use. If you Vibecode an entire app, it's because you are lazy and unskilled. But use AI for code review and writing tests? You are smart and efficient. </p>\n\n<p>You could use AI to remove photo backgrounds or clean up artifacts, that's just good editing. But generating an image for your blog post? You are stealing from hardworking artists. You are a fraud! You probably use AI as a writing assistant like a monster. But using it to generate documentation from your code is indispensable.</p>\n\n<p>We're all drawing lines in the sand, conveniently placing ourselves on the \"legitimate use\" side while everyone else is being lazy or dishonest.</p>\n\n<p>People actively block AI agents from scraping their websites, while simultaneously training their own models on similar data. Developers praise LLMs for making them 10x more productive, then scoff at candidates who might use the same tools to prepare or even respond during an interview.</p>\n\n<p>When it comes to job interviews, here is my take: using AI in an interview is an attempt at deception. An interview is supposed to assess <em>your</em> capabilities, not ChatGPT's. If you ace the interview with AI assistance, why would we hire you when we could just subscribe to that LLM for a fraction of the cost?</p>\n\n<p>Regular AI use can atrophy your thinking skills. You become like an npm package that depends on the left-pad repo. When it disappears or becomes unavailable, you're useless.</p>\n\n<p>The job market isn't favoring new graduates right now. But this is an opportunity to differentiate yourself with real cognitive skills. The ability to think, reason, and solve problems without a crutch is becoming increasingly rare and valuable.</p>\n\n<p>It's funny how we've created a work culture where AI dependence is encouraged post-hire but penalized pre-hire. I call it JAI: Job Augmented Intelligence. Where the job itself shapes what AI uses are acceptable.</p>\n\n<hr />\n\n<p>We have to make up our minds. Either AI assistance is cheating, or it's a legitimate tool at the job. We can't have it both ways. We can't be celebrating our own AI shortcuts while condemning others for theirs. Until we figure that out, we're stuck in this weird middle ground where everyone is okay with their own particular use of AI because they're \"not really cheating.\" But somehow, everyone else is.</p>",
  "id": "https://idiallo.com/blog/ai-is-ok-just-not-yours?src=feed"
}