{
  "title": "Prediction: Mastodon will outlive Bluesky",
  "link": "https://evanhahn.com/prediction-mastodon-will-outlive-bluesky/",
  "published": "Tue, 30 Dec 2025 00:00:00 +0000",
  "summary": "<p><em>Disclaimer: I don&rsquo;t know what I&rsquo;m talking about.</em></p>\n<p>Mastodon and Bluesky are, in my opinion, superior to the centralized status quo. They&rsquo;re built on important protocols: <a href=\"https://activitypub.rocks/\">ActivityPub</a> for Mastodon and the <a href=\"https://atproto.com/\">AT Protocol</a> for Bluesky. These decentralized, interoperable networks sidestep some <a href=\"https://www.wired.com/story/twitter-elon-musk-open-source-platforms/\">significant security threats</a> and <a href=\"https://joinfediverse.wiki/index.php?title=Fediverse_projects\">enable tremendous creativity</a>. I like them both.</p>\n<p>But between the two, <strong>I predict that ActivityPub will outlast AT Proto</strong>. Specifically, I think ActivityPub will be relevant in 2050 and AT Proto will not. (I concede there&rsquo;s a future where <em>neither</em> is relevant.)</p>\n<p>I expect this for two reasons:</p>\n<ol>\n<li><em>ActivityPub is community-owned.</em> The <a href=\"https://www.w3.org/wiki/SocialCG\">World Wide Web Consortium (W3C)</a> maintains ActivityPub. One could hardly ask for a sturdier steward. By contrast, AT Proto is run by Bluesky Social, the company. If the company goes out of business, the protocol will have no owner.</li>\n<li><em>The ActivityPub network is far more decentralized than the AT Proto network.</em> According to <a href=\"https://arewedecentralizedyet.online/\">Are We Decentralized Yet?</a>, the biggest ActivityPub server holds 27.24% of accounts. The biggest AT Proto server has 99.36%. If the Bluesky company shutters, AT Proto&rsquo;s supposed decentralization won&rsquo;t feel very decentralized.</li>\n</ol>\n<p>In other words, tying a protocol to the fate of a startup is a risky bet.</p>\n<p>AT Proto has some advantages. Bluesky offers a better user experience than Mastodon in some ways, such as search. Also, the vibes on Mastodon can be bad—half of Mastodon&rsquo;s posts seem to be white people arguing about Linux (myself included).</p>\n<p>Regardless of the winner—if there even is one—both of these systems are better than the dominant centralized social networks. Even if I think ActivityPub is more sustainable, AT Proto is a meaningful positive step. Anything&rsquo;s better than what Zuckerberg, Musk, and Pichai are cooking.</p>\n<p>I don&rsquo;t think that a corporate-controlled social protocol will outlast a publicly-owned one, regardless of the underlying technology. We&rsquo;ll see if I&rsquo;m right in 25 years.</p>",
  "id": "https://evanhahn.com/prediction-mastodon-will-outlive-bluesky/"
}