{
  "title": "Colin and Earendil",
  "link": "https://lucumr.pocoo.org/2026/1/27/earendil/",
  "published": "2026-01-27T00:00:00+00:00",
  "summary": "<p>Regular readers of this blog will know that I started a new company.  We have\nput out just a <a href=\"https://earendil.com/purpose/\">tiny bit of information today</a>,\nand some keen folks have discovered and reached out by email with many\nthoughtful responses.  It has been delightful.</p>\n<p><a href=\"https://colin.day/\">Colin</a> and I met here, in Vienna.  We started sharing\ncoffees, ideas, and lunches, and soon found shared values despite coming from\ndifferent backgrounds and different parts of the world.  We are excited about\nthe future, but we&#8217;re equally vigilant of it.  After traveling together a bit,\nwe decided to plunge into the cold water and start a company together.  We want\nto be successful, but we want to do it the right way and we want to be able to\ndemonstrate that to our kids.</p>\n<p>Vienna is a city of great history, two million inhabitants and a fascinating\nvibe that is nothing like San Francisco.  In fact, Vienna is in many ways the\npolar opposite to the Silicon Valley, both in mindset, in opportunity and\napproach to life.  Colin comes from San Francisco, and though I&#8217;m Austrian, my\ncareer has been shaped by years working with California companies and people\nfrom there who used my Open Source software.  Vienna is now our shared home.\nDespite Austria being so far away from California, it is a place of tinkerers\nand troublemakers.  It&#8217;s always good to remind oneself that society consists of\nmore than just your little bubble.  It also creates the necessary counter\nbalance to think in these times.</p>\n<p>The world that is emerging in front of our eyes is one of change.  We\nincorporated as a <a href=\"https://en.wikipedia.org/wiki/Benefit_corporation\">PBC</a> with\na founding charter to craft software and open protocols, strengthen human\nagency, bridge division and ignorance and to cultivate lasting joy and\nunderstanding.  Things we believe in deeply.</p>\n<p>I have dedicated 20 years of my life in one way or another creating Open Source\nsoftware.  In the same way as artificial intelligence calls into question the\nvery nature of my profession and the way we build software, the present day\ncircumstances are testing society.  We&#8217;re not immune to\nthese changes and we&#8217;re navigating them like everyone else, with a mixture of\nexcitement and worry.  But we share a belief that right now is the time to stand\ntrue to one&#8217;s values and principles.  We want to take an earnest shot at leaving\nthe world a better place than we found it.  Rather than reject the changes that\nare happening, we look to nudge them towards the right direction.</p>\n<p>If you want to follow along you can <a href=\"https://earendil.com/posts/subscribe/\">subscribe to our\nnewsletter</a>, written by humans not\nmachines.</p>",
  "id": "https://lucumr.pocoo.org/2026/1/27/earendil/"
}