{
  "title": "It's time to abandon the cargo cult metaphor",
  "link": "http://www.righto.com/2025/01/its-time-to-abandon-cargo-cult-metaphor.html",
  "published": "2025-01-12T08:56:00.000-08:00",
  "summary": "<p>The cargo cult metaphor is commonly used by programmers.\nThis metaphor was popularized by Richard Feynman's\n\"cargo cult science\" talk with a vivid description of South Seas cargo cults.\nHowever, this metaphor has three major problems.\nFirst, \nthe pop-culture depiction of cargo cults is inaccurate and fictionalized, as I'll show.\nSecond, the metaphor is overused and has contradictory meanings making it a lazy insult.\nFinally, cargo cults are portrayed as an amusing story of native misunderstanding but the background is much darker:\ncargo cults are a reaction to decades of oppression of Melanesian islanders and the destruction of their\nculture.\nFor these reasons, the cargo cult metaphor is best avoided.</p>\n<p><a href=\"https://static.righto.com/images/cargocult/marching2.jpg\"><img alt=\"Members of the John Frum cargo cult, marching with bamboo &quot;rifles&quot;. Photo adapted from The Open Encyclopedia of Anthropology, (CC BY-NC 4.0).\" class=\"hilite\" height=\"356\" src=\"https://static.righto.com/images/cargocult/marching2-w500.jpg\" title=\"Members of the John Frum cargo cult, marching with bamboo &quot;rifles&quot;. Photo adapted from The Open Encyclopedia of Anthropology, (CC BY-NC 4.0).\" width=\"500\" /></a><div class=\"cite\">Members of the John Frum cargo cult, marching with bamboo \"rifles\". Photo adapted from <a href=\"https://www.anthroencyclopedia.com/entry/cargo-cults\">The Open Encyclopedia of Anthropology</a>, (<a href=\"https://creativecommons.org/licenses/by-nc/4.0/\">CC BY-NC 4.0</a>).</div></p>\n<p>In this post, I'll describe some cargo cults from 1919 to the present. These cargo cults are\ncompletely different from\nthe description of cargo cults you usually find on the internet, which I'll call\nthe \"pop-culture cargo cult.\"\nCargo cults are extremely diverse, to the extent that anthropologists disagree on the cause, definition, or even\nif the term has value.\nI'll show that many of the popular views of cargo cults come from a 1962 \"shockumentary\" called <em>Mondo Cane</em>.\nMoreover, most online photos of cargo cults are fake.</p>\n<h2>Feynman and Cargo Cult Science</h2>\n<p>The cargo cult metaphor in science started with Professor Richard Feynman's well-known 1974\ncommencement address at Caltech.<span id=\"fnref:hn-feynman\"><a class=\"ref\" href=\"#fn:hn-feynman\">1</a></span>\nThis speech, titled \"Cargo Cult Science\",\nwas expanded into a chapter in his best-selling 1985 book \"Surely You're Joking, Mr. Feynman\".\nHe said:</p>\n<blockquote>\nIn the South Seas there is a cargo cult of people.\nDuring the war they saw airplanes land with lots of good materials, and they want the same thing to happen now.\nSo they’ve arranged to make things like runways, to put fires along the sides of the runways, to make a wooden hut for a man to sit in, with two wooden pieces on his head like headphones and bars of bamboo sticking out like antennas—he’s the controller—and they wait for the airplanes to land.\nThey’re doing everything right.\nThe form is perfect.\nIt looks exactly the way it looked before.\nBut it doesn’t work.\nNo airplanes land.\nSo I call these things cargo cult science, because they follow all the apparent precepts and forms of scientific investigation, but they’re missing something essential, because the planes don’t land.\n</blockquote>\n\n<p><a href=\"https://static.righto.com/images/cargocult/Richard_Feynman_1974.png\"><img alt=\"Richard Feynman giving the 1974 commencement address at Caltech. Photo from Wikimedia Commons.\" class=\"hilite\" height=\"369\" src=\"https://static.righto.com/images/cargocult/Richard_Feynman_1974-w400.png\" title=\"Richard Feynman giving the 1974 commencement address at Caltech. Photo from Wikimedia Commons.\" width=\"400\" /></a><div class=\"cite\">Richard Feynman giving the 1974 commencement address at Caltech. Photo from <a href=\"https://commons.wikimedia.org/wiki/File:Richard_Feynman_1974.png\">Wikimedia Commons</a>.</div></p>\n<p>But the standard anthropological definition of \"cargo cult\" is entirely different: <span id=\"fnref:encyclopedia\"><a class=\"ref\" href=\"#fn:encyclopedia\">2</a></span></p>\n<blockquote>\nCargo cults are strange religious movements in the South Pacific that appeared during the last few decades.\nIn these movements, a prophet announces the imminence of the end of the world in a cataclysm which will destroy everything.\nThen the ancestors will return, or God, or some other liberating power, will appear, bringing all the goods the people desire, and ushering in a reign of eternal bliss.\n</blockquote>\n\n<p>An anthropology encyclopedia gives a similar definition:</p>\n<blockquote>\nA southwest Pacific example of messianic or millenarian movements once common throughout the colonial world, the modal cargo cult was an agitation or organised social movement of Melanesian villagers in pursuit of ‘cargo’ by means of renewed or invented ritual action that they hoped would induce ancestral spirits or other powerful beings to provide.\nTypically, an inspired prophet with messages from those spirits persuaded a community that social harmony and engagement in improvised ritual (dancing, marching, flag-raising) or revived cultural traditions would, for believers, bring them cargo.\n<!--\nEthnographers suggested that ‘cargo’ was often Western commercial goods and money, but it could also signify moral salvation, existential respect, or proto-nationalistic, anti-colonial desire for political autonomy.\n-->\n</blockquote>\n\n<p>As you may see, the pop-culture explanation of a cargo cult and the anthropological definition are\ncompletely different, apart from the presence of \"cargo\" of some sort.\nHave anthropologists buried cargo cults under layers of theory? Are they even discussing\nthe same thing?\nMy conclusion, after researching many primary sources, is that the anthropological description\naccurately describes the wide variety of cargo cults.\nThe pop-culture cargo cult description, however, takes\nfeatures of some cargo cults (the occasional runway) and combines this with movie scenes to yield an inaccurate\nand fictionalized dscription.\nIt may be hard to believe that the description of cargo cults that you see on the internet is mostly wrong, but\nin the remainder of this article, I will explain this in detail.</p>\n<h2>Background on Melanesia</h2>\n<p>Cargo cults occur in a specific region of the South Pacific called\nMelanesia.\nI'll give a brief (oversimplified) description of Melanesia to provide important background.\nThe Pacific Ocean islands are divided into three cultural areas:\nPolynesia, Micronesia, and Melanesia.\nPolynesia is the best known, including Hawaii, New Zealand, and Samoa.\nMicronesia, in the northwest, consists of thousands of small islands, of which Guam is the largest;\nthe name \"Micronesia\" is Greek for \"small island\".\nMelanesia, the relevant area for this article, is a group of islands between Micronesia and Australia, including\nFiji, Vanuatu, Solomon Islands, and New Guinea.\n(New Guinea is the world's second-largest island; confusingly, the country of Papua New Guinea occupies the eastern half\nof the island, while the western half is part of Indonesia.)</p>\n<p><a href=\"https://static.righto.com/images/cargocult/Pacific_Culture_Areas.jpg\"><img alt=\"Major cultural areas of Oceania. Image by https://commons.wikimedia.org/wiki/File:Pacific_Culture_Areas.jpg.\" class=\"hilite\" height=\"390\" src=\"https://static.righto.com/images/cargocult/Pacific_Culture_Areas-w600.jpg\" title=\"Major cultural areas of Oceania. Image by https://commons.wikimedia.org/wiki/File:Pacific_Culture_Areas.jpg.\" width=\"600\" /></a><div class=\"cite\">Major cultural areas of Oceania. Image by <a href=\"Kahuroa\">https://commons.wikimedia.org/wiki/File:Pacific_Culture_Areas.jpg</a>.</div></p>\n<p>The inhabitants of Melanesia typically lived in small villages of under 200 people, isolated by mountainous geography.\nThey had a simple, subsistence economy, living off cultivated root vegetables, pigs, and hunting.\nPeople tended their own garden, without specialization\ninto particular tasks.\nThe people of Melanesia are dark-skinned, which will be important (\"Melanesia\" and \"melanin\" have the same root).\nTechnologically, the Melanesians used stone, wood, and shell tools, without knowledge\nof metallurgy or even weaving.\nThe Melanesian cultures were generally violent<span id=\"fnref:violence\"><a class=\"ref\" href=\"#fn:violence\">3</a></span> with everpresent tribal warfare and cannibalism.<span id=\"fnref:cannibalism\"><a class=\"ref\" href=\"#fn:cannibalism\">4</a></span></p>\n<p>Due to the geographic separation of tribes, New Guinea became the most linguistically diverse\ncountry in the world, with over 800 distinct languages.\nPidgin English was often the only way for tribes to communicate, and is now one of the\nofficial languages of New Guinea.\nThis language, called <a href=\"https://en.wikipedia.org/wiki/Tok_Pisin\">Tok Pisin</a> (i.e. \"talk pidgin\"),\nis now the most common language in Papua New Guinea, spoken by over two-thirds of the population.<span id=\"fnref:dictionary\"><a class=\"ref\" href=\"#fn:dictionary\">5</a></span></p>\n<p>For the Melanesians, religion was a matter of ritual, rather than a moral framework.\nIt is <a href=\"https://archive.org/details/grammarofreal00jame/page/165/mode/1up\">said</a> that \"to the Melanesian, a religion is above all a technology: it is the knowledge of how to bring the community into the correct relation, by rites and spells, with the divinities and spirit-beings and cosmic forces that can make or mar man's this-worldly wealth and well-being.\"\nThis is important since, as will be seen, the Melanesians expected that the correct ritual\nwould result in the arrival of cargo.\nCatholic and Protestant missionaries converted the inhabitants to Christianity,\nlargely wiping out traditional religious practices and customs;\nMelanesia is now over 95% Christian.\nChristianity played a large role in cargo cults, as will be shown below.</p>\n<p>European explorers first reached Melanesia in the 1500s, followed by colonization.<span id=\"fnref:colonialism\"><a class=\"ref\" href=\"#fn:colonialism\">6</a></span>\nBy the end of the 1800s, control of the island of New Guinea was divided among Germany, Britain, and the Netherlands.\nBritain passed responsibility to Australia\nin 1906 and Australia gained the German part of New Guinea in World War I.\nAs for the islands of Vanuatu, the British and French colonized them (under the name New Hebrides) in the 18th century.</p>\n<!-- 1660: https://www.britannica.com/place/Melanesia\n1600-1800 history: https://www.metmuseum.org/toah/ht/09/ocm.html\n1800-1900 history: https://www.metmuseum.org/toah/ht/10/ocm.html\n-->\n\n<p>The influx of Europeans was highly harmful to the Melanesians.\n\"Native society was severely disrupted by war, by catastrophic epidemics of European diseases, by the introduction of alcohol, by the devastation of generations of warfare, and by the depredations of the labour recruiters.\"<span id=\"fnref:trumpet\"><a class=\"ref\" href=\"#fn:trumpet\">8</a></span>\nPeople were kidnapped and forced to work as laborers in other countries, a practice called <a href=\"https://en.wikipedia.org/wiki/Blackbirding\">blackbirding</a>.  <!-- Trumpet p146 -->\nPrime agricultural land was taken by planters to raise crops such as coconuts for export, with natives\ncoerced into working for the planters.<span id=\"fnref:tax\"><a class=\"ref\" href=\"#fn:tax\">9</a></span>\nUp until 1919, employers were free to flog the natives for disobedience; afterward,\nflogging was technically forbidden but still took place.  <!-- Road Belong Cargo page 45 -->\nColonial administrators jailed natives who stepped out of line.<span id=\"fnref:arrests\"><a class=\"ref\" href=\"#fn:arrests\">7</a></span></p>\n<h2>Cargo cults before World War II</h2>\n<p>While the pop-culture cargo cults explains them as a reaction to World War II, cargo cults started years earlier.\nOne anthropologist <a href=\"https://archive.org/details/responsestochang0000unse/page/174/mode/1up\">stated</a>, \"Cargo cults long preceded [World War II], continued to occur during the war, and have continued to the present.\"</p>\n<p>The first writings about cargo cult behavior date back to 1919, when it was called the \"Vailala Madness\":<span id=\"fnref:vialala\"><a class=\"ref\" href=\"#fn:vialala\">10</a></span></p>\n<blockquote>\nThe natives were saying that the spirits of their ancestors had appeared to several in the villages and told them that all\nflour, rice, tobacco, and other trade belonged to the New Guinea people,\nand that the white man had no right whatever to these goods;\nin a short time all the white men were to be driven away, and then everything would be in the hands of the natives;\na large ship was also shortly to appear bringing back the spirits of their departed relatives with quantities of cargo, and all the villages were to make ready to receive them.\n</blockquote>\n\n<p>The 1926 book <a href=\"https://www.google.com/books/edition/In_Unknown_New_Guinea/8X5WAAAAMAAJ?hl=en&amp;gbpv=1&amp;dq=%22vailala+madness%22&amp;pg=PA288&amp;printsec=frontcover\">In Unknown New Guinea</a>\nalso describes the Vialala Madness:<span id=\"fnref:missionary-review\"><a class=\"ref\" href=\"#fn:missionary-review\">11</a></span></p>\n<blockquote>\n[The leader proclaimed]\nthat the ancestors were coming back in the persons of the white people in the country and that all the things introduced by the white people and the ships that brought them belonged really to their ancestors and themselves.\n[He claimed that] he himself was King George and his friend was the Governor.\nChrist had given him this authority and he was in communication with Christ\nthrough a hole near his village.\n</blockquote>\n\n<p>The Melanesians blamed the Europeans for the failure of cargo to arrive.\nIn the 1930s, <a href=\"https://archive.org/details/roadbelongcargo0000pete_x7h2/page/88/mode/1up?q=ship\">one story</a> was\nthat because the natives had converted to Christianity, God was sending the ancestors with cargo that was loaded on\nships. However, the Europeans were going through the cargo holds and replacing the names on the crates so\nthe cargo was fraudulently delivered to the Europeans instead of the rightful natives.</p>\n<p>The <a href=\"https://archive.org/details/trumpetshallsoun0000unse/page/104/mode/1up?view=theater\">Mambu Movement</a> occurred in 1937.\nMambu, the movement's prophet, claimed that \"the Whites had deceived the natives.\nThe ancestors lived inside a volcano on Manum Island, where they worked hard\nmaking goods for their descendants: loin-cloths, socks, metal axes, bush-knives,\nflashlights, mirrors, red dye, etc., even plank-houses, but the scoundrelly Whites\ntook the cargoes.\nNow this was to stop. The ancestors themselves would bring the goods in a large ship.\"\nTo stop this movement, the Government arrested Mambu, exiled him, and imprisoned him for six months in 1938.</p>\n<p>To summarize, these early cargo cults believed that ships would bring cargo that rightfully belonged to the natives but\nhad been stolen by the whites. The return of the cargo would be accompanied by the spirits of the ancestors.\nMoreover, Christianity often played a large role.\nA significant racial component was present, with natives driving out the whites or becoming white themselves.</p>\n<h2>Cargo cults in World War II and beyond</h2>\n<p>World War II caused <a href=\"https://scholarspace.manoa.hawaii.edu/server/api/core/bitstreams/d75f3f69-fd76-4e3e-8b76-c39adbdd1d24/content\">tremendous social and economic upheavals</a> in Melanesia.\nMuch of Melanesia was occupied by Japan near the beginning of the war and\nthe Japanese treated the inhabitants harshly.\nThe American entry into the war led to heavy conflict in the area such as the\narduous New Guinea campaign\n(1942-1945) and\nthe Solomon Islands campaign.\nAs the Americans and Japanese battled for control of the islands, the inhabitants were caught in the middle.\nPapua and New Guinea suffered over 15,000 <a href=\"https://en.wikipedia.org/wiki/World_War_II_casualties#Total_deaths_by_country\">civilian deaths</a>, a shockingly high number for such a small region.<span id=\"fnref:war\"><a class=\"ref\" href=\"#fn:war\">12</a></span></p>\n<p><a href=\"https://static.righto.com/images/cargocult/henderson.jpg\"><img alt=\"\nThe photo shows a long line of F4F Wildcats at Henderson Field, Guadalcanal, Solomon Islands, April 14, 1943.\nSolomon Islands was home to several cargo cults, both before and after World War II (see map).\nSource: US Navy photo 80-G-41099.\" class=\"hilite\" height=\"309\" src=\"https://static.righto.com/images/cargocult/henderson-w600.jpg\" title=\"\nThe photo shows a long line of F4F Wildcats at Henderson Field, Guadalcanal, Solomon Islands, April 14, 1943.\nSolomon Islands was home to several cargo cults, both before and after World War II (see map).\nSource: US Navy photo 80-G-41099.\" width=\"600\" /></a><div class=\"cite\">\nThe photo shows a long line of F4F Wildcats at Henderson Field, Guadalcanal, Solomon Islands, April 14, 1943.\nSolomon Islands was home to several cargo cults, both before and after World War II (see <a href=\"https://archive.org/details/lccn_78-70457/page/296/mode/1up\">map</a>).\nSource: <a href=\"https://www.flickr.com/photos/127906254@N06/15299405166/\">US Navy photo 80-G-41099</a>.</div></p>\n<p>The impact of the Japanese occupation on cargo cults is usually ignored.\nOne example from 1942 is a cargo belief that the Japanese soldiers\nwere spirits of the dead, who were being sent by Jesus to liberate the people from European rule.\nThe Japanese would bring the cargo by airplane since\nthe Europeans were blocking the delivery of cargo by ship.\nThis would be accompanied by storms and earthquakes, and the natives' skin would change from\nblack to white.\nThe natives were to build storehouses for the cargo and fill the storehouses with food for\nthe ancestors.\nThe leader of this movement, named Tagarab,\nexplained that he had an iron rod that gave him messages\nabout the future.\nEventually, the Japanese shot Tagarab, bringing an end to this cargo cult.<span id=\"fnref:tagareb\"><a class=\"ref\" href=\"#fn:tagareb\">13</a></span></p>\n<p>The largest and most enduring cargo cult is the John Frum movement, which started\non the island of Tanna around 1941 and continues to the present.\nAccording to one story, a mythical person known as John Frum, master of the airplanes, would reveal himself and\ndrive off the whites.\nHe would provide houses, clothes, and food for the people of Tanna.\nThe island of Tanna would flatten as the mountains filled up the valleys and everyone\nwould have perfect health.\nIn other areas, the followers of John Frum believed they \"would receive a great quantity\nof goods, brought by a white steamer which would come from America.\"\nFamilies abandoned the Christian villages and moved to primitive shelters in the interior.\nThey wildly spent much of their money and threw the rest into the sea.\nThe government arrested and deported the leaders, but that failed to stop the movement.\nThe identity of John Frum is unclear; he is sometimes said to be a white American while in other cases natives have claimed to be John Frum.<span id=\"fnref:frum\"><a class=\"ref\" href=\"#fn:frum\">14</a></span></p>\n<p>The cargo cult of Kainantu<span id=\"fnref:cargo-movement\"><a class=\"ref\" href=\"#fn:cargo-movement\">17</a></span> arose around 1945 when a\n\"spirit wind\" caused people in the area to shiver and shake.\nVillages built large \"cargo houses\" and put stones, wood, and insect-marked leaves inside,\nrepresenting European goods, rifles, and paper letters respectively.\nThey killed pigs and anointed the objects, the house, and themselves with blood.\nThe cargo house was to receive the visiting European spirit of the dead who would fill\nthe house with goods.\nThis cargo cult continued for about 5 years, diminishing as people became\ndisillusioned by the failure of the goods to arrive.</p>\n<p>The name \"Cargo Cult\" was first used in print in 1945, just after the end of World War II.<span id=\"fnref:pim\"><a class=\"ref\" href=\"#fn:pim\">15</a></span>\nThe article blamed the problems on the teachings of missionaries, with the problems \"accentuated a hundredfold\" by World War II.</p>\n<blockquote>\nStemming directly from religious  \nteaching of equality, and its resulting sense of injustice, is what is  \ngenerally known as “Vailala Madness,” or  \n“Cargo Cult.”  \n\n\"In all cases the \"Madness\" takes the same form: A native, infected with the disorder, states that he has been visited by a \nrelative long dead, who stated that a great number of ships loaded with \"cargo\" had been\nsent by the ancestor of the native for the benefit of the natives of a particular village\nor area.\nBut the white man, being very cunning, knows how to intercept these ships and\ntakes the \"cargo\" for his own use...\nLivestock has been destroyed, and gardens neglected in the expectation of the\nmagic cargo arriving. The natives infected by the \"Madness\" sank into indolence and apathy\nregarding common hygiene.\"\n</blockquote>\n\n<p>In a 1946 episode, agents of the Australian government found a group of New Guinea\nhighlanders who believed that the arrival of the whites signaled that the end of the world\nwas at hand.\nThe highlanders butchered all their pigs in the expectation that \"Great Pigs\" would appear from\nthe sky in three days. At this time, the residents would exchange their black skin for white skin.\nThey created mock radio antennas of bamboo and rope to receive news of the millennium.<span id=\"fnref:sci-am\"><a class=\"ref\" href=\"#fn:sci-am\">16</a></span></p>\n<p>The <a href=\"https://timesmachine.nytimes.com/timesmachine/1948/11/20/223860512.html?pageNumber=5\">New York Times</a> described Cargo Cults in 1948 as \"the belief that a convoy of cargo\nships is on its way, laden with the fruits of the modern world, to outfit the leaf\nhuts of the natives.\"\nThe occupants of the British Solomon Islands were building\nwarehouses along the beaches to hold these goods.\nNatives marched into a US Army camp, presented $3000 in\nUS money, and asked the Army to drive out the British.</p>\n<!--\n(I should clarify that a millennial movement refers to [millenarianism](https://en.wikipedia.org/wiki/Millenarianism), a belief that society is about to go through a\nmassive transformation. It does not refer to the year 2000 millennium or to \"Generation Y\" millennials.)\n-->\n\n<p>A 1951 paper described cargo cults:\n\"The insistence that a 'cargo' of European goods is to be sent by the ancestors\nor deceased spirits; this may or may not be part of a general reaction\nagainst Europeans, with an overtly expressed desire to be free from alien domination.\nUsually the underlying theme is a belief that all trade goods were sent by ancestors\nor spirits as gifts for their descendants, but have been misappropriated on the\nway by Europeans.\"<span id=\"fnref2:cargo-movement\"><a class=\"ref\" href=\"#fn:cargo-movement\">17</a></span></p>\n<p>In 1959, The New York Times wrote about cargo cults: \"<a href=\"https://www.nytimes.com/1959/06/26/archives/rare-disease-and-strange-cult-disturb-new-guinea-territory-fatal.html\">Rare Disease and Strange Cult Disturb New Guinea Territory; Fatal Laughing Sickness Is Under Study by Medical Experts&mdash;Prophets Stir Delusions of Food Arrivals</a>\".\nThe article states that \"large native groups had been\ninfected with the idea that they could expect the arrival of spirit ships carrying large supplies of food.\nIn false anticipation of the arrival of the 'cargoes', 5000 to 7000 native have been known to consume their entire food reserve and create a famine.\"\nAs for \"laughing sickness\", this is now known to be a prion disease transmitted by eating human brains.\nIn some communities, this disease, also called Kuru, caused 50% of all deaths.</p>\n<p>A detailed 1959 article in Scientific American, \"Cargo Cults\", described many\ndifferent cargo cults.<span id=\"fnref2:sci-am\"><a class=\"ref\" href=\"#fn:sci-am\">16</a></span>\nIt lists various features of cargo cults, such as the return of the dead, skin color switching from black to\nwhite, threats against white rule, and belief in a coming messiah.\nThe article finds a central theme in cargo cults: \"The world is about to end in a terrible cataclysm. Thereafter God, the ancestors or some local culture hero will appear and inaugurate a blissful paradise on earth. Death, old age, illness and evil will be unknown. The riches of the white man will accrue to the Melanesians.\"</p>\n<p>In 1960, the celebrated naturalist David Attenborough created a documentary\n<a href=\"https://www.youtube.com/watch?v=iILq0ADHrw8\">The People of Paradise: Cargo Cult</a>.<span id=\"fnref:video\"><a class=\"ref\" href=\"#fn:video\">18</a></span>\nAttenborough travels through the island of Tanna and encounters many artifacts of the John Frum cult,\nsuch as symbolic gates and crosses, painted brilliant scarlet and decorated with objects such as a shaving brush,\na winged rat, and a small carved airplane.\nAttenborough interviews a cult leader who\nclaims to have talked with the mythical John Frum, said to be a white American.\nThe leader remains in communication with John Frum through a tall pole said to\nbe a radio mast, and an unseen radio.\n(The \"radio\" <a href=\"https://archive.org/details/questinparadise0000unse/page/157/mode/1up\">consisted</a> of an old woman with electrical wire wrapper around her\nwaist, who would speak gibberish in a trance.)</p>\n<p><a href=\"https://static.righto.com/images/cargocult/attenborough-symbols.jpg\"><img alt=\"&quot;Symbols of the cargo cult.&quot; In the center, a representation of John Frum with &quot;scarlet coat and a white European face&quot; stands behind a brilliantly painted cross. A wooden airplane is on the right, while on the left (outside the photo) a cage contains a winged rat. From Journeys to the Past, which describes Attenborough's visit to the island of Tanna.\" class=\"hilite\" height=\"443\" src=\"https://static.righto.com/images/cargocult/attenborough-symbols-w500.jpg\" title=\"&quot;Symbols of the cargo cult.&quot; In the center, a representation of John Frum with &quot;scarlet coat and a white European face&quot; stands behind a brilliantly painted cross. A wooden airplane is on the right, while on the left (outside the photo) a cage contains a winged rat. From Journeys to the Past, which describes Attenborough's visit to the island of Tanna.\" width=\"500\" /></a><div class=\"cite\">\"Symbols of the cargo cult.\" In the center, a representation of John Frum with \"scarlet coat and a white European face\" stands behind a brilliantly painted cross. A wooden airplane is on the right, while on the left (outside the photo) a cage contains a winged rat. From <a href=\"https://archive.org/details/journeystopasttr0000atte/page/n152/mode/1up\">Journeys to the Past</a>, which describes Attenborough's visit to the island of Tanna.</div></p>\n<p>In 1963, famed anthropologist Margaret Mead brought cargo cults to the general public, writing <a href=\"https://archive.org/details/east-liverpool-review-1963-03-23/page/n22/\">Where Americans are Gods: The Strange Story of the Cargo Cults</a> in the mass-market\nnewspaper supplement <em>Family Weekly</em>.\nIn just over a page, this article describes the history of\ncargo cults before, during, and after World War II.<span id=\"fnref:americanism\"><a class=\"ref\" href=\"#fn:americanism\">19</a></span>\nOne cult sat around a table with vases of colorful flowers on them.\nAnother cult threw away their money.\nAnother cult watched for ships from hilltops, expecting John Frum to bring a\nfleet of ships bearing cargo from the land of the dead.</p>\n<p>One of the strangest cargo cults was a group of 2000 people on New Hanover Island,\n\"collecting money to buy President Johnson of the United States [who] would arrive with other Americans on the liner Queen Mary and helicopters next Tuesday.\"\nThe islanders raised $2000, expecting American cargo to follow the president.\nSeeing the name Johnson on <a href=\"https://en.wikipedia.org/wiki/Johnson_Outboards\">outboard motors</a> confirmed their belief\nthat President Johnson was personally sending cargo.<span id=\"fnref:johnson-cult\"><a class=\"ref\" href=\"#fn:johnson-cult\">20</a></span></p>\n<p>A 1971 article in <a href=\"https://archive.org/details/time-1971-11-15/Time%201971-07-19/page/23/mode/1up\">Time Magazine</a><span id=\"fnref:time\"><a class=\"ref\" href=\"#fn:time\">22</a></span> \ndescribed how tribesmen brought US Army concrete survey markers down from a mountaintop\nwhile reciting the Roman Catholic rosary, dropping the heavy markers\noutside the Australian government office.\nThey expected that \"a fleet of 500 jet transports would disgorge thousands of sympathetic Americans\nbearing crates of knives, steel axes, rifles, mirrors and other wonders.\"\nTime magazine explained the “cargo cult” as \"a conviction that if only the dark-skinned people can hit on the magic formula, they can, without working, acquire all the wealth and possessions that seem concentrated in the white world...\nThey believe that everything has a deity who has to be contacted through ritual and who only then will deliver the cargo.\"\nCult leaders tried\n\"to duplicate the white man’s magic. They hacked airstrips in the rain forest, but no planes came. They built structures that look like white men’s banks, but no money materialized.\"<span id=\"fnref:airstrip\"><a class=\"ref\" href=\"#fn:airstrip\">21</a></span></p>\n<!--\nThe article also describes how \"The cult goes back to the mid-19th century, when Russian explorers and Christian missionaries arrived in New Guinea with a dazzling array of possessions. It really took hold during World War II, when all manner of amazing cargo came from the skies, dangling under American parachutes or carried to earth by huge silver birds.\"\n-->\n\n<!--\n[The secret of Heaven's Treasure](https://nla.gov.au/nla.obj-751367408/view?sectionId=nla.obj-755010998&partId=nla.obj-751384169#page/n39/mode/1up) (Walkabout, 1972), is a good article on how\ncargo beliefs persisted in the 1970s, \"underlining a very real discontent with the\npolitical, economic, and social structure.\"\nThe article discusses how even as residents of Papua New Guinea gained political power through the\nHouse of Assembly, cargo cults remained and their leaders were getting elected.\n-->\n\n<p>National Geographic, in an article <a href=\"https://archive.org/details/1972-03_202102/page/408/mode/2up\">Head-hunters in Today's World</a> (1972),\nmentioned a cargo-cult landing field with a replica of a radio aerial, created by villagers who hoped that it would attract airplanes bearing gifts.\nIt also described a cult leader in South Papua who claimed to obtain airplanes and cans of food from a hole in the ground.\nIf the people believed in him, their skins would turn white and he would lead them to freedom.</p>\n<p>These sources and many others<span id=\"fnref:sources\"><a class=\"ref\" href=\"#fn:sources\">23</a></span> illustrate that cargo cults do not fit a simple story.\nInstead, cargo cults are extremely varied, happening across thousands of miles and many decades.\nThe lack of common features between cargo cults leads some\nanthropologists to reject the idea of cargo cults as a meaningful term.<span id=\"fnref:controversy\"><a class=\"ref\" href=\"#fn:controversy\">24</a></span>\nIn any case, most historical cargo cults have very little in common with the pop-culture description of a cargo cult.</p>\n<!--\n![Brightly painted crosses are a symbol of the John Frum cargo cult on the island of Tanna. The tribal leader Nampas claimed to receive messages from John Frum over a simulated radio. From <a href=\"https://archive.org/details/islesofsouthpaci0000maur/page/169/mode/1up\">Isles of the South Pacific</a>, 1968.](nampas.jpg \"w300\")\n-->\n\n<h2>Cargo beliefs were inspired by Christianity</h2>\n<p>Cargo cult beliefs are closely tied to Christianity, a factor that is ignored in pop-culture descriptions of\ncargo cults.\nBeginning in the mid-1800s, Christian missionaries set up churches in New Guinea to convert the inhabitants.\nAs a result, cargo cults incorporated Christian ideas, but in very confusing ways.\nAt first, the natives believed that missionaries had come to reveal the ritual secrets and restore\nthe cargo.\nBy enthusiastically joining the church, singing the hymns, and following the church's rituals,\nthe people would be blessed by God, who would give them the cargo.\nThis belief was common in the 1920s and 1930s, but as the years went on and the people didn't\nreceive the cargo,\nthey theorized that the missionaries had removed the first pages of the Bible to hide\nthe cargo secrets.</p>\n<p>A <a href=\"https://archive.org/details/roadbelongcargo0000pete_x7h2/page/76/mode/1up\">typical belief</a>\nwas that God created Adam and Eve in Paradise, \"giving them cargo:\ntinned meat, steel tools, rice in bags, tobacco in tins, and matches, but not cotton clothing.\"\nWhen Adam and Eve offended God by having sexual intercourse, God threw them out of Paradise\nand took their cargo.\nEventually, God sent the Flood but Noah was saved in a steamship and God gave back the cargo.\nNoah's son Ham offended God, so God took the cargo away from Ham and sent him to New Guinea,\nwhere he became the ancestor of the natives.</p>\n<p>Other natives believed that God lived in Heaven, which was in the clouds and reachable by ladder from Sydney, Australia\n(<a href=\"https://archive.org/details/roadbelongcargo0000pete_x7h2/page/77/mode/1up\">source</a>).\nGod, along with the ancestors, created cargo in Heaven&mdash;\"tinned meat, bags of rice, steel tools, cotton cloth, tinned tobacco, and\na machine for making electric light\"&mdash;which would be flown from Sydney and delivered to the natives, who thus needed to\nclear an airstrip (<a href=\"https://archive.org/details/roadbelongcargo0000pete_x7h2/page/3/mode/1up\">source</a>).<span id=\"fnref:ancestors\"><a class=\"ref\" href=\"#fn:ancestors\">25</a></span></p>\n<p>Another common belief was that symbolic radios could be used to communicate with Jesus.\nFor instance, a Markham Valley cargo group in 1943 created large radio houses so they could be informed of the imminent Coming of Jesus, at which point\nthe natives would expel the whites (<a href=\"https://archive.org/details/trumpetshallsoun0000unse/page/199/mode/1up\">source</a>).\nThe \"radio\" consisted of bamboo cylinders connected to a rope \"aerial\" strung between two poles. The houses contained a pole with\nrungs so the natives could climb to Jesus along with cane \"flashlights\" to see Jesus.</p>\n<p><a href=\"https://static.righto.com/images/cargocult/mast.jpg\"><img alt=\"A tall mast with a flag and cross on top. This was claimed to be a special radio mast that enabled\ncommunication with John Frum. It was decorated with scarlet leaves and flowers.\nFrom Attenborough's Cargo Cult.\" class=\"hilite\" height=\"329\" src=\"https://static.righto.com/images/cargocult/mast-w300.jpg\" title=\"A tall mast with a flag and cross on top. This was claimed to be a special radio mast that enabled\ncommunication with John Frum. It was decorated with scarlet leaves and flowers.\nFrom Attenborough's Cargo Cult.\" width=\"300\" /></a><div class=\"cite\">A tall mast with a flag and cross on top. This was claimed to be a special radio mast that enabled\ncommunication with John Frum. It was decorated with scarlet leaves and flowers.\nFrom Attenborough's <a href=\"https://youtu.be/iILq0ADHrw8?si=Ec3SG0fTu-qVw6Ou&amp;t=415\">Cargo Cult</a>.</div></p>\n<p>Mock radio antennas are also discussed in a 1943 report<span id=\"fnref:berndt\"><a class=\"ref\" href=\"#fn:berndt\">26</a></span> from a wartime patrol that\nfound a bamboo \"wireless house\", 42 feet in diameter.\nIt had two long poles outside and with an \"aerial\" of rope between them, connected to\nthe \"radio\" inside, a bamboo cylinder.\nVillagers explained that the \"radio\" was to receive messages of the return of Jesus,\nwho would provide weapons for the overthrow of white rule.\nThe villagers constructed ladders outside the house so they could climb up to the Christian\nGod after death.\nThey would shed their skin like a snake, getting a new white skin, and then they would\nreceive the \"boats and white men's clothing, goods, etc.\"</p>\n<h2><em>Mondo Cane</em> and the creation of the pop-culture cargo cult</h2>\n<!-- talking into empty tin cans https://archive.org/details/questinparadise0000unse/page/140/mode/2up -->\n<p>As described above, cargo cults expected the cargo to arrive by ships much more often than airplanes.\nSo why do pop-culture cargo cults have detailed descriptions of runways, airplanes, wooden headphones, and bamboo control towers?<span id=\"fnref:airplanes\"><a class=\"ref\" href=\"#fn:airplanes\">27</a></span>\nMy hypothesis is that it came from a 1962 movie called <a href=\"https://www.youtube.com/watch?v=Mj5U8UbWqsk\"><em>Mondo Cane</em></a>.\nThis film was the first \"shockumentary\", showing extreme and shocking scenes from around the world.\nAlthough the film was highly controversial, it was shown at the Cannes Film Festival and was a box-office success.</p>\n<p>The film made extensive use of New Guinea with multiple scandalous segments, such as a group of \"love-struck\" topless women chasing men,<span id=\"fnref:tobriand-islands\"><a class=\"ref\" href=\"#fn:tobriand-islands\">29</a></span> a\nwoman breastfeeding a pig, and women in cages being fattened for marriage.\nThe last segment in the movie showed\n\"the cult of the cargo plane\":\nnatives forlornly watching planes at the airport, followed by scenes of a bamboo airplane sitting on a mountaintop \"runway\"\nalong with bamboo control towers. The natives waited all day and then lit torches to illuminate the runway at nightfall.\nThese scenes are very similar to the pop-culture descriptions of cargo cults so I suspect this movie is the\nsource.</p>\n<p><a href=\"https://static.righto.com/images/cargocult/mondo-cane.jpg\"><img alt=\"A still from the 1962 movie &quot;Mondo Cane&quot;, showing a bamboo airplane sitting on a runway, with flaming torches acting as beacons. I have my doubts about its accuracy.\" class=\"hilite\" height=\"370\" src=\"https://static.righto.com/images/cargocult/mondo-cane-w500.jpg\" title=\"A still from the 1962 movie &quot;Mondo Cane&quot;, showing a bamboo airplane sitting on a runway, with flaming torches acting as beacons. I have my doubts about its accuracy.\" width=\"500\" /></a><div class=\"cite\">A still from the 1962 movie \"<a href=\"https://www.youtube.com/watch?v=Mj5U8UbWqsk\">Mondo Cane</a>\", showing a bamboo airplane sitting on a runway, with flaming torches acting as beacons. I have my doubts about its accuracy.</div></p>\n<p>The film claims that all the scenes \"are true and taken only from life\", but many of the scenes are said to be staged.\nSince the cargo cult scenes are very different from anthropological reports and much more dramatic, I\nthink they were also staged and exaggerated.<span id=\"fnref:mondo-cane-posed\"><a class=\"ref\" href=\"#fn:mondo-cane-posed\">28</a></span>\nIt is known that the makers of <em>Mondo Cane</em> paid the Melanesian natives generously for the filming (<a href=\"https://nla.gov.au/nla.obj-326943259/view?sectionId=nla.obj-335709606\">source</a>, <a href=\"https://nla.gov.au/nla.obj-327358395/view?sectionId=nla.obj-335868460\">source</a>).</p>\n<p>Did Feynman get his cargo cult ideas from <em>Mondo Cane</em>?\nIt may seem implausible since the movie was released over a decade earlier.\nHowever, the movie became a cult classic, was periodically shown in theaters, and influenced academics.<span id=\"fnref:mondo-cane-books\"><a class=\"ref\" href=\"#fn:mondo-cane-books\">30</a></span>\nIn particular, \n<em>Mondo Cane</em> <a href=\"https://www.newspapers.com/image/381900163\">showed</a> at the famed Cameo theater in downtown Los Angeles on April 3, 1974, two months before Feynman's commencement speech.\n<em>Mondo Cane</em> seems like the type of offbeat movie that Feynman would see and the theater was just 11 miles from Caltech.\nWhile I can't prove that Feynman went to the showing, his description of a cargo cult strongly resembles the movie.<span id=\"fnref:cows\"><a class=\"ref\" href=\"#fn:cows\">31</a></span></p>\n<h2>Fake cargo-cult photos fill the internet</h2>\n<p>Fakes and hoaxes make researching cargo cults online difficult.\nThere are numerous photos online of cargo cults, but many of these photos are completely\nmade up.\nFor instance, the photo below has illustrated cargo cults for articles such as <a href=\"https://www.jaakkoj.com/concepts/cargo-cult\">Cargo Cult</a>, <a href=\"https://uxmag.medium.com/ux-personas-are-useless-unless-created-properly-f55a1117d5be\">UX personas are useless</a>, <a href=\"https://medium.com/developer-rants/a-word-on-cargo-cults-coding-and-a-lost-submarine-b2738a3415ee\">A word on cargo cults</a>,\n<a href=\"https://defenceindepth.co/2021/09/23/the-uk-integrated-review-and-security-sector-innovation-a-cargo-cult/\">The UK Integrated Review and security sector innovation</a>,\nand <a href=\"https://alanknottcraig.com/dont-be-a-cargo-cult/\">Don't be a cargo cult</a>.\nHowever, this photo is from a <a href=\"https://www.bowerhillonline.net/straw/straw.htm\">Japanese straw festival</a> and has nothing to do with cargo cults.</p>\n<p><a href=\"https://static.righto.com/images/cargocult/japanese-straw-festival.jpg\"><img alt=\"An airplane built from straw, one creation at a Japanese straw festival. I've labeled the photo with &quot;Not cargo cult&quot; to ensure it doesn't get reused in cargo cult articles.\" class=\"hilite\" height=\"288\" src=\"https://static.righto.com/images/cargocult/japanese-straw-festival-w500.jpg\" title=\"An airplane built from straw, one creation at a Japanese straw festival. I've labeled the photo with &quot;Not cargo cult&quot; to ensure it doesn't get reused in cargo cult articles.\" width=\"500\" /></a><div class=\"cite\">An airplane built from straw, one creation at a Japanese straw festival. I've labeled the photo with \"Not cargo cult\" to ensure it doesn't get reused in cargo cult articles.</div></p>\n<p>Another example is the photo below, supposedly an antenna created by a cargo cult.\nHowever, it is actually\na replica of the Jodrell Bank radio telescope,\nbuilt in 2007 by a British farmer from six tons of straw\n(<a href=\"https://www.dailymail.co.uk/news/article-1204401/Clock-The-Big-Ben-replica-built-50-bales-straw.html?ITO=1490\">details</a>).\nThe farmer's replica ended up erroneously illustrating\n<a href=\"https://medium.com/@drewullman/cargo-cult-politics-3cce6bfd12e0\">Cargo Cult Politics</a>,\n<a href=\"https://godshotspot.wordpress.com/2016/05/02/the-cargo-cult-belief/\">The Cargo Cult &amp; Beliefs</a>,\n<a href=\"https://www.microforum.cc/blogs/entry/7-the-cargo-cult/\">The Cargo Cult</a>,\n<a href=\"https://abramovicinstitute.tumblr.com/post/158113252226/the-cargo-cults-of-the-south-pacific-locals-of\">Cargo Cults of the South Pacific</a>,\nand\n<a href=\"https://nzb3.anarkiwi.co.nz/2021/05/04/cargo-cult/\">Cargo Cult</a>, among others.<span id=\"fnref:radio-telescope\"><a class=\"ref\" href=\"#fn:radio-telescope\">32</a></span></p>\n<p><a href=\"https://static.righto.com/images/cargocult/straw-dish.jpg\"><img alt=\"A British farmer created this replica radio telescope. Photo by Mike Peel, (CC BY-SA 4.0).\" class=\"hilite\" height=\"344\" src=\"https://static.righto.com/images/cargocult/straw-dish-w500.jpg\" title=\"A British farmer created this replica radio telescope. Photo by Mike Peel, (CC BY-SA 4.0).\" width=\"500\" /></a><div class=\"cite\">A British farmer created this replica radio telescope. Photo by <a href=\"https://en.wikipedia.org/wiki/File:Snugburys_Lovell_Telescope_straw_sculpture_2007_10.jpg\">Mike Peel</a>, (<a href=\"https://creativecommons.org/licenses/by-sa/4.0/deed.en\">CC BY-SA 4.0</a>).</div></p>\n<p>Other articles illustrate cargo cults with the aircraft below, suspiciously\nsleek and well-constructed.\nHowever, the photo actually shows a wooden wind tunnel model of the Buran spacecraft,\nabandoned at a Russian airfield as \ndescribed in <a href=\"https://www.thisiscolossal.com/2015/09/buran-wooden-spaceship/\">this article</a>.\nSome uses of the photo are <a href=\"https://business-digest.eu/are-you-guilty-of-cargo-cult-thinking-without-even-knowing-it/?lang=en\">Are you guilty of “cargo cult” thinking without even knowing it?</a> and\n<a href=\"https://glenhendrix50.medium.com/the-cargo-cult-of-wealth-b02aedb47da8\">The Cargo Cult of Wealth</a>.</p>\n<p><a href=\"https://static.righto.com/images/cargocult/buran.jpg\"><img alt=\"This is an abandoned Soviet wind tunnel model of the Buran spacecraft. Photo by Aleksandr Markin.\" class=\"hilite\" height=\"333\" src=\"https://static.righto.com/images/cargocult/buran-w500.jpg\" title=\"This is an abandoned Soviet wind tunnel model of the Buran spacecraft. Photo by Aleksandr Markin.\" width=\"500\" /></a><div class=\"cite\">This is an abandoned Soviet wind tunnel model of the Buran spacecraft. Photo by Aleksandr Markin.</div></p>\n<p>Many cargo cult articles use one of the photo below. I tracked them down to the 1970 movie \"Chariots of the Gods\" (<a href=\"https://youtu.be/guPG2DlhBdI?si=2KyoIBptFklEJKsG&amp;t=439\">link</a>),\na dubious documentary claiming that aliens have visited Earth throughout history.\nThe segment on cargo cults is similar to <em>Mondo Cane</em> with cultists surrounding a mock plane on a mountaintop,\nlighting fires along the runway.\nHowever, it is clearly faked, probably in Africa: the people don't look like Pacific Islanders and are wearing\nwigs. One participant wears leopard skin (leopards don't live in the South Pacific).\nThe vegetation is another giveaway: the plants are from\nAfrica, not the South Pacific.<span id=\"fnref:chariots\"><a class=\"ref\" href=\"#fn:chariots\">33</a></span></p>\n<p><a href=\"https://static.righto.com/images/cargocult/chariots.jpg\"><img alt=\"Two photos of a straw plane from &quot;Chariots of the Gods&quot;.\" class=\"hilite\" height=\"211\" src=\"https://static.righto.com/images/cargocult/chariots-w600.jpg\" title=\"Two photos of a straw plane from &quot;Chariots of the Gods&quot;.\" width=\"600\" /></a><div class=\"cite\">Two photos of a straw plane from \"Chariots of the Gods\".</div></p>\n<p>The point is that most of the images that illustrate cargo cults online are fake or\nwrong. \nMost internet photos and information about cargo cults have just been copied from page to page.\n(And now we have <a href=\"https://www.lean-agility.de/2016/05/cargo-cult.html\">AI-generated cargo cult photos</a>.)\nIf a photo doesn't have a clear source (including <em>who</em>, <em>when</em>, and <em>where</em>), don't believe it.</p>\n<h2>Conclusions</h2>\n<p>The cargo cult metaphor should be avoided for three reasons.\nFirst, the metaphor is essentially meaningless and heavily overused.\nThe influential \"Jargon File\" defined cargo-cult programming as \"A style of (incompetent) programming\ndominated by ritual inclusion of code or program structures that\nserve no real purpose.\"<span id=\"fnref:jargon\"><a class=\"ref\" href=\"#fn:jargon\">34</a></span>\nNote that the metaphor in cargo-cult programming is the opposite of the metaphor in cargo-cult science:\nFeyman's cargo-cult science has no chance of\nworking, while cargo-cult programming works but isn't understood.\nMoreover, both metaphors differ from the cargo-cult metaphor in other contexts, referring to the expectation of receiving\nvaluables without working.<span id=\"fnref:overuse\"><a class=\"ref\" href=\"#fn:overuse\">35</a></span></p>\n<p>The popular site Hacker News is an example of how \"cargo cult\" can be applied to anything:\n<a href=\"https://news.ycombinator.com/item?id=34886374\">agile programming</a>,\n<a href=\"https://news.ycombinator.com/item?id=35991362\">artificial intelligence</a>,\n<a href=\"https://news.ycombinator.com/item?id=28199020\">cleaning your desk</a>.\n<a href=\"https://news.ycombinator.com/item?id=11400575\">Go</a>,\n<a href=\"https://news.ycombinator.com/item?id=17142720\">hatred of Perl</a>,\n<a href=\"https://news.ycombinator.com/item?id=37180342\">key rotation</a>,\n<a href=\"https://news.ycombinator.com/item?id=34726983\">layoffs</a>,\n<a href=\"https://news.ycombinator.com/item?id=33111938\">MBA programs</a>,\n<a href=\"https://news.ycombinator.com/item?id=26987471\">microservices</a>,\n<a href=\"https://news.ycombinator.com/item?id=35043070\">new drugs</a>,\n<a href=\"https://news.ycombinator.com/item?id=37108578\">quantum computing</a>,\n<a href=\"https://news.ycombinator.com/item?id=23060143\">static linking</a>,\n<a href=\"https://news.ycombinator.com/item?id=7633329\">test-driven development</a>, and\n<a href=\"https://news.ycombinator.com/item?id=34306082\">updating the copyright year</a> are just a few things that are called \"cargo cult\".<span id=\"fnref:hn-cargo-cult\"><a class=\"ref\" href=\"#fn:hn-cargo-cult\">36</a></span>\nAt this point, cargo cult is simply a lazy, meaningless attack.</p>\n<p>The second problem with \"cargo cult\" is that the pop-culture description of cargo cults is historically\ninaccurate.\nActual cargo cults are much more complex and include a much wider (and stranger) variety of behaviors.\nCargo cults started before World War II and involve ships more often\nthan airplanes.\nCargo cults mix aspects of paganism and Christianity, often with apocalyptic ideas of the end of the\ncurrent era, the overthrow of white rule, and the return of dead ancestors.\nThe pop-culture description discards all this complexity, replacing it with a myth.</p>\n<p>Finally, the cargo cult metaphor turns decades of harmful colonialism into a humorous anecdote.\nFeynman's description of cargo cults strips out the moral complexity:\nUS soldiers show up with their cargo and planes, the indigenous\nresidents amusingly misunderstand the situation, and everyone carries on.\nHowever, cargo cults really were\na response to decades of colonial mistreatment, exploitation, and cultural destruction.\nMoreover, cargo cults were often harmful: expecting a bounty of cargo, villagers would throw away their money,\nkill their pigs, and stop tending their crops, resulting in famine.\nThe pop-culture cargo cult erases the decades of colonial oppression, along with the cultural upheaval\nand deaths from World War II.\nMelanesians deserve to be more than the punch line in a cargo cult story.</p>\n<p>Thus, it's time to move beyond the cargo cult metaphor.</p>\n<p>\n<b>Update</b>: well, this sparked much more <a href=\"https://news.ycombinator.com/item?id=42675025\">discussion on Hacker News</a> than I expected. To answer some questions: Am I better or more virtuous than other people? No. Are you a bad person if you use the cargo cult metaphor? No. Is \"cargo cult\" one of many Hacker News comments that I'm tired of seeing? Yes (<a href=\"https://www.righto.com/2013/09/9-hacker-news-comments-im-tired-of.html\">details</a>). Am I criticizing Feynman? No. Do the Melanesians care about this? Probably not. Did I put way too much research into this? Yes. Is criticizing colonialism in the early 20th century woke? I have no response to that.\n<h2>Notes and references</h2>\n<div class=\"footnote\">\n<ol>\n<li id=\"fn:hn-feynman\">\n<p>As an illustration of the popularity of Feynman's \"Cargo Cult Science\" commencement address,\nit has been on <a href=\"https://hn.algolia.com/?dateRange=all&amp;page=0&amp;prefix=true&amp;query=%22cargo%20cult%20science%22&amp;sort=byDate&amp;type=story\">Hacker News</a>\nat least 15 times.&#160;<a class=\"footnote-backref\" href=\"#fnref:hn-feynman\" title=\"Jump back to footnote 1 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:encyclopedia\">\n<p>The first cargo cult definition above comes from <a href=\"https://archive.org/details/trumpetshallsoun0000unse/page/10/mode/2up\">The Trumpet Shall Sound; A Study of \"Cargo\" Cults in Melanesia</a>.\nThe second definition is from \nthe <a href=\"https://www.anthroencyclopedia.com/entry/cargo-cults\">Cargo Cult</a> entry in The Open Encyclopedia of Anthropology.\nWritten by Lamont Lindstrom, a professor who studies Melanesia, the entry comprehensively\ndescribes the history and variety of cargo cults, as well as current anthropological\nanalysis.</p>\n<p>For an early anthropological theory of cargo cults, see <a href=\"https://archive.org/details/revolutioninanth0000unse/page/54/mode/2up\">An Empirical Case-Study: The Problem of Cargo Cults</a> in \"The Revolution in Anthropology\" (Jarvie, 1964).\nThis book categorizes cargo cults as an apocalyptic millenarian religious movement with a central tenet:\n<blockquote>\nWhen the millennium comes it will largely consist of the arrival of ships and/or aeroplanes loaded up with cargo; a cargo consisting either of material goods the natives long for (and which are delivered to the whites in this manner), or of the ancestors, or of both.\n</blockquote>&#160;<a class=\"footnote-backref\" href=\"#fnref:encyclopedia\" title=\"Jump back to footnote 2 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:violence\">\n<p>European colonization brought pacification and a reduction in violence.\n<a href=\"https://archive.org/details/responsestochang0000unse/page/165/mode/1up\">The Cargo Cult: A Melanesian Type-Response to Change</a> describes this pacification and termination of warfare as the <em>Pax Imperii</em>, suggesting\nthat pacification came as a relief to the Melanesians: \"They welcomed the cessation of many of the concomitants of warfare: the sneak attack, ambush, raiding, kidnapping of women and children, cannibalism, torture, extreme indignities inflicted on captives, and the continual need to be concerned with defense.\"\nThat article calls the peace the <em>Pax Imperii</em>.</p>\n<p>Warfare among the Enga people of New Guinea is described in <a href=\"https://www.researchgate.net/publication/269661915_From_Spears_to_M-16s_Testing_the_Imbalance_of_Power_Hypothesis_among_the_Enga\">From Spears to M-16s: Testing the Imbalance of Power Hypothesis among the Enga</a>.\nThe Enga engaged in tribal warfare for reasons such as \"theft of game from traps, quarrels over possessions, or work sharing within the group.\" The surviving losers were usually driven off the land and forced to\nsettle elsewhere.\nIn the 1930s and 1940s, the Australian administration banned tribal fighting and pacified much of the area.\nHowever, after the independence of Papua New Guinea in 1975, warfare increased along with the creation of\ncriminal gangs known as Raskols (rascals).\nThe situation worsened in the late 1980s with the introduction of shotguns and high-powered weapons to\nwarfare.\nNow, Papua New Guinea has one of the <a href=\"https://www.osac.gov/Country/PapuaNewGuinea/Content/Detail/Report/a60b5cea-2768-4872-8981-15f4aeaad1db\">highest</a> crime rates in the world along with one of the lowest police-to-population ratios in the world.&#160;<a class=\"footnote-backref\" href=\"#fnref:violence\" title=\"Jump back to footnote 3 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:cannibalism\">\n<p>When you hear tales of cannibalism, some skepticism is warranted.\nHowever, cannibalism is proved by\nthe prevalence of <em>kuru</em>, or \"laughing sickness\", a\nfatal prion disease (transmissible spongiform encephalopathy) spread by consuming human brains.\nAlso see <a href=\"https://archive.org/details/edg-ng-1961/edg%20NG%201972-03%20141-3%20Mar/page/391/mode/1up\">Headhunters in Today's World</a>, a 1972 National Geographic article that describes the baking of heads\nand the eating of brains.&#160;<a class=\"footnote-backref\" href=\"#fnref:cannibalism\" title=\"Jump back to footnote 4 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:dictionary\">\n<p>A 1957 dictionary of Pidgin English can be found <a href=\"https://archive.org/details/dictionarygramma0000fran\">here</a>.\n   Linguistically, Tok Pisin is a creole, not a pidgin.&#160;<a class=\"footnote-backref\" href=\"#fnref:dictionary\" title=\"Jump back to footnote 5 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:colonialism\">\n<p>The modern view is that countries such as Great Britain acquired colonies against the will of the colonized, but\nthe situation was more complex in the 19th century.\nMany Pacific islands desperately wanted to become European colonies, but were turned down for years because the countries\nwere viewed as undesiable burdens.</p>\n<p>For example, Fiji viewed colonization as the solution to the chaos caused by the influx of white settlers in the 1800s.\nFijian political leaders attempted to cede the islands to a European power that could end the lawlessness, but were turned down.\nIn 1874, the situation changed when Disraeli was elected British prime minister. His <a href=\"https://www.britishempire.co.uk/maproom/fiji.htm\">pro-imperial policies</a>, along with the Royal Navy's\ninterest in obtaining a coaling station, concerns about <a href=\"https://www.jstor.org/stable/3636309\">American expansion</a>, and pressure from anti-slavery groups,\nled to the annexation of Fiji by Britain. The situation in Fiji didn't particularly improve from annexation. (Fiji obtained independence almost a century later, in 1970.)</p>\n<p>As an example of the cost of a colony,\nAustralia was subsidizing Papua New Guinea (with a population\nof 2.5 million) with over 100 million dollars a year in the early 1970s. (<a href=\"https://nla.gov.au/nla.obj-751367408/view?sectionId=nla.obj-755010998&amp;partId=nla.obj-751384618#page/n41/mode/1up\">source</a>)&#160;<a class=\"footnote-backref\" href=\"#fnref:colonialism\" title=\"Jump back to footnote 6 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:arrests\">\n<p>When reading about colonial Melanesia, one notices a constant background of police activity.\nEven when police patrols were very rare (annual in some parts), they were typically\naccompanied by arbitrary arrests and imprisonment.\nThe most common cause for arrest was adultery; it may seem strange that the police were\nso concerned with it, but it turns out that adultery was the most common cause of\nwarfare between tribes, and the authorities were trying to reduce the level of warfare.\nCargo cult activity could be <a href=\"https://archive.org/details/roadbelongcargo0000pete_x7h2/page/97/mode/1up\">punished</a> by six months of imprisonment.\nJailing tended to be ineffective in stopping cargo cults, however, as it was viewed as evidence that\nthe Europeans were trying to stop\nthe cult leaders from spreading the cargo secrets that they had uncovered.&#160;<a class=\"footnote-backref\" href=\"#fnref:arrests\" title=\"Jump back to footnote 7 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:trumpet\">\n<p>See <a href=\"https://archive.org/details/trumpetshallsoun0000unse/page/19/mode/1up\">The Trumpet Shall Sound</a>.&#160;<a class=\"footnote-backref\" href=\"#fnref:trumpet\" title=\"Jump back to footnote 8 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:tax\">\n<p>The government imposed a head tax, which for\nthe most part could only be paid through employment.\nA 1924 report <a href=\"https://archive.org/details/trumpetshallsoun0000unse/page/37/mode/1up\">states</a>, \"The primary object of the head tax was not to collect revenue but to create among\nthe natives a need for money, which would make labour for Europeans desirable and would\nforce the natives to accept employment.\"&#160;<a class=\"footnote-backref\" href=\"#fnref:tax\" title=\"Jump back to footnote 9 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:vialala\">\n<p>The <a href=\"https://www.google.com/books/edition/Records_of_the_Proceedings_and_Printed_P/n5U-AQAAMAAJ?hl=en&amp;gbpv=1&amp;pg=RA15-PA116\">Papua Annual Report, 1919-20</a> includes a report on the \"Vailala Madness\", starting on page 118.\nIt describes how villages with the \"Vialala madness\" had \"ornamented flag-poles, long tables, and forms or benches, the tables being usually decorated with flowers in bottles of water in imitation of a white man's dining table.\"\nVillage men would sit motionless with their backs to the tables. Their idleness infuriated the white men,\nwho considered the villagers to be \"fit subjects for a lunatic asylum.\"&#160;<a class=\"footnote-backref\" href=\"#fnref:vialala\" title=\"Jump back to footnote 10 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:missionary-review\">\n<p>The Vailala Madness is also described in <a href=\"https://www.google.com/books/edition/The_Missionary_Review_of_the_World/awB1HUFjvpwC?hl=en&amp;gbpv=1&amp;dq=%22vailala+madness%22&amp;pg=PA1013&amp;printsec=frontcover\">The Missionary Review of the World</a>, 1924.\nThe Vaialala Madness also involved seizure-like physical aspects, which typically didn't appear in later cargo cult behavior.</p>\n<p>The 1957 book\n<a href=\"https://archive.org/details/trumpetshallsoun0000unse\">The Trumpet Shall Sound: A Study of \"Cargo\" Cults in Melanesia</a>\nis an extensive discussion of cargo cults, as well as earlier activity and movements.\nChapter 4 covers the Vailala Madness in detail.&#160;<a class=\"footnote-backref\" href=\"#fnref:missionary-review\" title=\"Jump back to footnote 11 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:war\">\n<p>The battles in the Pacific\nhave been extensively described from the American and Japanese perspectives,\nbut the indigenous residents of these islands are usually left out of the narratives.\n<a href=\"https://scholarspace.manoa.hawaii.edu/server/api/core/bitstreams/d75f3f69-fd76-4e3e-8b76-c39adbdd1d24/content\">This review</a> discusses two books that provide the Melanesian perspective.</p>\n<p>I came across the incredible story of Sergeant Major Vouza of the Native Constabulary.\nWhile this story is not directly related to cargo cults, I wanted to include it as it\nillustrates the dedication and suffering of the New Guinea natives during World War II.\nVouza volunteered to scout behind enemy lines for the Marines at Guadalcanal but he \nwas captured by the Japanese, tied to a tree, tortured, bayonetted, and left for dead.\nHe chewed through his ropes, made his way through the enemy force, and warned the\nMarines of an impending enemy attack.</p>\n<p><a href=\"https://static.righto.com/images/cargocult/vouza.jpg\"><img alt=\"SgtMaj Vouza, British Solomon Islands Constabulary.\nFrom The Guadalcanal Campaign, 1949.\" class=\"hilite\" height=\"443\" src=\"https://static.righto.com/images/cargocult/vouza-w350.jpg\" title=\"SgtMaj Vouza, British Solomon Islands Constabulary.\nFrom The Guadalcanal Campaign, 1949.\" width=\"350\" /></a><div class=\"cite\">SgtMaj Vouza, British Solomon Islands Constabulary.\nFrom <a href=\"https://www.google.com/books/edition/The_Guadalcanal_Campaign/8sdRCNTTWpgC?hl=en&amp;gbpv=1&amp;pg=PA68\">The Guadalcanal Campaign</a>, 1949.</div></p>\n<p>Vouza described the event in a letter:</p>\n<p><a href=\"https://static.righto.com/images/cargocult/vouza-letter.jpg\"><img alt=\"Letter from SgtMaj Vouza to Hector MacQuarrie, 1984. From The Guadalcanal Campaign.\" class=\"hilite\" height=\"399\" src=\"https://static.righto.com/images/cargocult/vouza-letter-w400.jpg\" title=\"Letter from SgtMaj Vouza to Hector MacQuarrie, 1984. From The Guadalcanal Campaign.\" width=\"400\" /></a><div class=\"cite\">Letter from SgtMaj Vouza to Hector MacQuarrie, 1984. From <a href=\"https://www.google.com/books/edition/The_Guadalcanal_Campaign/8sdRCNTTWpgC?hl=en&amp;gbpv=1&amp;pg=PA67&amp;printsec=frontcover\">The Guadalcanal Campaign</a>.</div></p>\n<p><!-- -->&#160;<a class=\"footnote-backref\" href=\"#fnref:war\" title=\"Jump back to footnote 12 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:tagareb\">\n<p>The Japanese occupation and the cargo cult started by Tagareb are described in detail in\n  <a href=\"https://archive.org/details/roadbelongcargo0000pete_x7h2/page/102/mode/1up\">Road Belong Cargo</a>, pages 98-110. (An entertaining review of that book is <a href=\"https://www.thepsmiths.com/p/review-road-belong-cargo-by-peter\">here</a>.)&#160;<a class=\"footnote-backref\" href=\"#fnref:tagareb\" title=\"Jump back to footnote 13 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:frum\">\n<p>See \"John Frum Movement in Tanna\", <a href=\"https://www.jstor.org/stable/40328340\">Oceania</a>, March 1952.\nThe New York Times described the John Frum movement in detail in a 1970 article:\n<a href=\"https://www.nytimes.com/1970/04/19/archives/on-a-pacific-island-they-wait-for-the-gi-who-became-a-god.html\">\"On a Pacific island, they wait for the G.I. who became a God\"</a>.\nA more modern article (2006) on John Frum is <a href=\"https://www.smithsonianmag.com/history/in-john-they-trust-109294882/\">In John They Trust</a> in the Smithsonian Magazine.</p>\n<p>As for the identity of John Frum, some claim that his name is short for \"John from America\".\nOthers claim it is a modification of \"John Broom\" who would sweep away the whites.\nThese claims lack evidence.&#160;<a class=\"footnote-backref\" href=\"#fnref:frum\" title=\"Jump back to footnote 14 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:pim\">\n<p>The quote is from Pacific Islands Monthly, November 1945 (<a href=\"https://nla.gov.au/nla.obj-317552278/view?partId=nla.obj-317598776#page/n70/mode/1up\">link</a>).\nThe National Library of Australia has an extensive <a href=\"https://nla.gov.au/nla.obj-310385031\">collection</a> of issues of Pacific Islands\nMonthly online.\nSearching these magazines for \"<a href=\"https://trove.nla.gov.au/search/category/magazines?keyword=%22cargo%20cult%22&amp;sortBy=dateAsc\">cargo cult</a>\" provides an interesting look at how cargo cults were viewed as they happened.&#160;<a class=\"footnote-backref\" href=\"#fnref:pim\" title=\"Jump back to footnote 15 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:sci-am\">\n<p>Scientific American had a long article titled <a href=\"https://www.scientificamerican.com/article/1959-cargo-cults-melanesia/\">Cargo Cults</a> in May 1959, written by\nPeter Worsley, who also wrote the classic book <a href=\"https://archive.org/details/trumpetshallsoun0000unse\">The Trumpet Shall Sound: A Study of 'Cargo' Cults in Melanesia</a>.\nThe article lists the following features of cargo cults:\n<ul>\n<li> Myth of the return of the dead\n<li> Revival or modification of paganism\n<li> Introduction of Christian elements\n<li> Cargo myth\n<li> Belief that Negroes will become white men and vice versa\n<li> Belief in a coming messiah\n<li> Attempts to restore native political and economic control\n<li> Threats and violence against white men\n<li> Union of traditionally separate and unfriendly groups\n</ul></p>\n<p>Different cargo cults contained different subsets of these features but no specific feature \nThe article is reprinted <a href=\"https://archive.org/details/lccn_78-70457/page/290/mode/2up\">here</a>; the detailed maps show the\nwide distribution of cargo cults.&#160;<a class=\"footnote-backref\" href=\"#fnref:sci-am\" title=\"Jump back to footnote 16 in the text\">&#8617;</a><a class=\"footnote-backref\" href=\"#fnref2:sci-am\" title=\"Jump back to footnote 16 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:cargo-movement\">\n<p>See <a href=\"https://www.jstor.org/stable/40328364\">A Cargo Movement in the Eastern Central Highlands of New Guinea</a>, Oceania, 1952.&#160;<a class=\"footnote-backref\" href=\"#fnref:cargo-movement\" title=\"Jump back to footnote 17 in the text\">&#8617;</a><a class=\"footnote-backref\" href=\"#fnref2:cargo-movement\" title=\"Jump back to footnote 17 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:video\">\n<p>The Attenborough Cargo Cult documentary can be watched on YouTube.</p>\n<p></p>\n<p>I'll summarize some highlights with timestamps:\n<br />5:20: A gate, palisade, and a cross all painted brilliant red.\n<br />6:38: A cross decorated with a wooden bird and a shaving brush.\n<br />7:00: A tall pole claimed to be a special radio mast to talk with John Frum.\n<br />8:25: Interview with trader Bob Paul. He describes \"troops\" marching with wooden guns around the whole island.\n<br />12:00: Preparation and consumption of kava, the intoxicating beverage.\n<br />13:08: Interview with a local about John Frum.\n<br />14:16: John Frum described as a white man and a big fellow.\n<br />16:29: Attenborough asks, \"You say John Frum has not come for 19 years. Isn't this a long time for you to wait?\"\nThe leader responds, \"No, I can wait. It's you waiting for two thousand years for Christ to come and I must wait over 19 years.\"\nAttenborough accepts this as a fair point.\n<br />17:23: Another scarlet gate, on the way to the volcano, with a cross, figure, and model airplane.\n<br />22:30: Interview with the leader. There's a discussion of the radio, but Attenborough is not allowed to see it.\n<br />24:21: John Frum is described as a white American.\n<p>\nThe expedition is also described in David Attenborough's 1962 book <a href=\"https://archive.org/details/questinparadise0000unse/page/144\">Quest in Paradise</a>.\n<!-- -->&#160;<a class=\"footnote-backref\" href=\"#fnref:video\" title=\"Jump back to footnote 18 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:americanism\">\n<p>I have to criticize Mead's article for centering Americans as the heroes, almost a parody\nof American triumphalism. The title sets the article's tone: \"Where Americans are Gods...\"\nThe article explains,\n\"The Americans were lavish. They gave away Uncle Sam's property with a generosity which appealed\nmightily... so many kind, generous people, all alike, with such magnificent cargoes! The American\nservicemen, in turn, enjoyed and indulged the islanders.\"</p>\n<p>The article views cargo cults as a temporary stage before moving to a prosperous American-style society\nas islanders realized that \"American things could come [...] only by work, education, persistence.\"\nA movement leader named Paliau is approvingly quoted: \"We would like to have the things Americans have. [...]\nWe think Americans have all these things because they live under law, without endless quarrels. So we must\nfirst set up a new society.\"</p>\n<p>On the other hand, by most <a href=\"https://archive.org/details/roadbelongcargo0000pete_x7h2/page/60/mode/1up\">reports</a>, the Americans treated the residents of Melanesia much better than the\ncolonial administrators.\nAmericans paid the natives much more (which was viewed as overpaying them by the planters).\nThe Americans treated the natives with much more respect; natives worked with Americans\nalmost as equals.\nFinally, it appeared to the natives that black soldiers were treated as equals to white soldiers.\n(Obviously, this wasn't entirely accurate.)</p>\n<p>The Melanesian experience with Americans also strengthened Melanesian demands for independence.\nFollowing the war, the reversion to colonial administration produced a lot of discontent in\nthe natives, who realized that their situation could be much better.\n(See <a href=\"https://thediasporicdish.com/world-war-ii-and-melanesian-self-determination/\">World War II and Melanesian self-determination</a>.)&#160;<a class=\"footnote-backref\" href=\"#fnref:americanism\" title=\"Jump back to footnote 19 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:johnson-cult\">\n<p>The Johnson cult was analyzed in depth by Billings, an anthropologist who wrote about it in\n<a href=\"https://amzn.to/3YD70rb\">Cargo Cult as Theater: Political Performance in the Pacific</a>.\nSee also <a href=\"https://www.google.com/books/edition/Australian_Daily_News/cOzZ8fMdeEoC\">Australian Daily News</a>, June 12, 1964, and <a href=\"https://archive.org/details/time-1971-11-15/Time%201971-07-19/page/23/mode/1up\">Time Magazine</a>, July 19, 1971.&#160;<a class=\"footnote-backref\" href=\"#fnref:johnson-cult\" title=\"Jump back to footnote 20 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:airstrip\">\n<p>In one unusual case, the islanders built an airstrip and airplanes <em>did</em> come.\nSpecifically, the Miyanmin people of New Guinea hacked an airstrip out of the forest in 1966 using hand tools.\nThe airstrip was discovered by a patrol and turned out to be usable, so Baptist missionaries made\nmonthly landings, bringing medicine and goods for a store.\nIt is pointed out that the only thing preventing this activity from being considered a cargo cult is\nthat in this case, it was effective. See <a href=\"https://www.jstor.org/stable/40330585\">A Small Footnote to the 'Big Walk'</a>, p. 59.&#160;<a class=\"footnote-backref\" href=\"#fnref:airstrip\" title=\"Jump back to footnote 21 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:time\">\n<p>See \"New Guinea: Waiting for That Cargo\", <a href=\"https://archive.org/details/time-1971-11-15/Time%201971-07-19/page/23/mode/1up\">Time Magazine</a>, July 19, 1971.\n<!-- Also https://nla.gov.au/nla.obj-751367408/view?sectionId=nla.obj-755010998&partId=nla.obj-751384618#page/n41/mode/1up -->&#160;<a class=\"footnote-backref\" href=\"#fnref:time\" title=\"Jump back to footnote 22 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:sources\">\n<p>In this footnote, I'll list some interesting cargo cult stories that didn't fit into the body of the article.</p>\n<p>The 1964 <a href=\"https://www.google.com/books/edition/BLS_Report/jmNGAQAAIAAJ\">US Bureau of Labor Statistics</a>\nreport on New Guinea describes cargo cults:\n\"A simplified explanation of them is often given namely that contact with Western culture has given the indigene a desire for a better economic standard of living this desire has not been accompanied \nby the understanding that economic prosperity is achieved by human effort.\nThe term cargo cult derives from the mystical expectation of the imminent arrival by sea or air of the good things of this earth.\nIt is believed sufficient to build warehouses of leaves and prepare air strips to receive these goods.\nActivity in the food gardens and daily community routine chores is often neglected so that economic distress is engendered.\"</p>\n<p><a href=\"https://www.jstor.org/stable/40328944\">Cargo Cult Activity in Tangu</a> (Burridge) is a 1954 anthropological paper\ndiscussing stories of three cargo cults in Tangu, a region of New Guinea.\nThe first involved dancing around a man in a trance, which was supposed to result in the appearance\nof \"rice, canned meat, lava-lavas, knives, beads, etc.\"\nIn the second story, villagers built a shed in a cemetery and then engaged in ritualized sex acts,\nexpecting the shed to be filled with goods. However, the authorities forced the\nparticipants to dismantle the shed and throw it into the sea.\nIn the third story, the protagonist is Mambu, who stowed away on a steamship to Australia, where he\ndiscovered the secrets of the white man's cargo. On his return,\nhe collected money to help force the Europeans out, until he was jailed. He performed \"miracles\" by\nappearing outside jail as well as by producing money out of thin air.</p>\n<p><a href=\"http://www.jstor.org/stable/40328935\">Reaction to Contact in the Eastern Highlands of New Guinea</a> (Berndt, 1954)\nhas a long story about Berebi, a leader who was promised a rifle, axes, cloth, knives, and valuable cowrie by a white spirit.\nBerebi convinces his villagers to build storehouses and they filled the houses with stones that would\nbe replaced by goods.\nThey take part in many pig sacrifices and various rituals, and endure attacks of shivering and paralysis,\nbut they fail to receive any goods and Berebi concludes that the spirit deceived him.&#160;<a class=\"footnote-backref\" href=\"#fnref:sources\" title=\"Jump back to footnote 23 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:controversy\">\n<p>Many anthropologists view the idea of cargo cults as controversial.\nOne anthropologist states, \"What I want to suggest here is that, similarly, cargo cults do not exist, or at least their symptoms vanish when we start to doubt that we can arbitrarily extract a few features from context and label them an institution.\"\nSee <a href=\"https://lir.byuh.edu/index.php/pacific/article/view/2811/2719\">A Note on Cargo Cults and Cultural Constructions of Change</a> (1988).\nThe 1992 paper <a href=\"https://www.jstor.org/stable/40331318\">The Yali Movement in Retrospect: Rewriting History, Redefining 'Cargo Cult'</a> summarizes the uneasiness that many anthropologists have with the term \"cargo cult\",\nviewing it as \"tantamount to an invocation of colonial power relationships.\"</p>\n<p>The book <a href=\"https://amzn.to/3C6GQEA\">Cargo, Cult, and Culture Critique</a> (2004) states, \n\"Some authors plead quite convincingly for the abolition of the term itself, not only because of its troublesome implications, but also because, in their view, cargo cults do not even exist as an identifiable object of study.\"\nOne paper states that the phrase is both inaccurate and necessary, proposing that it be written\ncrossed-out (<em><a href=\"https://en.wikipedia.org/wiki/Sous_rature\">sous rature</a></em> in Derrida's post-modern language).\nAnother paper states: \"Cargo cults defy definition. They are inherently troublesome and problematic,\"\nbut concludes that the term is useful precisely because of this troublesome nature.</p>\n<p>At first, I considered the idea of abandoning the label \"cargo cult\" to be absurd, but after\nreading the anthropological arguments, it makes more sense.\nIn particular, the category \"cargo cult\" is excessively broad, lumping together unrelated things\nand forcing them into a Procrustean ideal: John Frum has very little in common with\nVaialala Madness, let alone the Johnson Cult.\nI think that the term \"cargo cult\" became popular due to its catchy, alliterative name.\n(Journalists love alliterations such as \"Digital Divide\" or \"Quiet Quitting\".)&#160;<a class=\"footnote-backref\" href=\"#fnref:controversy\" title=\"Jump back to footnote 24 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:ancestors\">\n<p>It was clear to the natives that the ancestors, and not the Europeans, must have created the cargo because the local Europeans were unable to\nrepair complex mechanical devices locally, but had to ship them off.\nThese ships presumably took the broken devices back to the ancestral spirits to be repaired.\nSource: <a href=\"https://archive.org/details/trumpetshallsoun0000unse/page/119/mode/1up\">The Trumpet Shall Sound</a>, p119.&#160;<a class=\"footnote-backref\" href=\"#fnref:ancestors\" title=\"Jump back to footnote 25 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:berndt\">\n<p>The report from the 1943 patrol is discussed in Berndt's \"A Cargo Movement in the Eastern Central Highlands of New Guinea\",  <em>Oceania</em>, Mar. 1953 (<a href=\"https://www.jstor.org/stable/40328389\">link</a>), page 227.\nThese radio houses are also discussed in <a href=\"https://archive.org/details/trumpetshallsoun0000unse/page/198/mode/2up\">The Trumpet Shall Sound</a>, page 199.&#160;<a class=\"footnote-backref\" href=\"#fnref:berndt\" title=\"Jump back to footnote 26 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:airplanes\">\n<p>Wooden airplanes are a staple of the pop-culture cargo cult story, but they are extremely rare in\nauthentic cargo cults. I searched extensively, but could find just a few primary sources\nthat involve airplanes.</p>\n<p>The closest match that I could find is \n<a href=\"https://archive.org/details/vanishingpeoples00nati/page/28/mode/2up\">Vanishing Peoples of the Earth</a>, published by National Geographic in 1968, which mentions a New Guinea village\nthat built a \"crude wooden airplane\", which they thought \"offers the key to getting cargo\".</p>\n<p>The photo below, from 1950, shows a cargo-house built in the shape of an airplane.\n(Note how abstract the construction is, compared to the realistic straw airplanes in faked photos.)\nThe photographer mentioned that another cargo house was in the shape of a jeep, while\nin another village, the villagers gather in a circle at midnight to await the arrival of\nheavily laden cargo boats.</p>\n<p><a href=\"https://static.righto.com/images/cargocult/cargo-house.jpg\"><img alt=\"The photo is from They Still Believe in Cargo Cult, Pacific Islands Monthly, May 1950.\" class=\"hilite\" height=\"416\" src=\"https://static.righto.com/images/cargocult/cargo-house-w400.jpg\" title=\"The photo is from They Still Believe in Cargo Cult, Pacific Islands Monthly, May 1950.\" width=\"400\" /></a><div class=\"cite\">The photo is from <a href=\"https://nla.gov.au/nla.obj-322270499/view?sectionId=nla.obj-333425461&amp;partId=nla.obj-322562760\">They Still Believe in Cargo Cult</a>, Pacific Islands Monthly, May 1950.</div></p>\n<p>David Attenborough's Cargo Cult documentary shows a small wooden airplane, painted scarlet red.\nThis model airplane is very small compared to the mock airplanes described in the pop-culture cargo cult.</p>\n<p><a href=\"https://static.righto.com/images/cargocult/scarlet-airplane.jpg\"><img alt=\"A closeup of the model airplane. From Attenborough's Cargo Cult documentary.\" class=\"hilite\" height=\"377\" src=\"https://static.righto.com/images/cargocult/scarlet-airplane-w500.jpg\" title=\"A closeup of the model airplane. From Attenborough's Cargo Cult documentary.\" width=\"500\" /></a><div class=\"cite\">A closeup of the model airplane. From Attenborough's Cargo Cult documentary.</div></p>\n<p>The photo below shows the scale of the aircraft, directly in front of Attenborough.\nIn the center, a figure of John Frum has a \"scarlet coat and a white, European face.\"\nOn the left, a cage contains a winged rat for some reason.</p>\n<p><a href=\"https://static.righto.com/images/cargocult/monument.jpg\"><img alt=\"David Attenborough visiting a John Frum monument on Tanna, near Sulfur Bay.\nFrom Attenborough's Cargo Cult documentary.\" class=\"hilite\" height=\"373\" src=\"https://static.righto.com/images/cargocult/monument-w500.jpg\" title=\"David Attenborough visiting a John Frum monument on Tanna, near Sulfur Bay.\nFrom Attenborough's Cargo Cult documentary.\" width=\"500\" /></a><div class=\"cite\">David Attenborough visiting a John Frum monument on Tanna, near Sulfur Bay.\nFrom Attenborough's Cargo Cult documentary.</div></p>\n<p><!-- -->&#160;<a class=\"footnote-backref\" href=\"#fnref:airplanes\" title=\"Jump back to footnote 27 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:mondo-cane-posed\">\n<p>The photo below shows another scene from the movie <em>Mondo Cane</em> that is very popular online in cargo cult articles.\nI suspect that the airplane is not authentic but was made for the movie.</p>\n<p><a href=\"https://static.righto.com/images/cargocult/mondo-cane-posed.jpg\"><img alt=\"Screenshot from Mondo Cane, \n showing the cargo cultists posed in front of their airplane.\" class=\"hilite\" height=\"346\" src=\"https://static.righto.com/images/cargocult/mondo-cane-posed-w500.jpg\" title=\"Screenshot from Mondo Cane, \n showing the cargo cultists posed in front of their airplane.\" width=\"500\" /></a><div class=\"cite\">Screenshot from <a href=\"https://youtu.be/Mj5U8UbWqsk?si=a7-P8t81gJiBT3pF&amp;t=6240\">Mondo Cane</a>, \n showing the cargo cultists posed in front of their airplane.</div></p>\n<p><!-- -->&#160;<a class=\"footnote-backref\" href=\"#fnref:mondo-cane-posed\" title=\"Jump back to footnote 28 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:tobriand-islands\">\n<p>The tale of women pursuing men was described in detail in the 1929 anthropological book <a href=\"https://www.berose.fr/IMG/pdf/malinowski_1929-the_sexual_life_of_savages.pdf\">The Sexual Life of Savages in North-Western Melanesia</a>,\nspecifically the section \"<i>Yausa</i>&mdash;Orgiastic Assaults by Women\" (pages 231-234).\nThe anthropologist heard stories about these attacks from natives, but didn't observe them firsthand and remained skeptical.\nHe concluded that \"The most that can be said with certainty is that the <i>yausa</i>, if it happened at all, happened extremely rarely\".\nUnlike the portrayal in <em>Mondo Cane</em>, these attacks on men were violent and extremely unpleasant (I won't go into details).\nThus, it is very likely that this scene in <em>Mondo Cane</em> was staged, based on the stories.&#160;<a class=\"footnote-backref\" href=\"#fnref:tobriand-islands\" title=\"Jump back to footnote 29 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:mondo-cane-books\">\n<p>The movie <em>Mondo Cane</em> directly influenced the pop-culture cargo cult as shown by several books.\nThe book <a href=\"https://archive.org/details/riveroftearsrise0000west_d6c3/page/111/mode/1up\">River of Tears: The Rise of the Rio Tinto-Zinc Mining Corporation</a> explains cargo cults\nand how one tribe built an \"aeroplane on a hilltop to attract the white man's aeroplane and its cargo\",\nciting <em>Mondo Cane</em>.\nLikewise, the book <a href=\"https://archive.org/details/introducingsocia00aren/page/189/mode/1up\">Introducing Social Change</a> states that underdeveloped nations are moving directly from ships to airplanes without building railroads,\nbizarrely using the cargo cult scene in <em>Mondo Cane</em> as an example.\nFinally, the religious book <a href=\"https://archive.org/details/bwb_W8-BZO-774/page/85/mode/1up\">Open Letter to God</a>\nuses the cargo cult in <em>Mondo Cane</em> as an example of the suffering of godless people.&#160;<a class=\"footnote-backref\" href=\"#fnref:mondo-cane-books\" title=\"Jump back to footnote 30 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:cows\">\n<p>Another possibility is that Feynman got his cargo cult ideas from the\n1974 book <a href=\"https://archive.org/details/cowspigswarsandwitches/page/n143/mode/2up\">Cows, Pigs, Wars and Witches: The Riddle of Culture</a>. It has a chapter \"Phantom Cargo\", which starts with a description suspiciously similar to the scene in <i>Mondo Cane</i>:\n<blockquote>\nThe scene is a jungle airstrip high in the mountains of New Guinea.\nNearby are thatch-roofed hangars, a radio shack, and a beacon tower made of bamboo.\nOn the ground is an airplane made of sticks and leaves.\nThe airstrip is manned twenty-four hours a day by a group of natives wearing nose ornaments and shell armbands.\nAt night they keep a bonfire going to serve as a beacon.\nThey are expecting the arrival of an important flight: cargo planes filled with canned food, clothing, portable radios, wrist watches, and motorcycles.\nThe planes will be piloted by ancestors who have come back to life.\nWhy the delay? A man goes inside the radio shack and gives instructions into the tin-can microphone.\nThe message goes out over an antenna constructed of\nstring and vines: “Do you read me? Roger and out.” From time to time they watch a jet trail crossing the sky; occasionally they hear the sound of distant motors.\nThe ancestors are overhead! They are looking for them.\nBut the whites in the towns below are also sending messages.\nThe ancestors are confused.\nThey land at the wrong airport.\n</blockquote>&#160;<a class=\"footnote-backref\" href=\"#fnref:cows\" title=\"Jump back to footnote 31 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:radio-telescope\">\n<p>Some other uses of the radio telescope photo as a cargo-cult item are\n<a href=\"https://tellmeboutblog.wordpress.com/2017/11/11/cargo-cults/\">Cargo cults</a>,\n<a href=\"https://www.newhistorian.com/2018/07/17/melanesian-cargo-cults-consumerism/\">Melanesian cargo cults and the unquenchable thirst of consumerism</a>,\n<a href=\"https://eisultan.medium.com/cargo-cult-correlation-vs-causation-3b0fa4069677\">Cargo Cult : Correlation vs. Causation</a>,\n<a href=\"https://www.linkedin.com/pulse/cargo-cult-agile-stephen-clarke/\">Cargo Cult Agile</a>,\n<a href=\"https://faun.pub/stop-looking-for-silver-bullets-14be33391c03\">Stop looking for silver bullets</a>,\nand\n<a href=\"https://medium.com/@tgof137/cargo-cult-investing-ce232cf34c46\">Cargo Cult Investing</a>.&#160;<a class=\"footnote-backref\" href=\"#fnref:radio-telescope\" title=\"Jump back to footnote 32 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:chariots\">\n<p><em>Chariots of the Gods</em> claims to be showing a cargo cult from an isolated island in the South Pacific. \nHowever, the large succulent plants in the scene are \nEuphorbia ingens and tree aloe, which grow in southern Africa, not the South Pacific.\nThe rock formations at the very beginning look a lot like Matobo Hills in Zimbabwe.\nNote that these \"Stone Age\" people are astounded by the modern world but ignore the cameraman who\nis walking among them.</p>\n<p>Many cargo cults articles use photos that can be traced back from this film, such as\n<a href=\"https://medium.com/@jason.godesky/the-scrum-cargo-cult-98def5b4af2f\">The Scrum Cargo Cult</a>,\n<a href=\"https://uxplanet.org/is-your-ux-cargo-cult-28d3cc1568f8\">Is Your UX Cargo Cult</a>,\n<a href=\"https://guardian.ng/life/culture-lifestyle/the-remote-south-pacific-island-where-they-worship-planes/\">The Remote South Pacific Island Where They Worship Planes</a>,\n<a href=\"https://www.slideshare.net/slideshow/the-design-of-everyday-games/59686626#3\">The Design of Everyday Games</a>,\n<a href=\"https://mengerian.medium.com/austrians-dont-be-fooled-by-the-bitcoin-core-cargo-cult-e7c66a7c5ccd\">Don’t be Fooled by the Bitcoin Core Cargo Cult</a>,\n<a href=\"https://www.smashingmagazine.com/2010/04/the-dying-art-of-design\">The Dying Art of Design</a>,\n<a href=\"https://www.smashingmagazine.com/2010/04/the-dying-art-of-design\">Retail Apocalypse Not</a>,\n<a href=\"https://blog.bradfieldcs.com/you-are-not-google-84912cf44afb\">You Are Not Google</a>,\nand\n<a href=\"https://tellmeboutblog.wordpress.com/2017/11/11/cargo-cults/\">Cargo Cults</a>.\nThe general theme of these articles is that you shouldn't copy what other people are doing without\nunderstanding it, which is somewhat ironic.&#160;<a class=\"footnote-backref\" href=\"#fnref:chariots\" title=\"Jump back to footnote 33 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:jargon\">\n<p>The Jargon File defined \"cargo-cult programming\" in 1991:\n<blockquote>\n<b>cargo-cult programming</b>: n. A style of (incompetent) programming\ndominated by ritual inclusion of code or program structures that\nserve no real purpose. A cargo-cult programmer will usually\nexplain the extra code as a way of working around some bug\nencountered in the past, but usually, neither the bug nor the\nreason the code avoided the bug were ever fully understood.\n<p>\nThe term cargo-cult is a reference to aboriginal religions that\ngrew up in the South Pacific after World War II.  The practices of\nthese cults center on building elaborate mockups of airplanes and\nmilitary style landing strips in the hope of bringing the return of\nthe god-like airplanes that brought such marvelous cargo during the\nwar. Hackish usage probably derives from Richard Feynman's\ncharacterization of certain practices as \"cargo-cult science\" in\n`Surely You're Joking, Mr. Feynman'.\n</blockquote></p>\n<p>This definition of \"cargo-cult programming\" came from a <a href=\"https://groups.google.com/g/alt.folklore.computers/c/h2Yqb1kUjHI/m/CNuwMv-Huw8J\">1991 Usenet post</a> to alt.folklore.computers, quoting Kent Williams.\nThe definition was added to the much-expanded <a href=\"\">1991 Jargon File</a>, which\nwas published as <a href=\"https://amzn.to/4f3SXAa\">The New Hacker's Dictionary</a> in 1993.&#160;<a class=\"footnote-backref\" href=\"#fnref:jargon\" title=\"Jump back to footnote 34 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:overuse\">\n<p>Overuse of the cargo cult metaphor isn't specific to programming, of course.\nThe book <a href=\"https://amzn.to/48jvmcq\">Cargo Cult: Strange Stories of Desire from Melanesia and Beyond</a>\ndescribes how \"cargo cult\" has been applied to everything\nfrom advertisements, social welfare policy, and shoplifting to the Mormons, Euro Disney, and the state of New Mexico.</p>\n<p>This book, by Lamont Linstrom,\nprovides a thorough analysis of writings on cargo cults.\nIt takes a questioning, somewhat trenchant look at these writings, illuminating\nthe development of trends in these writings and the lack of objectivity.\nI recommend this book to anyone interested in the term \"cargo cult\" and its history.&#160;<a class=\"footnote-backref\" href=\"#fnref:overuse\" title=\"Jump back to footnote 35 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:hn-cargo-cult\">\n<p>Some more things that have been called \"cargo cult\" on Hacker News:\n<a href=\"https://news.ycombinator.com/item?id=21909497\">the American worldview</a>,\n<a href=\"https://news.ycombinator.com/item?id=34876144\">ChatGPT fiction</a>,\n<a href=\"https://news.ycombinator.com/item?id=2265437\">copy and pasting code</a>,\n<a href=\"https://news.ycombinator.com/item?id=17778367\">hiring</a>, \n<a href=\"https://news.ycombinator.com/item?id=17778566\">HR</a>,\n<a href=\"https://news.ycombinator.com/item?id=37016443\">priorities</a>,\n<a href=\"https://news.ycombinator.com/item?id=37110874\">psychiatry</a>,\n<a href=\"https://news.ycombinator.com/item?id=37111921\">quantitative tests</a>,\n<a href=\"https://news.ycombinator.com/item?id=37112516\">religion</a>,\n<a href=\"https://news.ycombinator.com/item?id=37057893\">SSRI medication</a>,\n<a href=\"https://news.ycombinator.com/item?id=35301168\">the tech industry</a>,\n<a href=\"https://news.ycombinator.com/item?id=13776060\">Uber</a>,\nand\n<a href=\"https://news.ycombinator.com/item?id=37111013\">young-earth creationism</a>.&#160;<a class=\"footnote-backref\" href=\"#fnref:hn-cargo-cult\" title=\"Jump back to footnote 36 in the text\">&#8617;</a></p>\n</li>\n</ol>\n</div>",
  "id": "tag:blogger.com,1999:blog-6264947694886887540.post-3749482818633148647"
}