{
  "title": "The Ascent to Sandia Crest",
  "link": "https://computer.rip/2025-09-28-the-ascent-to-sandia-crest-part-1.html",
  "published": "28 Sep 2025 00:00:00 UT",
  "summary": "<blockquote>\n<p>The Rotary Club will take immediate action on the Ellis ranch loop project.\nThe Rotarians reached this decision at their weekly luncheon, held yesterday\nat the Albarado hotel.</p>\n<p>The club's plan is not merely to give Albuquerque a good, short road to the\nEllis ranch... They embrace the building of a seventy-mile scenic loop. <sup class=\"footnote-ref\" id=\"fnref-1\"><a href=\"#fn-1\">1</a></sup></p>\n</blockquote>\n<p>Many Western cities are defined, in part, by their mountains. Those moving from\ntown to town often comment on the disorientation, the disruption, caused by a\nchange in the city's relation to the peaks. If you have ever lived in a place\nwith the mountains on the west, and then a place with the mountains on the east,\nyou will know what I mean. We get used to living in the shadows of mountains.</p>\n<p>One of the appeals of mountains, perhaps the source of their mysticism, is\ninaccessibility. Despite their close proximity to Albuquerque, steep slopes and\ndifficult terrain kept the Sandias a world apart from the city, even to this\nday. Yet we have always been driven to climb, to ascend to the summit.</p>\n<p>Humans climb mountains not only as a matter of individual achievement, but also\nas a matter of infrastructure. Whether the inaccessibility of mountain peaks is a\ngood thing or a bad thing depends on the observer; and even the most challenging\nmountain ascents are sometimes developed to the scale of an industrial tourism\noperation.</p>\n<p>And somewhere, in between, are the Sandias. Not technically part of the Rocky\nMountains but roughly aligned with them, the Sandias lack a clear peak. Instead,\nthe range is an elongated ridge, making up the entire eastern boundary of the\ncity of Albuquerque and extending some distance further north into the Sandia\nPueblo. The highest point is at 10,679', relatively modest for the mountain\nstates---but still one of the most prominent in New Mexico, moreso even than the\nhigher-elevation Mt. Taylor and Wheeler Peak.</p>\n<p>Today, the Sandias are a major site for recreation. Tourists reach the upper\nparts of the mountain by one of two means: Sandia Crest Scenic Highway, which\nclimbs the gentler eastern slope of the mountain to the crest itself; or the\nSandia Peak Aerial Tramway, which makes a daring ascent from the edge of the\ncity up the western side. Either provides access to an extensive network of\ntrails, as do numerous points in the foothills and along the scenic highway.</p>\n<p>Like bagging any peak, these access routes were hard-won. Their present\ncontours---engineering achievements, twists and turns, scars on the\nlandscape---reflect over one hundred years of ambition and conflict. Some of\nAlbuquerque's most prominent figures left their marks on the mountain, as did\neveryday Burqueños, President Richard M. Nixon, and the slow grind of state and\nfederal bureaucracy. The lay of the land today tells a story about the changing\nrelationship of the city with the mountains, and more broadly of the American\npublic with the wilderness.</p>\n<p>It also explains why so many older documents and maps refer to the highway to\nthe crest as a &quot;loop,&quot; when it does no such thing. Here's the clickbait\nheadline: Where does the Sandia Loop Highway go? The answer will surprise you.</p>\n<hr />\n<p>Exploration of the Sandias by Spanish expeditions were motivated in large part\nby rumors of great mineral wealth. Certainly there are minerals in the\nmountains, and the Pueblo people had told the Spanish expeditions coming up the\nvalley of gold and other precious metals, both in the mountains and in the\nplains beyond them. With the full perspective of history, it seems that these\nreports were less grounded in fact and more in a well-founded desire to get the\nSpanish to move on elsewhere. Supposedly several mines were established, but\nthey left little mark on the landscape and their locations are now forgotten.</p>\n<p>The Sandias, while rich in scenery, were not rich in gold. For centuries, they\nremained mostly undeveloped, besides Pueblo settlements in areas such as Tijeras\ncanyon which were later abandoned in large part due to the increasing\nencroachment of settlers. Just a small number of people, mostly hunters, called\nthe mountains their home. A few mining operations made their way into the\nmountains during the 19th century, perhaps repeating the mistakes of the\nSpanish several hundred years before.</p>\n<p>It was these mining camps that brought the Ellis family to Albuquerque. They had\nrun a ranch in the eastern plains of New Mexico, but were driven into the city\nby lack of water. Patriarch George Ellis found work for a fruit distributor,\ndelivering produce to the mining camps in the mountains. Perhaps missing their\ndays out in the country, George took his time as he traveled the canyons and\nridges between camps. His wanderings were rewarded when he found Las Huertas\nCanyon, a narrow slot with a creek, protection from the wind, and what George\nEllis himself called &quot;extraordinary beauty.&quot;</p>\n<p>The Ellis family moved into the canyon as early as 1893, but in 1905 George\nEllis filed a land patent for what was, as an outcome of the Treaty of Guadalupe\nHidalgo, frontier up for the taking. Ellis Ranch, as it was called, was indeed\nextraordinary: one of the most pleasant places in the mountains. But, then, the\nEllis family were rather extraordinary as well. Life on the mountainside at\n7,600 feet wasn't easy, but they kept cattle, chickens, and a modest farm.</p>\n<p>Charlotte Ellis, George's daughter, had not yet a year of education at UNM when\nthey moved out of town and up the slopes on the east side of the ridge. Still,\nshe built a notable career as an amateur botanist. It is because of her efforts\nthat Ellis ranch is often described in terms of its plant life---Charlotte\ncollected specimens of hundreds of plant species, some of them new discoveries,\nand the ranch is said to have contained examples of every flowering plant known\nto exist in the mountains.</p>\n<p>Plants were not Charlotte's only interest, though. She was apparently a skier,\nin a time well before skiing was known as a recreational pastime. A photo taken\nin 1896 shows her in a snow-covered landscape, facing away from the camera.\nShe's looking down the slope, wearing a full dress and a pair of wooden skis.\nHer pose suggests a certain resolve, the kind you would need to spend the winter\nhigh above the nearest towns. It is often captioned as the first photograph of a\nperson skiing in New Mexico. It may be the first photo of a woman skiing at all\n<sup class=\"footnote-ref\" id=\"fnref-6\"><a href=\"#fn-6\">2</a></sup>.</p>\n<p>It also foreshadows the tremendous impact that skiing would have on the mountains\nand on Albuquerque. We don't know exactly what she was thinking, but what we do\nknow about her suggests that she viewed the mountains much as we do today: for\ntheir beauty, their diversity, and for their thrill.</p>\n<p>George Ellis had perhaps filed his land patent just in time. The Forest Service\nhad existed for some years but was reorganized under its current name, and as\npart of the Department of the Interior, in 1905. The forests of the Sandia\nMountains have a complicated legal history owing to the interaction of Spanish\nand Mexican land grants with the Treaty of Guadalupe Hidalgo at the conclusion\nof the Mexican-American war. You could say that the matter of the forest's legal\nownership was not entirely settled until 2004.</p>\n<p>None of that stopped President Roosevelt declaring the Sandias part of the\nManzano Forest Reserves in 1906. Shortly after, the Forest Reserves became a\nNational Forest and a ranger station was under construction near Tijeras. Paul\nEllis, the son of the family, was soon hired on as one of the national forest's\nfirst staff; the Ellis Ranch one of the few private parcels within the federal\nboundaries.</p>\n<hr />\n<p>The Forest Service has always served multiple purposes: &quot;Land of Many Uses,&quot; as\nForest Service signs still proclaim. Principle concerns of the forest service\nincluded lumber, cattle and sheep grazing, mining, and hunting. These uses were\nalready widespread at the dawn of the modern Forest Service, so in practice,\nmuch of the role of early Forest Rangers was to bring forest users under control.\nExtensive regulations and rules were backed by a small set of rangers of the\n&quot;Stetson era,&quot; rugged types not unlike the Ellises.</p>\n<p>What we don't always picture as a part of that era was recreation. The &quot;crunchy\ngranola&quot; brand of wilderness recreation most widely promoted today is indeed a\nmore modern phenomenon, but forests have been viewed as recreational assets\nsince the dawn of forest management---the form of that recreation has just\nchanged, largely in response to new concepts of environmental stewardship that\nemphasize preservation over &quot;improvement.&quot;</p>\n<p>In 1913, George Ellis passed away. After a small ceremony, he was buried in a\ncemetery established next to his ranch. With George gone, the rest of the Ellis\nfamily began to scatter, moving into towns, closer to work. This left the\nquestion of the ranch.</p>\n<p>By the time of George's death, Ellis Ranch had already become renowned for\nhospitality. The newspapers of the day recounted some of Albuquerque's finest\ntaking vacations at the Ellis Ranch, a trip that was something of an adventure\nin the 1900s. It took a few hours, in fine conditions, to make the way up a\nrough trail to the Ellis homestead. One local businessman, known to newspaper\nreaders as &quot;the bee man,&quot; took some pride in having gotten a Ford automobile to\nwithin a mile of the site. Even so, the journey was well-agreed to be\nworthwhile. Las Huertas canyon was beautiful, and the Ellises known to offer\nfresh produce, spring water, and mountain air---a commodity in increasingly high\ndemand as tuberculosis swept the country.</p>\n<p>The reputation of the Ellis ranch for taking visitors explains the Albuquerque\nTribune's matter-of-fact statement that the Ellis ranch would likely become a\ntourist resort, despite the lack of known buyers. At that time, the Forest\nService was already in an infrastructure-building mood. La Madera, then one\nof the larger settlements in the east mountains, had telephone service and the\nForest Service was extending the line to the ranch.</p>\n<p>Shortly after, the buyers emerged, Raymond Stamm (uncle of the Stamm of Bradbury\nStamm Construction) and Jack Sheehan of Albuquerque.</p>\n<blockquote>\n<p>These young men propose to fit up the ranch as a mountain resort, the house\nbeing splendidly adapted to a mountain club house, with fine fishing, hunting,\nand camping facilities all about. <sup class=\"footnote-ref\" id=\"fnref-2\"><a href=\"#fn-2\">3</a></sup></p>\n</blockquote>\n<p>One challenge for this ambitious pair was, of course, the road: for the ranch to\nbe the resort they imagined it needed an easier means of access. It was estimated\nthat this effort would only require a few hundred dollars, reworking about three\nmiles of trail between the ranch and a better road to Tijeras.</p>\n<p>Even by 1913, an improved road to Ellis Ranch was a recurring theme in the\nnewspapers. George Ellis, before his death, had estimated $500 to improve the\nroad between the ranch and Placitas to passable condition. After his death,\nthe estimate on this longer segment reached the thousands.</p>\n<p>Some of the problem was, of course, hubris: the Albuquerque boosters of the day\ncould look at three miles of faint road climbing up and down cabins and call it\na few days of work. When these projects went underway, they always took longer\nand cost more than expected. To be fair, though, they were also fighting a\nliving foe. Thunderstorm downpours and winter snow repeatedly washed out the\nroad in the steeper sections. Reading of road improvement efforts, you get\nrepeated deja vu. They are, in fact, announcing plans to fix the same section\nof road over and over again---it having always washed out the previous year.</p>\n<p>The Stamm-Sheehan resort seems to have been popular, even as the road stayed\nrough. In September of 1914, the faculty of UNM held what we might now call an\n&quot;offsite&quot; there. Indeed, during 1914 and 1915 it seemed that practically\neverybody who was anybody was vacationing at Ellis Ranch. All the while, though,\nthey were still struggling to get there... a situation that the Rotarians\nresolved to correct.</p>\n<hr />\n<p>The road to Ellis Ranch has been known by many names and promoted by many\npeople. The Rotary Club was a powerful force in the Albuquerque of 1916, though,\nand their proposal seems to have set the pattern for those that followed. The\nEllis Ranch Loop Road, as they called it, would span 70 miles from Albuquerque\nto Albuquerque. The route went through the Tijeras pass, turned north to San\nAntonito <sup class=\"footnote-ref\" id=\"fnref-3\"><a href=\"#fn-3\">4</a></sup> and passed Ellis Ranch on the way to La Madera and then Placitas.\nFrom there, it went nearly to Bernalillo, meeting the Santa Fe-Albuquerque road\nthat would soon become part of Route 66---until 1937, at least.</p>\n<blockquote>\n<p>A big argument for the loop, besides the fact that it makes the Ellis summer\nresort more easily accessible, is its scenery.</p>\n</blockquote>\n<p>At the time of the Rotary Club proposal, the region's road map was in some ways\nfamiliar, and in some ways rather different. Many of the today's routes were\nalready known but their condition was widely variable. The trip from Albuquerque\nto Tijeras, which would become the ultimate Route 66 alignment, was already in\nplace. It was shorter in 1913, though, not extending much further east, and far\nfrom a highway. There was a rough road north to San Antonito, and there had once\nbeen a road further north from there to La Madera, but by 1916 it had been\nclosed where it entered a private land grant.</p>\n<p>This is probably the biggest difference from our modern road network: the route\nthrough Tijeras Canyon was not used for much other than access to Tijeras, and\nfor much of the era covered in this article the preferred way to negotiate the\nSandias and Manzanos was to go around them entirely. This is a good part of the\nreason for Route 66's original north-south alignment through the Rio Grande\nValley, one that added significant mileage but avoided the mountain pass that\nwas slow going in good weather and could be outright impassable in winter.</p>\n<p>Similarly, from the north, there was an existing road from Bernalillo through\nPlacitas and into the East Mountains. It was, in fact, the main route used by\nmany of the residents there. It was not an easy route, though, long and prone\nto washouts.</p>\n<p>And while these roads came close to forming a loop, they didn't. A section of\nabout four miles was missing, right in the middle. Ellis Ranch was, of course,\nsomewhere in that in-between.</p>\n<p>So, the Rotary Club project was mostly the improvement of existing roads, along\nwith the construction of new road in a couple of areas required to complete the\nloop around the Sandia range. The Rotarians estimated the cost at $5,000, and\nthe Forest Service offered to pitch in.</p>\n<p>Now, we must consider that $5,000 was a significant amount of money in 1916,\nsomething around $150,000 today. This inflation calculation probably\nunderestimates the ask, because extensive investment in highway construction was\nnot yet the pillar of American culture that it is today. Still, public\nenthusiasm for the project was high, and by the end of 1916 Bernalillo County\nhad enacted a tax assessment to to support the road. The state legislature\njoined on, and with the Forest Service's share the project was fully funded.\nConstruction seems to have began in earnest in 1917, on improvements to the road\nthrough Tijeras Pass.</p>\n<p>Efforts on the loop road coincided, of course, with work to develop Ellis Ranch\nas a summer resort. Starting in 1917, regular newspaper ads appear for vacation\ncabin rentals at Ellis Ranch, with instructions to telephone Hugh Cooper. This\nHigh Cooper was Hugh Cooper Jr., son of the Hugh Cooper who was pastor of the\nFirst Presbyterian Church. Much like George Ellis, Rev. Cooper was a well-known\nfigure around Albuquerque. Given that he officiated the wedding of at least one\nof Ellis's children, he was presumably friendly with the Ellises as well. The\nnewspapers are not exactly clear on how it came to happen, but Rev. Cooper Sr\nwould soon become much more involved in the ranch: in 1923, he and his sister\nwent in together to buy it.</p>\n<blockquote>\n<p>&quot;We hope to keep this beauty spot of nature, so near our city, from falling\ninto the hands of sports, who will advertise dance pavilions and\nentertainments of a sordid nature. If our plans mature we hope to make it a\nplace where parents can go with their children and find recreation of an\nexalted character.&quot; <sup class=\"footnote-ref\" id=\"fnref-4\"><a href=\"#fn-4\">5</a></sup></p>\n</blockquote>\n<p>Rev. Cooper's motivations were, he assured the newspaper, godly rather than\npecuniary. The phrase &quot;exalted recreation&quot; was singled out for the headline and\nis certainly one to remember as you explore the Sandias. Cooper was not, though,\nimmune to the sort of boosterism that so animated the Rotary Club.</p>\n<blockquote>\n<p>&quot;We hope, with the help of the good people of Albuquerque, to make the famous\nEllis Ranch a second Estes park.&quot;</p>\n</blockquote>\n<hr />\n<p>The 1910s and '20s were boom years in Albuquerque, with a confluence of the\nrailroad shops, the sawmill, and tuberculosis bringing new residents at a fast\nclip. The population more than doubled from 1900 to 1920, and with the newcomers\ncame urban development. Subdivisions went under construction west of New Town, a\nskyscraper rose, and car ownership proliferated. The same period, for many of\nthe same reasons, saw the genesis of American tourism. Trains brought visitors\nfrom out of town, and cars brought visitors and residents alike out into the\nsurroundings. Boosters, from the city council to the chamber of commerce to a\nhalf dozen clubs, all had plans to make the best of it.</p>\n<p>There was, to be sure, a certain aspect of keeping up with the joneses. Colorado\nwas building a strong reputation as a tourist destination, and Denver as a\nbeautiful and prosperous city. Arizona and Nevada had not yet gained populous\ncities, and west Texas was no less sparse than it is now. For the businessmen of\nAlbuquerque, Colorado was the competition... and Colorado was building summer\nresorts.</p>\n<p>The concept of the &quot;summer resort&quot; is mostly forgotten today, but in the 1920s\nthere was little air conditioning and cities were gaining a reputation as\ncrowded and polluted. The spread of Tuberculosis had brought particular\nattention to &quot;clean, fresh air,&quot; and nothing was quite as clean and fresh as a\nsummer day in the mountains. Estes Park, a town in the northern Colorado\nrockies, had multiple fine hotels by 1910 and attracted the tourism to match.</p>\n<p>Further, in 1910, Denver's own boosters (groups like the Real Estate Exchange\nand the Denver Motor Club) began to acquire land for the Denver Mountain Parks.\nThe beautiful Genesee Park was under construction in 1920, with a lodge and\ncampground. Daniel Park had opened as a scenic drive (or &quot;Auto View&quot;). Plans for\nMount Blue Sky Scenic Byway, the highest paved road in North America, had been\nfinalized and announced to great fanfare.</p>\n<p>To the modern conservationist it seems odd that these plans were so focused on\nroads, but the automobile was new and exciting and in the West had almost\nsinglehandedly popularized the idea of &quot;wilderness recreation.&quot; The mountains\nwere no longer a destination only for the hardiest adventurers, they were also\nfor city dwellers, out for a drive and a picnic. The ideal of natural\npreservation was a long, winding road with regular scenic pullouts. If the road\ncould access a summer resort, all the better. Denver was doing it, and so\nAlbuquerque would too.</p>\n<p>Behind the scenes, the wheels of government had been turning. The Forest\nService approved construction through the mountains in 1919, which would &quot;make\naccessible some of the most beautiful mountain scenery in the state, in\naddition to bringing within easy reach sites for summer homes and temporary\ncamping places.&quot; At this point in its history, the Forest Service routinely\nleased space for the construction of private homes, and a small number were\nestablished in the national forest as the road progressed inwards.</p>\n<p>Bernalillo County had raised $12,500, the Forest Service committed $25,000,\nand the state was lobbied for another $12,500. A Forest Service engineer,\nspeaking to the County Commission, noted that the road would provide access\nto 30 million board feet of lumber. The Forest Service said that construction\ncould be finished by the end of the summer, and in September, the section from\nPlacitas to Ellis Ranch opened to drivers. The road from Ellis Ranch to\nSan Antonito had been surveyed, but work had not yet started.</p>\n<hr />\n<p>We should consider again how this historic project relates to the modern roads,\nbecause there is a surprise. Today, the primary access from Albuquerque to the\neastern slopes of the Sandias is via I-40 to Tijeras, and then NM-14 north\nthrough Cedar Crest and to then to San Antonito. There, NM-536 branches to the\nwest, becoming Sandia Crest Scenic Highway.</p>\n<p>NM-536 turns into Sandia Crest Scenic Highway, which is actually not a numbered\nhighway at all, at a 90-degree turn by the Balsam Glade picnic area. From the\npicnic area, a much smaller, rougher dirt road descends to the north: NM-165.\nToday, NM-165 is a rugged and adventurous route to Placitas, impassable in\nwinter and unfriendly to passenger vehicles.</p>\n<p>And yet, in the summer of 1919, it was this route that was made a &quot;first class\nroad&quot; to Ellis Ranch. The former site of Ellis Ranch now has a surprisingly\nwell-paved parking lot off of the dirt NM-165, signed as &quot;Las Huertas Canyon,&quot;\nand a trail continues up the creek through much of what was the summer resort.\nIt took about an hour and a half, the Journal reported, to drive from\nAlbuquerque to Ellis Ranch by this route around the north side. The travel time\nprobably isn't all that much faster today, given the slow going on the dirt road.</p>\n<p>In 1920, Bernalillo County ran into some trouble on the project funding. The\ncounty's plan to fund much of the project through bonds on the tax assessment\nwas, it turns out, in violation of state law. For accounting reasons, the total\nsum of the bonds would have to be much lower. The county was effectively out of\nthe project, at least as far as money was concerned.</p>\n<p>The Forest Service worked according to its own plans. Construction started on a\nforest road, what is now NM-536, that would later be home to Tinkertown. In\nsummer of 1922, it reached Sulphur Spring, the first of many recreation sites on\nits long trip up. Progress was brisk: the newspaper reported that 2.5 miles had\nbeen completed, then a few more, then eight. The forest road seems to have gone\nby different names at different times, and perhaps just depending on who was\ntalking, but as 1922 came to a close the Forest Service named it for the canyon\nthat it followed from San Antonito: Tejano Road.</p>\n<p>Tejano Road ended about where the bottom of the ski area is found today, some\nfour miles short of Ellis Ranch. Much of the Ellis Ranch Loop was complete, but\nit wasn't a loop. Plans had been completed for the final stretch, but it was\nunclear who would pay for the work---and when. The <em>Journal</em> printed an appeals\nto finish the project, several times mentioning the importance of a &quot;sky line\nroad.&quot;</p>\n<p>The sky line road was something of a fad in those days. California and Oregon\nboth had them, and plans were underway in many other parts of the west. A\nskyline road was what we might now call a scenic byway, but with a particular\nemphasis on views. Many followed a ridge, right down the center, so that drivers\ncould get a view down both sides. Extensive earth-moving and forestry were\nsometimes involved, modifying the environment to create these views.</p>\n<p>The West had a lead on the idea: it wasn't until 1925 that planning started on\nthe most famous, Skyline Drive of Shenandoah National Park. The 100-mile highway\nwas viewed as a wilderness adventure, but was about as far from our modern\nconception of wilderness as possible. Extensive clearing, of both trees and\nresidents, were required to manicure its vistas. It was seen as one of the\nfinest examples of American recreation, a model to be followed.</p>\n<hr />\n<p>In July of 1923, the Ellis Ranch Loop was considered complete except for the\nfour-mile segment between Tejano Road and Ellis Ranch Road and, oddly enough,\nthe reworking of the road from Placitas to Ellis Ranch---the very one that had\nbeen completed in 1922. Road construction in the mountains was a fight against\nboth funding and nature. The road seems to have been minimally improved, to\nkeep the fast schedule and tight budget. During winter, snowfall and then\nsnowmelt would wash parts of the road out. Throughout the 1920s and 1930s, the\nroad was constantly being repaired and reworked. This probably explains why\nNM-165, once the principle route up the Sandias, is now so minimally\nmaintained: the state and the Forest Service gave up.</p>\n<p>During 1924, the Forest Service closed two miles of the gap and had the other\ntwo underway. In a turn of luck for the Albuquerque boosters, the Forest Service\nalso offered to pick up work on the road to Placitas. The entire Ellis Ranch Loop\nproject had become a Forest Service initiative, and they did what they set out to\ndo.</p>\n<p>In September 24th of 1924, an Albuquerque man named Arthur Ford set out through\nTijeras Canyon with a friend, Mrs. Karskadon. They left Albuquerque at 10 am,\nfinding that the new section connecting Ellis Ranch was not, officially, open;\nFord was little discouraged and simply moved the barriers aside. At 11:45 they\nreached Ellis Ranch. After lunch, they continued northwards, to Placitas,\nthrough Bernalillo, and back into town. Ford's odometer measured the trip at\n68 miles. The Ellis Ranch Loop was complete.</p>\n<blockquote>\n<p>Imagine a circle approximately 20 miles in diameter.</p>\n<p>Then imagine that this circle encloses some of the most beautiful mountain,\nvalley, and mesa scenery in the world.</p>\n</blockquote>\n<p>The city has always existed in tension with the mountains. The Ellis Family,\nwho most famously opened the mountain to visitors, also oversaw a sort of\nclosure to nature. George Ellis was the last person to see a Grizzly Bear in\nthe Sandias. He came across the bear in 1905; he shot it.</p>\n<p>From 1916 to 1924, Albuquerque business leaders admired the mountains for their\nbeauty but lamented their inaccessibility. The Sandias could attract visitors\nfrom around the nation, they argued, if only you could get to them. Charlotte\nEllis would hoof it on foot and on skis, but, then, she was Charlotte.</p>\n<blockquote>\n<p>Then imagine that this circle is bounded by a highway that is traversible\nevery day in the year.</p>\n<p>Imagine, within the 70-mile circumference of this circle, near its eastern\nrim, a cluster of summer houses, supplied with water, light, and other\nnecessaries. Imagine, at various spots within the circle, fine picnic and\ncamping grounds, where people from the hot city may go for a day's outing.</p>\n</blockquote>\n<p>We have always been driven to climb. As soon as it was possible to drive the\nfull loop, to reach Ellis Ranch on an easy road, to take in the &quot;Million\nDollar Playground&quot; of the Sandias, the Kiwanis Club formed a committee of\nbusiness leaders and Forest Service representatives to consider the future of\nSandia development.</p>\n<p>It was &quot;not only practicable, but highly necessary,&quot; they said, to take the next\nlogical step. Ellis Ranch, at 7,500 feet, was only halfway from the city to the\ncrest. A road all the way to the top---from Ellis Ranch to the crest---would\ncomplete their vision of the Sandias. &quot;An effort will be made to have work begun\nas soon as possible.&quot;</p>\n<blockquote>\n<p>You may think you are dreaming. And perhaps you are. But some day you will\nwake up and find the dream come true. <sup class=\"footnote-ref\" id=\"fnref-5\"><a href=\"#fn-5\">6</a></sup></p>\n</blockquote>\n<p>The Forest Service cleared six miles of steep, tight switchbacks, from the\nBalsam Glade area just above Ellis Ranch to the crest itself, over 10,500 feet.\nThe New Mexico Highway Department, bolstered by the completion of Route 66, laid\na gravel roadbed. Automobiles had become more common, driving a more popular\npastime. It didn't take the adventurous Arthur Ford and Mrs. Karskadon to\ninaugurate the crest spur. On October 10th, 1927, Highway Department officials\nat the crest counted 110 cars.</p>\n<p>Albuquerque had summited the mountain---but the greatest controversy was still\nto come.</p>\n<div class=\"footnotes\">\n<ol>\n<li id=\"fn-1\">\n<p><em>Albuquerque Journal</em>, 1916-08-04 p 6<a class=\"footnote\" href=\"#fnref-1\">&#8617;</a></p></li>\n<li id=\"fn-6\">\n<p>An alert reader has provided a few counterexamples of earlier photos of\nwomen skiing, from Norway. In retrospect this makes a lot of sense given the\nlonger history of skiing in that region, but it's still notable that these\nphotos are only a few years earlier. I wish I could find more context on the\nphoto of Charlotte skiing as taking such a photo on location would have been\nquite the hassle at the time and there are few photos of skiing in general.\nAother notable example from New Mexico, taken a few years later, shows a Taos\nPueblo man who is said to have delivered mail to a mining camp on skis.\nUnfortunately his name, and in general all of the details, have been lost.<a class=\"footnote\" href=\"#fnref-6\">&#8617;</a></p></li>\n<li id=\"fn-2\">\n<p><em>Albuquerque Tribune</em>, 1916-03-23 p 3<a class=\"footnote\" href=\"#fnref-2\">&#8617;</a></p></li>\n<li id=\"fn-3\">\n<p>The names of the towns at this location are a bit confusing historically,\nso I am simply using San Antonito to refer to the spot that is currently occupied\nby Sandia Park and San Antonito. Sandia Park appears to be a renaming of a town\nthat was originally called San Antonio (i.e. the big one), likely due to the\npresence of another San Antonio, New Mexico in Socorro County.<a class=\"footnote\" href=\"#fnref-3\">&#8617;</a></p></li>\n<li id=\"fn-4\">\n<p><em>Albuquerque Journal</em>, 1923-08-11 p 10<a class=\"footnote\" href=\"#fnref-4\">&#8617;</a></p></li>\n<li id=\"fn-5\">\n<p><em>Albuquerque Journal</em>, 1923-07-22 p 3<a class=\"footnote\" href=\"#fnref-5\">&#8617;</a></p></li>\n</ol>\n</div>",
  "id": "https://computer.rip/2025-09-28-the-ascent-to-sandia-crest-part-1.html"
}