{
  "title": "Intel 9 285K on ASUS Z890: not stable!",
  "link": "https://michael.stapelberg.ch/posts/2025-03-19-intel-core-ultra-9-285k-on-asus-z890-not-stable/",
  "published": "2025-03-19T17:35:38+01:00",
  "summary": "<aside class=\"admonition note\">\n  <div class=\"note-container\">\n    <div class=\"note-icon\" style=\"width: 20px; height: 20px;\">\n      <svg height=\"100%\" id=\"exclamation-icon\" version=\"1.1\" viewBox=\"0 0 24 24\" width=\"100%\" xml:space=\"preserve\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">\n    <path d=\"M0,0L24,0L24,24L0,24L0,0Z\">\n    <g transform=\"matrix(1.2,0,0,1.2,-2.4,-2.4)\">\n        <path d=\"M12,2C6.48,2 2,6.48 2,12C2,17.52 6.48,22 12,22C17.52,22 22,17.52 22,12C22,6.48 17.52,2 12,2ZM13,17L11,17L11,15L13,15L13,17ZM13,13L11,13L11,7L13,7L13,13Z\">\n    </g>\n</svg>\n\n    </div>\n    <div class=\"admonition-content\"><strong>Update (2025-05-15):</strong> Turns out the CPU was faulty! See <a href=\"/posts/2025-05-15-my-2025-high-end-linux-pc/\">My 2025 high-end\nLinux PC</a> for a new article on\nthis build, now with a working CPU.</div>\n  </div>\n</aside>\n\n<aside class=\"admonition note\">\n  <div class=\"note-container\">\n    <div class=\"note-icon\" style=\"width: 20px; height: 20px;\">\n      <svg height=\"100%\" id=\"exclamation-icon\" version=\"1.1\" viewBox=\"0 0 24 24\" width=\"100%\" xml:space=\"preserve\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">\n    <path d=\"M0,0L24,0L24,24L0,24L0,0Z\">\n    <g transform=\"matrix(1.2,0,0,1.2,-2.4,-2.4)\">\n        <path d=\"M12,2C6.48,2 2,6.48 2,12C2,17.52 6.48,22 12,22C17.52,22 22,17.52 22,12C22,6.48 17.52,2 12,2ZM13,17L11,17L11,15L13,15L13,17ZM13,13L11,13L11,7L13,7L13,13Z\">\n    </g>\n</svg>\n\n    </div>\n    <div class=\"admonition-content\"><strong>Update (2025-09-07):</strong> The replacement CPU also died and I have given up on\nIntel. See <a href=\"/posts/2025-09-07-bye-intel-hi-amd-9950x3d/\">Bye Intel, hi AMD!</a> for\nmore details on the AMD 9950X3D.</div>\n  </div>\n</aside>\n\n<p>In January I ordered the components for a new PC and expected that I would\npublish a successor to my <a href=\"/posts/2022-01-15-high-end-linux-pc/\">2022 high-end Linux PC\n🐧</a> article. Instead, I am now sitting on\na PC which regularly encounters crashes of the worst-to-debug kind, so I am\npublishing this article as a warning for others in case you wanted to buy the\nsame hardware.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<a href=\"https://michael.stapelberg.ch/posts/2025-03-19-intel-core-ultra-9-285k-on-asus-z890-not-stable/IMG_4799.jpg\"><img height=\"450\" src=\"https://michael.stapelberg.ch/posts/2025-03-19-intel-core-ultra-9-285k-on-asus-z890-not-stable/IMG_4799_hu_25f81b95203a769b.jpg\" style=\"border: 1px solid #000;\" width=\"600\" /></a>\n\n\n\n<h2 id=\"components\">Components</h2>\n<p>Which components did I pick for this build? Here’s the full list:</p>\n<table>\n  <thead>\n      <tr>\n          <th>Price</th>\n          <th>Type</th>\n          <th>Article</th>\n      </tr>\n  </thead>\n  <tbody>\n      <tr>\n          <td>140 CHF</td>\n          <td>Case</td>\n          <td><a href=\"https://www.digitec.ch/de/s1/product/fractal-define-7-compact-black-solid-atx-matx-mini-itx-pc-gehaeuse-13220301\">Fractal Define 7 Compact Black Solid</a></td>\n      </tr>\n      <tr>\n          <td>155 CHF</td>\n          <td>Power Supply</td>\n          <td><a href=\"https://www.digitec.ch/de/s1/product/corsair-rm850x-850-w-pc-netzteil-47356173?supplier=8560040\">Corsair RM850x</a></td>\n      </tr>\n      <tr>\n          <td>233 CHF</td>\n          <td>Mainboard</td>\n          <td><a href=\"https://www.digitec.ch/de/s1/product/asus-prime-z890-p-lga-1851-intel-z890-atx-mainboard-50252296\">ASUS PRIME Z890-P</a></td>\n      </tr>\n      <tr>\n          <td>620 CHF</td>\n          <td>CPU</td>\n          <td><a href=\"https://www.digitec.ch/de/s1/product/intel-core-ultra-9-285k-lga-1851-370-ghz-24-core-prozessor-49734792\">Intel Core Ultra 9 285k</a></td>\n      </tr>\n      <tr>\n          <td>120 CHF</td>\n          <td>CPU fan</td>\n          <td><a href=\"https://www.digitec.ch/de/s1/product/noctua-nh-d15-g2-168-mm-cpu-kuehler-46985628\">Noctua NH-D15 G2</a></td>\n      </tr>\n      <tr>\n          <td>39 CHF</td>\n          <td>Case fan</td>\n          <td><a href=\"https://www.digitec.ch/de/s1/product/noctua-nf-a14-pwm-140-mm-1-x-pc-luefter-657800?supplier=3204073\">Noctua NF-A14 PWM (140 mm)</a></td>\n      </tr>\n      <tr>\n          <td>209 CHF</td>\n          <td>RAM</td>\n          <td><a href=\"https://www.digitec.ch/de/s1/product/corsair-vengeance-2-x-32gb-6400-mhz-ddr5-ram-dimm-ram-24473300\">64 GB DDR5-6400 Corsair Vengeance (2 x 32GB)</a></td>\n      </tr>\n      <tr>\n          <td>280 CHF</td>\n          <td>Disk</td>\n          <td><a href=\"https://www.digitec.ch/de/s1/product/samsung-990-pro-4000-gb-m2-2280-ssd-37073751?supplier=406802\">4000 GB Samsung 990 Pro</a></td>\n      </tr>\n      <tr>\n          <td>940 CHF</td>\n          <td>GPU</td>\n          <td><a href=\"https://www.digitec.ch/de/s1/product/inno3d-geforce-rtx-4070-ti-x3-oc-12-gb-gddr6x-1-x-hdmi-3-x-dp-12-gb-grafikkarte-23664346?supplier=406802\">Inno3D GeForce RTX4070 Ti</a></td>\n      </tr>\n  </tbody>\n</table>\n<p>Total: ≈1800 CHF, excluding the Graphics Card I re-used from a previous build.</p>\n<p>…and the next couple of sections go into detail on how I selected these components.</p>\n<h3 id=\"case\">Case</h3>\n<p>I have been a fan of Fractal cases for a couple of generations. In particular, I\nrealized that the “Compact” series offers plenty of space even for large\ngraphics cards and CPU coolers, so that’s now my go-to case: the Fractal Define\n7 Compact (Black Solid).</p>\n<p>I really like building components into the case and working with the case. There\nare no sharp edges, the mechanisms are a pleasure to use and the\ncable-management is well thought-out.</p>\n<p>The only thing that wasn’t top-notch is that Fractal ships the case screws in\nsealed plastic packages that you need to cut open. I would have wished for a\nre-sealable plastic baggie so that one can keep the unused screws instead of\nlosing them.</p>\n<h3 id=\"power-supply\">Power Supply</h3>\n<p>I wanted to keep my options open regarding upgrading to an nVidia 50xx series\ngraphics card at a later point. Those models have a TGP (“Total Graphics Power”)\nof 575 watts, so I needed a power supply that delivers enough power for the\nwhole system even at peak power usage in all dimensions.</p>\n<p>I ended up selecting the Corsair RM850x, which <a href=\"https://www.tomshardware.com/reviews/corsair-rm850x-2021-power-supply-review\">reviews favoribly (“leader in\nthe 850W gold\ncategory”)</a>\nand was available at my electronics store of choice.</p>\n<p>This was a good choice: the PSU indeed runs quiet, and I really like the power\ncables (e.g. the GPU cable) that they include: they are very flexible, which\nmakes them easy to cable-manage.</p>\n<h3 id=\"ssd-disk\">SSD disk</h3>\n<p>I have been avoiding PCIe 5 SSDs so far because they consume a lot more power\ncompared to PCIe 4 SSDs. While bulk streaming data transfer rates are higher on\nPCIe 5 SSDs, random transfers are not significantly faster. Most of my compute\nworkload are random transfers, not large bulk transfers.</p>\n<p>The power draw situation with PCIe 5 SSDs seems to be getting better lately,\nwith the Phison E31T being the first controller that implements power saving. A\ndisk that uses the E31T controller is the Corsair Force Series MP700\nElite. Unfortunately, said disk was unavailable when I ordered.</p>\n<p>Instead, I picked the Samsung 990 Pro with 4 TB. I made good experiences with\nthe Samsung Pro series over the years (never had one die or degrade\nperformance), and my previous 2 TB disk is starting to fill up, so the extra\nstorage space is appreciated.</p>\n<h3 id=\"mainboard\">Mainboard</h3>\n<p>One annoying realization is that most mainboard vendors seem to have moved to\n2.5 GbE (= 2.5 Gbit/s ethernet) onboard network cards. I would have been\nperfectly happy to play it safe and buy another Intel I225 1 GbE network card,\nas long as it <em>just works</em> with Linux.</p>\n<p>In the 2.5 GbE space, the main players seem to be Realtek and Intel. Most\nmainboard vendors opted for Realtek as far as I could see.</p>\n<p>Linux includes the <code>r8169</code> driver for Realtek network cards, but you need a\nrecent-enough Linux version (6.13+) that includes commit “<a href=\"https://github.com/torvalds/linux/commit/f75d1fbe7809bc5ed134204b920fd9e2fc5db1df\">r8169: add support\nfor\nRTL8125D</a>”,\naccompanied by a recent-enough linux-firmware package. Even then, there is some\nconcern around stability and ASPM support. See for example <a href=\"https://serverfault.com/a/1169558\">this ServerFault\npost</a> by someone working on the <code>r8169</code>\ndriver.</p>\n<p>Despite the Intel 1 GbE options being well-supported at this point, Intel’s 2.5\nGbE options might not fare any better than the Realtek ones: I found <a href=\"https://www.reddit.com/r/HomeServer/comments/1cc0yuq/are_intel_25_gbe_nics_i225v_i226v_stable_now/\">reports of\ninstability with Intel’s 2.5 GbE network\ncards</a>.</p>\n<p>Aside from the network cards, I decided to stick to the ASUS prime series of\nmainboards, as I made good experiences with those in my past few builds. Here\nare a couple of thoughts on the ASUS PRIME Z890-P mainboard I went with:</p>\n<ul>\n<li>I like the quick-release PCIe mechanism: ASUS understood that people had\ntrouble unlocking large graphics cards from their PCIe slot, so they added a\nlever-like mechanism that is easily reachable. In my couple of usages, this\nworked pretty well!</li>\n<li>I wrote about <a href=\"/posts/2022-01-15-high-end-linux-pc/#slow-boot\">slow boot times with my 2022 PC\nbuild</a> that were caused by\ntime-consuming memory training. On this ASUS board, I noticed that they blink\nthe Power LED to signal that memory training is in progress. Very nice! It\nhadn’t occurred to me previously that the various phases of the boot could be\nsignaled by different Power LED blinking patterns :)\n<ul>\n<li>The downside of this feature is: While the machine is in suspend-to-RAM, the\nPower LED also blinks! This is annoying, so I might just disconnect the\nPower LED entirely.</li>\n</ul>\n</li>\n<li>The UEFI firmware includes what they call a Q-Dashboard: An overview of what\nis installed/connected in which slot. Quite nice:</li>\n</ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<a href=\"https://michael.stapelberg.ch/posts/2025-03-19-intel-core-ultra-9-285k-on-asus-z890-not-stable/IMG_4809.jpg\"><img height=\"357\" src=\"https://michael.stapelberg.ch/posts/2025-03-19-intel-core-ultra-9-285k-on-asus-z890-not-stable/IMG_4809_hu_2bc1c1ff7fd21242.jpg\" style=\"border: 1px solid #000;\" width=\"600\" /></a>\n\n\n\n<h3 id=\"cpu-fan\">CPU fan</h3>\n<p>I am a long-time fan of Noctua’s products: This company makes silent fans with\ngreat cooling capacity that work reliably! For many years, I have swapped out\nevery of my PC’s fans with Noctua fans, and it was always an upgrade. Highly\nrecommended.</p>\n<p>Hence, it is no question that I picked the latest and greatest Noctua CPU cooler\nfor this build: the Noctua NH-D15 G2. There are a couple of things to pay\nattention to with this cooler:</p>\n<ul>\n<li>I decided to configure it with one fan instead of two fans: Using only one fan\nwill be the quietest setup, yet still have plenty of cooling capacity for this\nsetup.</li>\n<li>There are 3 different versions that differ in how their base plate is\nshaped. Noctua recommends: “For LGA1851, we generally recommend the regular\nstandard version with medium base convexity”\n(<a href=\"https://noctua.at/en/intel-lga1851-all-you-need-to-know\">https://noctua.at/en/intel-lga1851-all-you-need-to-know</a>)</li>\n<li>The height of this cooler is 168 mm. This fits well into the Fractal Define 7\nCompact Black.</li>\n</ul>\n<h3 id=\"cpu\">CPU</h3>\n<p>Probably the point that raises most questions about this build is why I selected\nan Intel CPU over an AMD CPU. The primary reason is that Intel CPUs are so much\nbetter at power saving!</p>\n<p>Let me explain: Most benchmarks online are for gamers and hence measure a usage\ncurve that goes “start game, run PC at 100% resources for hours”. Of course,\nwhen you never let the machine idle, you would care about <em>power efficiency</em>:\nhow much power do you need to use to achive the desired result?</p>\n<p>My use-case is software development, not gaming. My usage curve oscillates\nbetween “barely any usage because Michael is reading text” to “complete this\ncompilation as quickly as possible with all the power available”. For me, I need\nboth absolute power consumption at idle, and absolute performance to be\nbest-of-class.</p>\n<p>AMD’s CPUs offer great performance (the recently released <a href=\"https://www.phoronix.com/review/amd-ryzen-9-9950x3d-linux\">Ryzen 9 9950X3D is\neven faster</a> than the\nIntel 9 285K), and have great <em>power efficiency</em>, but poor <em>power consumption</em>\nat idle: With ≈35W of idle power draw, Zen 5 CPUs consume ≈3x as much power as\nIntel CPUs!</p>\n<p>Intel’s CPUs offer great performance (like AMD), but excellent power consumption\nat idle.</p>\n<p>Therefore, I can’t in good conscience buy an AMD CPU, but if you want a fast\ngaming-only PC or run an always-loaded HPC cluster with those CPUs, definitely\ngo ahead :)</p>\n<h3 id=\"graphics-card\">Graphics card</h3>\n<p>I don’t necessarily recommend any particular nVidia graphics card, but I have\nhad to stick to nVidia cards because they are the only option that work with my\npicky <a href=\"/posts/2017-12-11-dell-up3218k/\">Dell UP3218K monitor</a>.</p>\n<p>From time to time, I try out different graphics cards. Recently, I got myself an\nAMD Radeon RX 9070 because I read that it works well with open source drivers.</p>\n<p>While the Radeon RX 9070 works with my monitor (great!), it seems to consume 45W\nin idle, which is much higher than my nVidia cards, which idle at ≈ 20W. This is\nunacceptable to me: Aside from high power costs and wasting precious resources,\nthe high power draw also means that my room will be hotter in summer and the\nfans need to spin faster and therefore louder.</p>\n<p>Maybe I’ll write a separate article about the Radeon RX 9070.</p>\n<h2 id=\"installation\">Installation</h2>\n<h3 id=\"uefi-setup\">UEFI setup</h3>\n<p>On the internet, I read that there was some issue related to the Power Limits\nthat mainboards come with by default. Therefore, I did a <a href=\"https://www.asus.com/motherboards-components/motherboards/prime/prime-z890-p/helpdesk_bios?model2Name=PRIME-Z890-P\">UEFI firmware\nupdate</a>\nfirst thing after getting the mainboard. I upgraded to version 1404 (2025/01/10)\nusing the provided ZIP file (<code>PRIME-Z890-P-ASUS-1404.zip</code>) on an MS-DOS\nFAT-formatted USB stick with the EZ Flash tool in the UEFI firmware\ninterface. Tip: do not extract the ZIP file, otherwise the EZ Flash tool cannot\nupdate the Intel ME firmware. Just put the ZIP file onto the USB disk as-is.</p>\n<p>I verified that with this UEFI version, the <code>Power Limit 1 (PL1)</code> is 250W, and\n<code>ICCMAX=347A</code>, which are exactly the values that Intel recommends. Great!</p>\n<p>I also enabled XMP and verified that memtest86 reported no errors.</p>\n<h3 id=\"software-setup-early-adopter-pains\">Software setup: early adopter pains</h3>\n<p>To copy over the data from the old disk to the new disk, I wanted to boot a live\nlinux distribution (specifically, <a href=\"https://grml.org/\">grml.org</a>) and follow my\nusual procedure: boot with the old disk and the new (empty) disk, then use <code>dd</code>\nto copy the data. It’s nice and simple, hard to screw up.</p>\n<p>Unfortunately, while grml 2024.12 technically does boot up, there are two big\nproblems:</p>\n<ol>\n<li>\n<p>There is no network connectivity because the kernel and linux-firmware\nversions are too old.</p>\n<ul>\n<li><a href=\"https://github.com/torvalds/linux/commit/f75d1fbe7809bc5ed134204b920fd9e2fc5db1df\">r8169: add support for RTL8125D</a></li>\n</ul>\n</li>\n<li>\n<p>I could not get Xorg to work at all. Not with the Intel integrated GPU, nor\nwith the nVidia dedicated GPU. Not with <code>nomodeset</code> or any of the other\noptions in the grml menu. This wasn’t merely a convenience problem: I needed\nto use <code>gparted</code> (the graphical version) for its partition moving/resizing\nsupport.</p>\n</li>\n</ol>\n<p>Ultimately, it was easier to upgrade my old PC to Linux 6.13 and linux-firmware\n20250109, then put in the new disk and copy over the installation.</p>\n<h2 id=\"stability-issues\">Stability issues</h2>\n<p>At this point (early February), I switched to this new machine as my main PC.</p>\n<p>Unfortunately, I could never get it to run stable! This journal shows you some\nof the issues I faced and what I tried to troubleshoot them.</p>\n<h3 id=\"xorg-dying-after-resume-from-suspend\">Xorg dying after resume-from-suspend</h3>\n<p>One of the first issues I encountered with this system was that after resuming\nfrom suspend-to-RAM, I was greeted with a login window instead of my X11\nsession. The logs say:</p>\n<pre tabindex=\"0\"><code>(EE) NVIDIA(GPU-0): Failed to acquire modesetting permission.\n(EE) Fatal server error:\n(EE) EnterVT failed for screen 0\n(EE) \n(EE) \n(EE) Please also check the log file at \"/var/log/Xorg.0.log\" for additional information.\n(EE) \n(WW) NVIDIA(0): Failed to set the display configuration\n(WW) NVIDIA(0):  - Setting a mode on head 0 failed: Insufficient permissions\n(WW) NVIDIA(0):  - Setting a mode on head 1 failed: Insufficient permissions\n(WW) NVIDIA(0):  - Setting a mode on head 2 failed: Insufficient permissions\n(WW) NVIDIA(0):  - Setting a mode on head 3 failed: Insufficient permissions\n(EE) Server terminated with error (1). Closing log file.\n</code></pre><p>I couldn’t find any good tips online for this error message, so I figured I’d\nwait and see how frequently this happens before investigating further.</p>\n<h3 id=\"feb-18-xhci-host-controller-dying\">Feb 18: xHCI host controller dying</h3>\n<p>On Feb 18th, after resume-from-suspend, none of my USB peripherals would work\nanymore! This affected <em>all USB ports</em> of the machine and could not be fixed,\nnot even by a reboot, until I fully killed power to the machine! In the kernel\nlog, I saw the following messages:</p>\n<pre tabindex=\"0\"><code>xhci_hcd 0000:80:14.0: xHCI host not responding to stop endpoint command\nxhci_hcd 0000:80:14.0: xHCI host controller not responding, assume dead\nxhci_hcd 0000:80:14.0: HC died; cleaning up\n</code></pre><h3 id=\"feb-24-xhci-host-controller-dying\">Feb 24: xHCI host controller dying</h3>\n<p>The HC dying issue happened again when I was writing an SD card in my USB card\nreader:</p>\n<pre tabindex=\"0\"><code>xhci_hcd 0000:80:14.0: HC died; cleaning up\n</code></pre><h3 id=\"feb-24--uefi-update-disable-xmpp\">Feb 24: → UEFI update, disable XMPP</h3>\n<p>To try and fix the host controller dying issue, I updated the UEFI firmware to\nversion <code>1601</code> and disabled the XMPP RAM profile.</p>\n<h3 id=\"feb-26--switch-back-from-geforce-4070-ti-to-3060-ti\">Feb 26: → switch back from GeForce 4070 Ti to 3060 Ti</h3>\n<p>To rule out any GPU-specific issues, I decided to switch back from the Inno3D\nGeForce RTX4070 Ti to my older MSI GeForce RTX 3060 Ti.</p>\n<h3 id=\"feb-28-pc-dying-on-suspend-to-ram\">Feb 28: PC dying on suspend-to-RAM</h3>\n<p>On Feb 28th, my PC did not resume from suspend-to-RAM. It would not even react\nto a ping, I had to hard-reset the machine. When checking the syslog afterwards,\nthere are no entries.</p>\n<p>I checked my power monitoring and saw that the machine consumed 50W (well above\nidle power, and far above suspend-to-RAM power) throughout the entire\nnight. Hence, I suspect that the suspend-to-RAM did not work correctly and the\nmachine never actually suspended.</p>\n<h3 id=\"mar-4th-pc-dying-when-running-django-tests\">Mar 4th: PC dying when running django tests</h3>\n<p>On March 4th, I was running the test suite for a medium-sized Django project (=\n100% CPU usage) when I encountered a really hard crash: The machine stopped\nworking entirely, meaning all peripherals like keyboard and mouse stopped\nresponding, and the machine even did not respond to a network ping anymore.</p>\n<p>At this point, I had enough and switched back to my 2022 PC.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>What use is a computer that doesn’t work? My hierarchy of needs contains\nstability as the foundation, then speed and convenience. This machine exhausted\nmy tolerance for frustration with its frequent crashes.</p>\n<p>Manawyrm <a href=\"https://chaos.social/@manawyrm/113772325172878092\">actually warned me about the ASUS board</a>:</p>\n<blockquote>\n<p>ASUS boards are a typical gamble as always &ndash; they fired their firmware\nengineers about 10 years ago, so you might get a nightmare of ACPI\ntroubleshooting hell now (or it&rsquo;ll just work). ASRock is worth a look as a\nreplacement if that happens. Electronics are usually solid, though&hellip;</p>\n</blockquote>\n<p>I didn’t expect that this PC would crash so hard, though. Like, if it couldn’t\nsuspend/resume that would be one thing (a dealbreaker, but somewhat expected and\nunderstandable, probably fixable), but a machine that runs into a hard-lockup\nwhen compiling/testing software? No thanks.</p>\n<p>I will buy a different mainboard to see if that helps, likely the ASRock Z890\nPro-A. If you have any recommendations for a Z890 mainboard that actually works\nreliably, please let me know!</p>\n<p><strong>Update 2025-04-17:</strong> I have received the ASRock Z890 Pro-A, but the machine\nshows exactly the same symptoms! I also swapped the power supply, which also did\nnot help. Running Prime95 crashed almost immediately. At this point, I have to\nassume the CPU itself is defective and have started an RMA. I will post another\nupdate once (if?) I get a replaced CPU.</p>\n<p><strong>Update 2025-05-11:</strong> The CPU was faulty indeed! See <a href=\"/posts/2025-05-15-my-2025-high-end-linux-pc/\">My 2025 high-end Linux\nPC</a> for a new article on this\nbuild, now with a working CPU.</p>",
  "id": "https://michael.stapelberg.ch/posts/2025-03-19-intel-core-ultra-9-285k-on-asus-z890-not-stable/"
}