{
  "title": "6 years of commit visualized",
  "link": "http://antirez.com/news/98",
  "published": "Fri, 20 Nov 2015 11:58:34 +0100",
  "summary": "Today I was curious about plotting all the Redis commits we have on Git, which are 90% of all the Redis commits. There was just an initial period where I used SVN but switched very soon.\n<br />\n<br />Full size image here: http://antirez.com/misc/commitsvis.png\n<br />\n<br />!~!<img height=\"284\" src=\"http://antirez.com/misc/commitsvis.png\" width=\"777\" />\n<br />\n<br />Each commit is a rectangle. The height is the number of affected lines (a logarithmic scale is used). The gray labels show release tags.\n<br />\n<br />There are little surprises since the amount of commit remained pretty much the same over the time, however now that we no longer backport features back into 3.0 and future releases, the rate at which new patchlevel versions are released diminished.\n<br />\n<br />Major releases look more or less evenly spaced between 2.6, 2.8 and 3.0, but were more frequent initially, something that should change soon as we are trying to switch to time-driven releases with 3 new major release each year (that obviously will contain less new things compared to the amount of stuff was present in major releases that took one whole year).\n<br />For example 3.2 RC is due for December 2015.\n<br />\n<br />Patch releases of a given major release tend to have a logarithmic curve shape. As a release mature, in general it gets less critical bugs. Also attention shifts progressively to the new release.\n<br />\n<br />I would love Github to give us stuff like that and much more. There is a lot of data in commits of a project that is there for years. This data should be analyzed and explored... it's a shame that the graphics section is apparently the same thing for years.\n<br />\n<br />EDIT: The Tcl script used to generate this graph is here: https://github.com/antirez/redis/tree/unstable/utils/graphs/commits-over-time\n<a href=\"http://antirez.com/news/98\">Comments</a>",
  "id": "http://antirez.com/news/98"
}