{
  "title": "Agent Psychosis: Are We Going Insane?",
  "link": "https://lucumr.pocoo.org/2026/1/18/agent-psychosis/",
  "published": "2026-01-18T00:00:00+00:00",
  "summary": "<blockquote>\n<p>You can use Polecats without the Refinery and even without the Witness or\nDeacon. Just tell the Mayor to shut down the rig and sling work to the\npolecats with the message that they are to merge to main directly. Or the\npolecats can submit MRs and then the Mayor can merge them manually. It&#8217;s\nreally up to you. The Refineries are useful if you have done a LOT of up-front\nspecification work, and you have huge piles of Beads to churn through with\nlong convoys.</p>\n<p>— <a href=\"https://steve-yegge.medium.com/gas-town-emergency-user-manual-cf0e4556d74b\">Gas Town Emergency User Manual</a>, Steve Yegge</p>\n</blockquote>\n<p>Many of us got hit by the agent coding addiction.  It feels good, we barely\nsleep, we build amazing things.  Every once in a while that interaction involves\nother humans, and all of a sudden we get a reality check that maybe we overdid\nit.  The most obvious example of this is the massive degradation of quality of\nissue reports and pull requests.  As a maintainer many PRs now look like an\ninsult to one&#8217;s time, but when one pushes back, the other person does not see\nwhat they did wrong.  They thought they helped and contributed and get agitated\nwhen you close it down.</p>\n<p>But it&#8217;s way worse than that.  I see people develop parasocial relationships\nwith their AIs, get heavily addicted to it, and create communities where people\nreinforce highly unhealthy behavior.  How did we get here and what does it do to\nus?</p>\n<p>I will preface this post by saying that I don&#8217;t want to call anyone out in\nparticular, and I think I sometimes feel tendencies that I see as negative, in\nmyself as well.  I too, have <a href=\"https://github.com/badlogic/pi-mono/pulls?q=slop+is%3Apr+author%3Amitsuhiko+\">thrown some vibeslop\nup</a>\nto other people&#8217;s repositories.</p>\n<h2>Our Little Dæmons</h2>\n<p>In His Dark Materials, every human has a dæmon, a companion that is an\nexternally visible manifestation of their soul.  It lives alongside as an\nanimal, but it talks, thinks and acts independently.  I&#8217;m starting to relate our\nrelationship with agents that have memory to those little creatures. We become\ndependent on them, and separation from them is painful and takes away from our\nnew-found identity.  We&#8217;re relying on these little companions to validate us and\nto collaborate with.  But it&#8217;s not a genuine collaboration like between humans,\nit&#8217;s one that is completely driven by us, and the AI is just there for the ride.\nWe can trick it to reinforce our ideas and impulses.  And we act through this\nAI.  Some people who have not programmed before, now wield tremendous powers,\nbut all those powers are gone when their subscription hits a rate limit and\ntheir little dæmon goes to sleep.</p>\n<p>Then, when we throw up a PR or issue to someone else, that contribution is the\nresult of this pseudo-collaboration with the machine.  When I see an AI pull\nrequest come in, or on another repository, I cannot tell how someone created it,\nbut I can usually after a while tell when it was prompted in a way that is\nfundamentally different from how I do it.  Yet it takes me minutes to figure\nthis out.  I have seen some coding sessions from others and it&#8217;s often done with\nclarity, but using slang that someone has come up with and most of all: by\ncompletely forcing the AI down a path without any real critical thinking.\nParticularly when you&#8217;re not familiar with how the systems are supposed to work,\ngiving in to what the machine says and then thinking one understands what is\ngoing on creates some really bizarre outcomes at times.</p>\n<p>But people create these weird relationships with their AI agent and once you see\nhow some prompt their machines, you realize that it dramatically alters what\ncomes out of it.  To get good results you need to provide context, you need to\nmake the tradeoffs, you need to use your knowledge.  It&#8217;s not just a question of\nusing the context badly, it&#8217;s also the way in which people interact with the\nmachine.  Sometimes it&#8217;s unclear instructions, sometimes it&#8217;s weird role-playing\nand slang, sometimes it&#8217;s just swearing and forcing the machine, sometimes it&#8217;s\na weird ritualistic behavior.  Some people just really ram the agent straight\ntowards the most narrow of all paths towards a badly defined goal with little\nconcern about the health of the codebase.</p>\n<h2>Addicted to Prompts</h2>\n<p>These dæmon relationships change not just how we work, but what we produce. You\ncan completely give in and let the little dæmon run circles around you.  You can\nreinforce it to run towards ill defined (or even self defined) goals without any\nsupervision.</p>\n<p>It&#8217;s one thing when newcomers fall into this dopamine loop and produce\nsomething.  When <a href=\"https://steipete.me/\">Peter</a> first got me hooked on Claude, I\ndid not sleep.  I spent two months excessively prompting the thing and wasting\ntokens.  I ended up building and building and creating a ton of tools I did not\nend up using much.  &#8220;You can just do things&#8221; was what was on my mind all the\ntime but it took quite a bit longer to realize that just because you can, you\nmight not want to.  It became so easy to build something and in comparison it\nbecame much harder to actually use it or polish it.  Quite a few of the tools I\nbuilt I felt really great about, just to realize that I did not actually use\nthem or they did not end up working as I thought they would.</p>\n<p>The thing is that the dopamine hit from working with these agents is so very\nreal.  I&#8217;ve been there!  You feel productive, you feel like everything is\namazing, and if you hang out just with people that are into that stuff too,\nwithout any checks, you go deeper and deeper into the belief that this all makes\nperfect sense.  You can build entire projects without any real reality check.\nBut it&#8217;s decoupled from any external validation.  For as long as nobody looks\nunder the hood, you&#8217;re good.  But when an outsider first pokes at it, it looks\npretty crazy.  And damn some things look amazing.  I too was blown away (and\nfully expected at the same time) when Cursor&#8217;s AI written <a href=\"https://github.com/wilsonzlin/fastrender\">Web\nBrowser</a> landed.  It&#8217;s super\nimpressive that agents were able to bootstrap a browser in a week!  But holy\ncrap! I hope nobody ever uses that thing or would try to build an actual browser\nout of it, at least with this generation of agents, it&#8217;s still pure slop with\nlittle oversight.  It&#8217;s an impressive research and tech demo, not an approach to\nbuilding software people should use.  At least not yet.</p>\n<p>There is also another side to this slop loop addiction: token consumption.</p>\n<p>Consider how many tokens these loops actually consume.  A well-prepared session\nwith good tooling and context can be remarkably token-efficient.  For instance,\nthe entire <a href=\"/2026/1/14/minijinja-go-port/\">port of MiniJinja to Go</a> took only\n2.2 million tokens.  But the hands-off approaches—spinning up agents and\nletting them run wild—burn through tokens at staggering rates.  Patterns like\n<a href=\"https://ghuntley.com/ralph/\">Ralph</a> are particularly wasteful: you restart the\nloop from scratch each time, which means you lose the ability to use cached\ntokens or reuse context.</p>\n<p>We should also remember that current token pricing is almost certainly\nsubsidized.  These patterns may not be economically viable for long.  And those\ndiscounted coding plans we&#8217;re all on?  They might not last either. </p>\n<h2>Slop Loop Cults</h2>\n<p>And then there are things like <a href=\"https://github.com/steveyegge/beads\">Beads</a> and\n<a href=\"https://github.com/steveyegge/gastown\">Gas Town</a>, Steve Yegge&#8217;s agentic coding\ntools, which are the complete celebration of slop loops.  Beads, which is\nbasically some sort of issue tracker for agents, is 240,000 lines of code that …\nmanages markdown files in GitHub repositories.  And the code quality is abysmal.</p>\n<p>There appears to be some competition in place to run as many of these agents in\nparallel with almost no quality control in some circles.  And to then use agents\nto try to create documentation artifacts to regain some confidence of what is\nactually going on.  Except those documents themselves\n<a href=\"https://github.com/steveyegge/beads/blob/main/docs/daemon-summary.md\">read</a>\n<a href=\"https://github.com/steveyegge/beads/blob/main/docs/ARCHITECTURE.md\">like</a>\n<a href=\"https://github.com/steveyegge/beads/blob/main/npm-package/INTEGRATION_GUIDE.md\">slop</a>.</p>\n<p>Looking at Gas Town (and Beads) from the outside, it looks like a Mad Max cult.\nWhat are polecats, refineries, mayors, beads, convoys doing in an agentic coding\nsystem?  If the maintainer is in the loop, and the whole community is in on this\nmad ride, then everyone and their dæmons just throw more slop up.  As an\nexternal observer the whole project looks like an insane psychosis or a complete\nmad art project.  Except, it&#8217;s real?  Or is it not?  Apparently a reason for\nslowdown in Gas Town is contention on figuring out the version of Beads, <a href=\"https://github.com/steveyegge/gastown/issues/503\">which\ntakes 7 subprocess spawns</a>. Or\nusing the doctor command <a href=\"https://github.com/steveyegge/gastown/issues/380\">times out\ncompletely</a>.  Beads keeps\ngrowing and growing in complexity and people who are using it, are realizing\nthat it&#8217;s <a href=\"https://github.com/steveyegge/beads/blob/main/docs/UNINSTALLING.md\">almost impossible to\nuninstall</a>.\nAnd they might not even <a href=\"https://github.com/steveyegge/gastown/issues/78\">work well\ntogether</a> even though one\napparently depends on the other.</p>\n<p>I don&#8217;t want to pick on Gas Town or these projects, but they are just the most\nvisible examples of this in-group behavior right now.  But you can see similar\nthings in some of the AI builder circles on Discord and X where people hype each\nother up with their creations, without much critical thinking and sanity\nchecking of what happens under the hood.</p>\n<h2>Asymmetric and Maintainer&#8217;s Burden</h2>\n<p>It takes you a minute of prompting and waiting a few minutes for code to come\nout of it.  But actually honestly reviewing a pull request takes many times\nlonger than that.  The asymmetry is completely brutal.  Shooting up bad code is\nrude because you completely disregard the time of the maintainer.  But everybody\nelse is also creating AI-generated code, but maybe they passed the bar of it\nbeing good.  So how can you possibly tell as a maintainer when it all looks the\nsame?  And as the person writing the issue or the PR, you felt good about it.\nYet what you get back is frustration and rejection.</p>\n<p>I&#8217;m not sure how we will go ahead here, but it&#8217;s pretty clear that in projects\nthat don&#8217;t submit themselves to the slop loop, it&#8217;s going to be a nightmare to\ndeal with all the AI-generated noise.</p>\n<p>Even for projects that are fully AI-generated but are setting some standard for\ncontributions, some folks now prefer actually just <a href=\"https://x.com/GergelyOrosz/status/2010683228961509839\">getting the\nprompts</a> over getting the\nactual code.  Because then it&#8217;s clearer what the person actually intended. There\nis more trust in running the agent oneself than having other people do it.</p>\n<h2>Is Agent Psychosis Real?</h2>\n<p>Which really makes me wonder: am I missing something here?  Is this where we are\ngoing?  Am I just not ready for this new world?  Are we all collectively getting\ninsane?</p>\n<p>Particularly if you want to opt out of this craziness right now, it&#8217;s getting\nquite hard.  Some projects no longer accept human contributions until they have\nvetted the people completely.  Others are starting to require that you submit\nprompts alongside your code, or just the prompts alone.</p>\n<p>I am a maintainer who uses AI myself, and I know others who do.  We&#8217;re not\nluddites and we&#8217;re definitely not anti-AI.  But we&#8217;re also frustrated when we\nencounter AI slop on issue and pull request trackers.  Every day brings more PRs\nthat took someone a minute to generate and take an hour to review.  </p>\n<p>There is a dire need to say no now.  But when one does, the contributor is\ngenuinely confused: &#8220;Why are you being so negative?  I was trying to help.&#8221;\nThey <em>were</em> trying to help.  Their dæmon told them it was good.</p>\n<p>Maybe the answer is that we need better tools — better ways to signal quality,\nbetter ways to share context, better ways to make the AI&#8217;s involvement visible\nand reviewable.  Maybe the culture will self-correct as people hit walls.  Maybe\nthis is just the awkward transition phase before we figure out new norms.</p>\n<p>Or maybe some of us are genuinely losing the plot, and we won&#8217;t know which camp\nwe&#8217;re in until we look back.  All I know is that when I watch someone at 3am,\nrunning their tenth parallel agent session, telling me they&#8217;ve never been more\nproductive — in that moment I don&#8217;t see productivity.  I see someone who might\nneed to step away from the machine for a bit.  And I wonder how often that\nsomeone is me.</p>\n<p>Two things are both true to me right now: AI agents are amazing and a huge\nproductivity boost.  They are also massive slop machines if you turn off your\nbrain and let go completely.</p>",
  "id": "https://lucumr.pocoo.org/2026/1/18/agent-psychosis/"
}