{
  "title": "Defending abuse does not defend free software",
  "link": "https://mjg59.dreamwidth.org/68004.html",
  "published": "Thu, 12 Oct 2023 16:32:49 GMT",
  "summary": "The Free Software Foundation Europe and the Software Freedom Conservancy recently released a <a href=\"https://sfconservancy.org/news/2023/oct/11/joint-statement-fsfe/\">statement</a> that they would no longer work with <a href=\"https://en.wikipedia.org/wiki/Eben_Moglen\">Eben Moglen</a>, chairman of the Software Freedom Law Center. Eben was the general counsel for the Free Software Foundation for over 20 years, and was centrally involved in the development of version 3 of the GNU General Public License. He's devoted a great deal of his life to furthering free software.<br /><br />But, as described in the joint statement, he's also acted abusively towards other members of the free software community. He's acted poorly <a href=\"https://ttabvue.uspto.gov/ttabvue/v/ttabvue-92066968-CAN-109.pdf#page=8\">towards his own staff</a>. In a professional context, he's used <a href=\"https://ttabvue.uspto.gov/ttabvue/v/ttabvue-92066968-CAN-109.pdf#page=51\">graphically violent rhetoric</a> to describe people he dislikes. He's <a href=\"https://ttabvue.uspto.gov/ttabvue/v/ttabvue-92066968-CAN-122.pdf#page=28\">screamed abuse</a> at people attempting to do their job.<br /><br />And, sadly, none of this comes as a surprise to me. As I <a href=\"https://mjg59.dreamwidth.org/49370.html\">wrote in 2017</a>, after it became clear that Eben's opinions diverged sufficiently from the FSF's that he could no longer act as general counsel, he responded by threatening an FSF board member at an FSF-run event (various members of the board were willing to tolerate this, which is what led to me quitting the board). There's over a decade's evidence of Eben engaging in abusive behaviour towards members of the free software community, be they staff, colleagues, or just volunteers trying to make the world a better place.<br /><br />When we build communities that tolerate abuse, we exclude anyone unwilling to tolerate being abused[1]. Nobody in the free software community should be expected to deal with being screamed at or threatened. Nobody should be <a href=\"https://ebb.org/bkuhn/blog/2023/10/11/moglen-sflc.html\">afraid that they're about to have their sexuality outed</a> by a former boss.<br /><br />But of course there are some that will defend Eben based on his past contributions. There were people who were willing to defend Hans Reiser on that basis. We need to be clear that what these people are defending is not free software - it's the right for abusers to abuse. And in the long term, that's bad for free software.<br /><br />[1] \"Why don't people just get better at tolerating abuse?\" is a terrible response to this. Why don't abusers stop abusing? There's fewer of them, and it should be easier.<br /><br /><img alt=\"comment count unavailable\" height=\"12\" src=\"https://www.dreamwidth.org/tools/commentcount?user=mjg59&amp;ditemid=68004\" style=\"vertical-align: middle;\" width=\"30\" /> comments",
  "id": "https://mjg59.dreamwidth.org/68004.html"
}