{
  "title": "Fizz Buzz in CSS",
  "link": "https://susam.net/fizz-buzz-in-css.html",
  "published": "Sat, 06 Dec 2025 00:00:00 +0000",
  "summary": "<p>\n  How many CSS selectors and declarations do we need to produce the\n  Fizz Buzz sequence?  Of course we could do this with no CSS at all\n  simply by placing the entire sequence as text in the HTML body.  So\n  to make the problem precise as well as to keep it interesting, we\n  require that all text that appears in the Fizz Buzz sequence comes\n  directly from the CSS.  Placing any part of the output numbers or\n  words outside the stylesheet is not allowed.  JavaScript is not\n  allowed either.  With these constraints, I think we need at least\n  four CSS selectors along with four declarations to solve this\n  puzzle, as shown below:\n</p>\n<pre><code>li { counter-increment: n }\nli:not(:nth-child(5n))::before { content: counter(n) }\nli:nth-child(3n)::before { content: \"Fizz\" }\nli:nth-child(5n)::after { content: \"Buzz\" }</code></pre>\n<p>\n  Here is a complete working example:\n  <a href=\"css-fizz-buzz.html\">css-fizz-buzz.html</a>.\n</p>\n<p>\n  The above solution contains four CSS rules with one selector and one\n  declaration in each rule.  For example,\n  <code>li { counter-increment: n }</code> is one rule consisting of\n  the selector <code>li</code> and the declaration\n  <code>counter-increment: n</code>.\n</p>\n<p>\n  Seasoned code golfers looking for a challenge can probably shrink\n  this solution further.  A common trick to solve this problem is to\n  use an ordered list (<code>&lt;ol&gt;</code>) which provides the\n  integers in the form of list markers automatically, thereby\n  eliminating the need to maintain a counter in the stylesheet.\n  However, this violates the requirement set out in the introduction.\n  We want every integer to be produced directly by the stylesheet.\n  Treating the integers in the list markers as part of the output\n  sequence breaks this rule.  Not to mention the output looks untidy\n  because of the unnecessary dot after each marker and also because\n  the numbers and words appear misaligned.  See an example of that\n  trick here:\n  <a href=\"code/web/css-fizz-buzz-ol.html\">css-fizz-buzz-ol.html</a>.\n  Correcting the misaligned output calls for extra code that cancels\n  out the number of declarations saved.  In any case, the requirement\n  that all integers of the output must come directly from the\n  stylesheet prevents untidy solutions like this and also forces us to\n  rely on the capabilities of CSS to solve this puzzle.\n</p>\n<p>\n  The intention here was to obtain the smallest possible code in terms\n  of the number of CSS declarations.  This example is not crafted to\n  minimise bytes, but for code golfers who enjoy reducing byte count,\n  here is the number of bytes this solution consumes after removing\n  all whitespace:\n</p>\n<pre><code>$ curl -sS https://susam.net/css-fizz-buzz.html | sed -n '/counter/,/after/p' | tr -d '[:space:]' | wc -c\n152</code></pre>\n<p>\n  Further reduction in byte count can be achieved by using the\n  <code>&lt;p&gt;</code> element instead of <code>&lt;li&gt;</code>,\n  nesting CSS selectors, etc.  I'll leave that as an exercise for the\n  reader.  Returning to the focus of this post as well as to summarise\n  it, the solution here uses four CSS rules consisting of four\n  selectors and four declarations to render the Fizz Buzz sequence.\n</p>\n<!-- ### -->\n<p>\n  <a href=\"https://susam.net/fizz-buzz-in-css.html\">Read on website</a> |\n  <a href=\"https://susam.net/tag/absurd.html\">#absurd</a> |\n  <a href=\"https://susam.net/tag/web.html\">#web</a> |\n  <a href=\"https://susam.net/tag/technology.html\">#technology</a> |\n  <a href=\"https://susam.net/tag/css.html\">#css</a> |\n  <a href=\"https://susam.net/tag/puzzle.html\">#puzzle</a>\n</p>",
  "id": "fzcps"
}