{
  "title": "RuBee",
  "link": "https://computer.rip/2025-11-22-RuBee.html",
  "published": "22 Nov 2025 00:00:00 UT",
  "summary": "<p>I have at least a few readers for which the sound of a man's voice saying\n&quot;government cell phone detected&quot; will elicit a palpable reaction. In\nDepartment of Energy facilities across the country, incidences of employees\naccidentally carrying phones into secure areas are reduced through a sort of\nautomated nagging. A device at the door monitors for the presence of a tag;\nwhen the tag is detected it plays an audio clip. Because this is the government,\nthe device in question is highly specialized, fantastically expensive, and\nsays &quot;government cell phone&quot; even though most of the phones in question are\npersonal devices. Look, they already did the recording, they're not changing\nit now!</p>\n<p>One of the things that I love is weird little wireless networks. Long ago I\nwrote about <a href=\"https://computer.rip/2023-01-02-ANT-plus-is-PAN-for-ants.html\">ANT+</a>,\nfor example, a failed personal area network standard designed mostly around\nfitness applications. There's tons of these, and they have a lot of\nsimilarities---so it's fun to think about the protocols that went down a\ncompletely different path. It's even better, of course, if the protocol is\nobscure outside of an important niche. And a terrible website, too? What more\ncould I ask for.</p>\n<p>The DoE's cell-phone nagging boxes, and an array of related but more critical\napplications, rely on an unusual personal area networking protocol called RuBee.</p>\n<p>RuBee is a product of Visible Assets Inc., or VAI, founded in 2004 <sup class=\"footnote-ref\" id=\"fnref-1\"><a href=\"#fn-1\">1</a></sup> by John K.\nStevens. Stevens seems a somewhat improbable founder, with a background in\nbiophysics and eye health, but he's a repeat entrepreneur. He's particularly fond of companies\ncalled Visible: he founded Visible Assets after his successful tenure as CEO of\nVisible Genetics. Visible Genetics was an early innovator in DNA sequencing, and\nstill provides a specialty laboratory service that sequences samples of HIV in\norder to detect vulnerabilities to antiretroviral medications.</p>\n<p>Clinical trials in the early 2000s exposed Visible Genetics to one of the more\nfrustrating parts of health care logistics: refrigeration. Samples being shipped\nto the lab and reagents shipped out to clinics were both temperature sensitive.\nProviders had to verify that these materials had stayed adequately cold throughout\nshipping and handling, otherwise laboratory results could be invalid or incorrect.\nStevens became interested in technical solutions to these problems; he wanted\nsome way to verify that samples were at acceptable temperatures both in storage\nand in transit.</p>\n<p>Moreover, Stevens imagined that these sensors would be in continuous communication.\nThere's a lot of overlap between this application and personal area networks (PANs),\nprotocols like Bluetooth that provide low-power communications over short ranges.\nThere is also clear overlap with RFID; you can buy RFID temperature sensors.\nVAI, though, coined the term <em>visibility network</em> to describe RuBee. That's\nvisibility as in asset visibility: somewhat different from Bluetooth or RFID,\nRuBee as a protocol is explicitly designed for situations where you need to\n&quot;keep tabs&quot; on a number of different objects. Despite the overlap with other\ntypes of wireless communications, the set of requirements on a visibility network\nhave lead RuBee down a very different technical path.</p>\n<p>Visibility networks have to be highly reliable. When you are trying to keep\ntrack of an asset, a failure to communicate with it represents a fundamental\nfailure of the system. For visibility networks, the ability to actually convey\na payload is secondary: the main function is just reliably detecting that\nendpoints exist. Visibility networks have this in common with RFID, and indeed,\ndespite its similarities to technologies like BLE RuBee is positioned mostly as\na competitor to technologies like UHF RFID.</p>\n<p>There are several differences between RuBee and RFID; for example, RuBee uses\nactive (battery-powered) tags and the tags are generally powered by a complete\n4-bit microcontroller. That doesn't necessarily sound like an advantage, though.\nWhile RuBee tags advertise a battery life of &quot;5-25 years&quot;, the need for a battery seems\nmostly like a liability. The real feature is what active tags enable: RuBee\noperates in the low frequency (LF) band, typically at 131 kHz.</p>\n<p>At that low frequency, the wavelength is very long, about 2.5 km. With such a\nlong wavelength, RuBee communications all happen at much less than one wavelength\nin range. RF engineers refer to this as near-field operation, and it has some\nproperties that are intriguingly different from more typical far-field RF\ncommunications. In the near-field, the magnetic field created by the antenna is\nmore significant than the electrical field. RuBee devices are intentionally\ndesigned to emit very little electrical RF signal. Communications within a RuBee network are\nachieved through magnetic, not electrical fields. That's the core of RuBee's magic.</p>\n<p>The idea of magnetic coupling is not unique to RuBee. Speaking of the near-field,\nthere's an obvious comparison to NFC which works much the same way. The main difference,\nbesides the very different logical protocols, is that NFC operates at 13.56 MHz.\nAt this higher frequency, the wavelength is only around 20 meters. The requirement\nthat near-field devices be much closer than a full wavelength leads naturally to\nNFC's very short range, typically specified as 4 cm.</p>\n<p>At LF frequencies, RuBee can achieve magnetic coupling at ranges up to about 30\nmeters. That's a range comparable to, and often much better than, RFID inventory\ntracking technologies. Improved range isn't RuBee's only benefit over RFID. The\nproperties of magnetic fields also make it a more robust protocol. RuBee promises\nsignificantly less vulnerability to shielding by metal or water than RFID.</p>\n<p>There are two key scenarios where this comes up: the first is equipment stored in\nmetal containers or on metal shelves, or equipment that is itself metallic. In\nthat scenario, it's difficult to find a location for an RFID tag that won't suffer\nfrom shielding by the container. The case of water might seem less important, but\nkeep in mind that people are made mostly of water. RFID reading is often unreliable\nfor objects carried on a person, which are likely to be shielded from the reader\nby the water content of the body.</p>\n<p>These problems are not just theoretical. WalMart is a major adopter of RFID inventory\ntechnology, and in early rollouts struggled with low successful read rates. Metal,\nmoisture (including damp cardboard boxes), antenna orientation, and multipath/interference\neffects could cause read failure rates as high as 33% when scanning a pallet of goods.\nLow read rates are mostly addressed by using RFID &quot;portals&quot; with multiple antennas.\nEight antennas used as an array greatly increase read rate, but at a cost of over\nten thousand dollars per portal system. Even so, WalMart seems to now target a\nsuccess rate of only 95% during bulk scanning.</p>\n<p>95% might sound pretty good, but there are a lot of visibility applications where\na failure rate of even a couple percent is unacceptable. These mostly go by the\neuphemism &quot;high value goods,&quot; which depending on your career trajectory you may\nhave encountered in corporate expense and property policies. High-value goods\ntend to be items that are both attractive to theft and where theft has particularly\nsevere consequences. Classically, firearms and explosives. Throw in classified\nmaterial for good measure.</p>\n<p>I wonder if Stevens was surprised by RuBee's market trajectory. He came out of\nthe healthcare industry and, it seems, originally developed RuBee for cold\nchain visibility... but, at least in retrospect, it's quite obvious that its\nmost compelling application is in the armory.</p>\n<p>Because RuBee tags are small and largely immune to shielding by metals, you\ncan embed them directly in the frames of firearms, or as an aftermarket\nmodification you can mill out some space under the grip. RuBee tags in\nweapons will read reliably when they are stored in metal cases or on\nmetal shelving, as is often the case. They will even read reliably when a\nweapon is carried holstered, close to a person's body.</p>\n<p>Since RuBee tags incorporate an active microcontroller, there are even more\npossibilities. Temperature logging is one thing, but firearm-embedded RuBee\ntags can incorporate an accelerometer (NIST-traceable, VAI likes to emphasize)\nand actually count the rounds fired.</p>\n<hr />\n<p>Sidebar time: there is a long history of political hazard around &quot;smart guns.&quot;\nThe term &quot;smart gun&quot; is mostly used more specifically for firearms that\nidentify their user, for example by fingerprint authentication or detection of\nan RFID fob. The idea has become vague enough, though, that mention of a\nfirearm with any type of RFID technology embedded would probably raise the\nspecter of the smart gun to gun-rights advocates.</p>\n<p>Further, devices embedded in firearms that count the number of\nrounds fired have been proposed for decades, if not a century, as a means of\naccountability. The holder of a weapon could, in theory, be required to\npositively account for every round fired. That could eliminate incidents of\nunreported use of force by police, for example. In practice I think this is\nless compelling than it sounds, simple counting of rounds leaves too many\nopportunities to fudge the numbers and conceal real-world use of a weapon as\nrange training, for example.</p>\n<p>That said, the NRA has long been vehemently opposed to the incorporation of any sort of\ntechnology into weapons that could potentially be used as a means of state\ncontrol or regulation. The concern isn't completely unfounded; the state of\nNew Jersey did, for a time, have legislation that would have made user-identifying\n&quot;smart guns&quot; mandatory if they were commercially available. The result of\nthe NRA's strident lobbying is that no such gun has ever become commercially\navailable; &quot;smart guns&quot; have been such a political third rail that any firearms\nmanufacturer that dared to introduce one would probably face a boycott by most\ngun stores. For better or worse, a result of the NRA's powerful political\nadvocacy in this area is that the concept of embedding security or accountability\ntechnology into weapons has never been seriously pursued in the US. Even a\ntentative step in that direction can produce a huge volume of critical press\nfor everyone involved.</p>\n<p>I bring this up because I think it explains some of why VAI seems a bit vague\nand cagey about the round-counting capabilities of their tags. They position it\nas purely a maintenance feature, allowing the armorer to keep accurate tabs on\nthe preventative maintenance schedule for each individual weapon (in armory\nenvironments, firearm users are often expected to report how many rounds\nthey fired for maintenance tracking reasons). The resistance of RuBee tags\nto concealment is only positioned as a deterrent to theft, although the idea\nof RuBee-tagged firearms creates obvious potential for security screening.\nProbably the most profitable option for VAI would be to promote RuBee-tagged\nfirearms as tool for enforcement of gun control laws, but this is\na political impossibility and bringing it up at all could cause significant\nreputational harm, especially with the government as a key customer. The result\nis marketing copy that is a bit odd, giving a set of capabilities that imply\nan application that is never mentioned.</p>\n<hr />\n<p>VAI found an incredible niche with their arms-tracking application. Institutional\nusers of firearms, like the military, police, and security forces, are relatively\nprice-insensitive and may have strict accounting requirements. By the mid-'00s,\nVAI was into the long sales cycle of proposing the technology to the military.\nThat wasn't entirely unsuccessful. RuBee shot-counting weapon inventory tags were\nselected by the Naval Surface Warfare Center in 2010 for installation on SCAR\nand M4 rifles. That contract had a five-year term, it's unclear to me if it was\nrenewed. Military contracting opened quite a few doors to VAI, though, and\ncreated a commercial opportunity that they eagerly pursued.</p>\n<p>Perhaps most importantly, weapons applications required an impressive round of\nsafety and compatibility testing. RuBee tags have the fairly unique distinction\nof military approval for direct attachment to ordnance, something called &quot;zero\nseparation distance&quot; as the tags do not require a minimum separation from\nhigh explosives. Central to that certification are findings of intrinsic safety\nof the tags (that they do not contain enough energy to trigger explosives) and\nthat the magnetic fields involved cannot convey enough energy to heat anything\nto dangerous temperatures.</p>\n<p>That's not the only special certification that RuBee would acquire. The military\nhas a lot of firearms, but military procurement is infamously slow and mercurial.\nImproved weapon accountability is, almost notoriously, not a priority for the\nUS military which has often had stolen weapons go undetected until their later\nuse in crime. The Navy's interest in RuBee does not seem to have translated to\nmore widespread military applications.</p>\n<p>Then you have police departments, probably the largest institutional owners of\nfirearms and a very lucrative market for technology vendors. But here we run\ninto the political hazard: the firearms lobby is very influential on police\ndepartments, as are police unions which generally oppose technical accountability\nmeasures. Besides, most police departments are fairly cash-poor and are not\nlikely to make a major investment in a firearms inventory system.</p>\n<p>That leaves us with institutional security forces. And there is one category\nof security force that are particularly well-funded, well-equipped, and\nbeholden to highly R&amp;D-driven, almost pedantic standards of performance:\nthe protection forces of atomic energy facilities.</p>\n<p>Protection forces at privately-operated atomic energy facilities, such as\ncivilian nuclear power plants, are subject to licensing and scrutiny by the\nNuclear Regulatory Commission. Things step up further at the many facilities\noperated by the National Nuclear Security Administration (NNSA). Protection\nforces for NNSA facilities are trained at the Department of Energy's National\nTraining Center, at the former Manzano Base here in Albuquerque. Concern over\nadequate physical protection of NNSA facilities has lead Sandia National\nLaboratories to become one of the premier centers for R&amp;D in physical security.\nTeams of scientists and engineers have applied sometimes comical scientific rigor to &quot;guns,\ngates, and guards,&quot; the traditional articulation of physical security in the\nnuclear world.</p>\n<p>That scope includes the evaluation of new technology for the management of\nprotection forces, which is why Oak Ridge National Laboratory launched an\nevaluation program for the RuBee tagging of firearms in their armory. The\nwhite paper on this evaluation is curiously undated, but citations &quot;retrieved 2008&quot;\nlead me to assume that the evaluation happened right around the middle of the\n'00s. At the time, VAI seems to have been involved in some ultimately unsuccessful\npartnership with Oracle, leading to the branding of the RuBee system as Oracle\nDot-Tag Server. The term &quot;Dot-Tag&quot; never occurs outside of very limited materials\naround the Oracle partnership, so I'm not sure if it was Oracle branding for\nRuBee or just some passing lark. In any case, Oracle's involvement seems to have\nmainly just been the use of the Oracle database for tracking inventory data---which\nwas naturally replaced by PostgreSQL at Oak Ridge.</p>\n<p>The Oak Ridge trial apparently went well enough, and around the same time, the Pantex\nPlant in Texas launched an evaluation of RuBee for tracking classified tools.\nClassified tools are a tricky category, as they're often metallic and often stored\nin metallic cases. During the trial period, Pantex tagged a set of sample classified\ntools with RuBee tags and then transported them around the property, testing the\nability of the RuBee controllers to reliably detect them entering and exiting areas of\nbuildings. Simultaneously, Pantex evaluated the use of RuBee tags to track containers\nof &quot;chemical products&quot; through the manufacturing lifecycle. Both seem to have\nproduced positive results.</p>\n<p>There are quite a few interesting and strange aspects of the RuBee system, a\nresult of its purpose-built Visibility Network nature. A RuBee controller can have\nmultiple antennas that it cycles through. RuBee tags remain in a deep-sleep mode\nfor power savings until they detect a RuBee carrier during their periodic wake\ncycle. When a carrier is detected, they fully wake and listen for traffic. A\nRuBee controller can send an interrogate message and any number of tags can respond,\nwith an interesting and novel collision detection algorithm used to ensure\nreliable reading of a large number of tags.</p>\n<p>The actual RuBee protocol is quite simple, and can also be referred to as IEEE 1902.1\nsince the decision of VAI to put it through the standards process. Packets are\nsmall and contain basic addressing info, but they can also contain arbitrary payload in both directions,\nperfect for data loggers or sensors. RuBee tags are identified by something that VAI\noddly refers to as an &quot;IP address,&quot; causing some confusion over whether or not VAI\nuses IP over 1902.1. They don't, I am confident saying after reading a whole lot of\ndocuments. RuBee tags, as standard, have three different 4-byte addresses. VAI refers\nto these as &quot;IP, subnet, and MAC,&quot; <sup class=\"footnote-ref\" id=\"fnref-2\"><a href=\"#fn-2\">2</a></sup> but these names are more like analogies.\nReally, the &quot;IP address&quot; and &quot;subnet&quot; are both configurable arbitrary addresses,\nwith the former intended for unicast traffic and the latter for broadcast. For example,\nyou would likely give each asset a unique IP address, and use subnet addresses for\ncategories or item types. The subnet address allows a controller to interrogate for\nevery item within that category at once. The MAC address is a fixed, non-configurable\naddress derived from the tag's serial number. They're all written in the formats\nwe associate with IP networks, dotted-quad notation, as a matter of convenience.</p>\n<p>And that's about it as far as the protocol specification, besides of course the\nphysical details which are a 131,072 Hz carrier, 1024 Hz data clock, either ASK\nor BPSK modulation. The specification also describes an interesting mode called\n&quot;clip,&quot; in which a set of multiple controllers interrogate in exact synchronization\nand all tags then reply in exact synchronization. Somewhat counter-intuitively,\nbecause of the ability of RuBee controllers to separate out multiple simultaneous\ntag transmissions using an anti-collision algorithm based on random phase shifts\nby each tag, this is ideal. It allows a room, say an armory, full of RuBee\ncontrollers to rapidly interrogate the entire contents of the room. I think this\nfeature may have been added after the Oak Ridge trials...</p>\n<p>RuBee is quite slow, typically 1,200 baud, so inventorying a large number of assets\ncan take a while (Oak Ridge found that their system could only collect data on 2-7\ntags per second per controller). But it's so robust that it an achieve a 100% read\nrate in some very challenging scenarios. Evaluation by the DoE and the military\nproduced impressive results. You can read, for example, of a military experiment in\nwhich a RuBee antenna embedded in a roadway reliably identified rifles secured in\nsteel containers in passing Humvees.</p>\n<p>Paradoxically, then, one of the benefits of RuBee in the military/defense context\nis that it is also <em>difficult</em> to receive. Here is RuBee's most interesting trick:\nsomewhat oversimplified, the strength of an electrical radio signal goes as 1/r,\nwhile the strength of a magnetic field goes as 1/r^3. RuBee equipment is optimized,\nby antenna design, to produce a minimal electrical field. The result is that RuBee\ntags can very reliably be contacted at short range (say, around ten feet), but are\nvirtually impossible to contact or even detect at ranges over a few hundred feet.\nTo the security-conscious buyer, this is a huge feature. RuBee tags are highly\nresistant to communications or electronic intelligence collection.</p>\n<p>Consider the logical implications of tagging the military's rifles. With\nconventional RFID, range is limited by the size and sensitivity of the antenna.\nParticularly when tags are incidentally powered by a nearby reader, an adversary\nwith good equipment can detect RFID tags at very long range. VAI heavily references\na 2010 DEFCON presentation, for example, that demonstrated detection of RFID tags\nat a range of 80 miles. One imagines that opportunistic detection by satellite is feasible for\na state intelligence agency. That means that your rifle asset tracking is also\nrevealing the movements of soldiers in the field, or at least providing a way to\ndetect their approach.</p>\n<p>Most RuBee tags have their transmit power reduced by configuration, so even the\nmaximum 100' range of the protocol is not achievable. VAI suggests that typical\nRuBee tags cannot be detected by radio direction finding equipment at ranges\nbeyond 20', and that this range can be made shorter by further reducing transmit\npower.</p>\n<p>Once again, we have caught the attention of the Department of Energy. Because of\nthe short range of RuBee tags, they have generally been approved as not representing\na COMSEC or TEMPEST hazard to secure facilities. And that brings us back to the\nvery beginning: why does the DoE use a specialized, technically interesting, and\nlargely unique radio protocol to fulfill such a basic function as nagging people\nthat have their phones? Because RuBee's security properties have allowed it to be\napproved for use adjacent to and inside of secure facilities. A RuBee tag, it is\nthought, cannot be turned into a listening device because the intrinsic range\nlimitation of magnetic coupling will make it impossible to communicate with the\ntag from outside of the building. It's a lot like how infrared microphones still\nsee some use in secure facilities, but so much more interesting!</p>\n<p>VAI has built several different product lines around RuBee, with names like\nArmory 20/20 and Shot Counting Allegro 20/20 and Store 20/20. The founder started\nhis career in eye health, remember. None of them are that interesting, though.\nThey're all pretty basic CRUD applications built around polling multiple RuBee\ncontrollers for tags in their presence.</p>\n<p>And then there's the &quot;Alert 20/20 DoorGuard:&quot; a metal pedestal with a RuBee\ncontroller and audio announcement module, perfect for detecting government\ncell phones.</p>\n<div class=\"beg\">\n<hr />\n<p>I put a lot of time into writing this, and I hope that you enjoy reading\nit. If you can spare a few dollars, consider <a href=\"https://ko-fi.com/jbcrawford\">supporting me on\nko-fi</a>. You'll receive an occasional extra,\nsubscribers-only post, and defray the costs of providing artisanal, hand-built\nworld wide web directly from Albuquerque, New Mexico.</p>\n<hr />\n</div>\n<p>One of the strangest things about RuBee is that it's hard to tell if it's still\na going concern. VAI's website has a press release section, where nothing has been\nposted since 2019. The whole website feels like it was last revised even longer\nago. When RuBee was newer, back in the '00s, a lot of industry journals covered it\nwith headlines like &quot;the new RFID.&quot; I think VAI was optimistic that RuBee could\ndisplace all kinds of asset tracking applications, but despite some special\ncertifications in other fields (e.g. approval to use RuBee controllers and tags\naround pacemakers in surgical suites), I don't think RuBee has found much success\noutside of military applications.</p>\n<p>RuBee's resistance to shielding is impressive, but RFID read rates have improved\nconsiderably with new DSP techniques, antenna array designs, and the generally\nreduced cost of modern RFID equipment. RuBee's unique advantages, its security\nproperties and resistance to even intentional exfiltration, are interesting but\nnot worth much money to buyers other than the military.</p>\n<p>So that's the fate of RuBee and VAI: defense contracting. As far as I can tell,\nRuBee and VAI are about as vital as they have ever been, but RuBee is now installed\nas just one part of general defense contracts around weapons systems, armory\nmanagement, and process safety and security. IEEE standardization has opened the\ndoor to use of RuBee by federal contractors under license, and indeed, Lockheed\nMartin is repeatedly named as a licensee, as are firearms manufacturers with military\ncontracts like Sig Sauer.</p>\n<p>Besides, RuBee continues to grow closer to the DoE. In 2021, VAI appointed Lisa\nGordon-Hagerty to it board of directors. Gordon-Hagerty was undersecretary of\nEnergy and had lead the NNSA until the year before. This year, the New Hampshire\nSmall Business Development Center wrote a glowing profile of VAI. They described\nit as a 25-employee company with a goal of hitting $30 million in annual revenue in the\nnext two years.</p>\n<p>Despite the outdated website, VAI claims over 1,200 RuBee sites in service. I wonder\nhow many of those are Alert 20/20 DoorGuards? Still, I do believe there are military\nweapons inventory systems currently in use. RuBee probably has a bright future, as a\nniche technology for a niche industry. If nothing else, they have legacy installations\nand intellectual property to lean on. A spreadsheet of VAI-owned patents on RuBee,\nwith nearly 200 rows, encourages would-be magnetically coupled visibility network inventors\nnot to go it on their own. I just wish I could get my hands on a controller....</p>\n<div class=\"footnotes\">\n<ol>\n<li id=\"fn-1\">\n<p>I have found some conflicting information on the date, it could have been\nas early as 2002. 2004 is the year I have the most confidence in.<a class=\"footnote\" href=\"#fnref-1\">&#8617;</a></p></li>\n<li id=\"fn-2\">\n<p>The documentation is confusing enough about these details that I am actually\nunclear on whether the RuBee &quot;MAC address&quot; is 4 bytes or 6. Examples show 6 byte\naddresses, but the actual 1902.1 specification only seems to allow 4 byte addresses\nin headers. Honestly all of the RuBee documentation is a mess like this. I suspect\nthat part of the problem is that VAI has actually changed parts of the protocol and\nnot all of their products are IEEE 1902.1 compliant.<a class=\"footnote\" href=\"#fnref-2\">&#8617;</a></p></li>\n</ol>\n</div>",
  "id": "https://computer.rip/2025-11-22-RuBee.html"
}