{
  "title": "Antenna diodes in the Pentium processor",
  "link": "http://www.righto.com/2024/11/antenna-diodes-in-pentium-processor.html",
  "published": "2024-11-23T11:59:00.002-08:00",
  "summary": "<p>I was studying the silicon die of the Pentium processor and noticed some puzzling structures where\nsignal lines were connected to the silicon substrate for no apparent reason.\nTwo examples are in the photo below, where the metal wiring (orange) connects to small square regions of doped silicon (gray), isolated from the rest of the circuitry.\nI did some investigation and learned that these structures are\n\"antenna diodes,\" special diodes that protect the circuitry from damage during manufacturing.\nIn this blog post, I discuss the construction of the Pentium and explain how these antenna diodes work.</p>\n<p><a href=\"https://static.righto.com/images/pentium-antenna/diodes.jpg\"><img alt=\"Closeup of the Pentium die showing the silicon and bottom metal layer. The arrows indicate connections to two antenna diodes. I removed the top two layers of metal for this photo.\" class=\"hilite\" height=\"265\" src=\"https://static.righto.com/images/pentium-antenna/diodes-w450.jpg\" title=\"Closeup of the Pentium die showing the silicon and bottom metal layer. The arrows indicate connections to two antenna diodes. I removed the top two layers of metal for this photo.\" width=\"450\" /></a><div class=\"cite\">Closeup of the Pentium die showing the silicon and bottom metal layer. The arrows indicate connections to two antenna diodes. I removed the top two layers of metal for this photo.</div></p>\n<p>Intel released the Pentium processor in 1993,\nstarting a long-running brand of high-performance processors: the Pentium Pro, Pentium II, and so on.\nIn this post, I'm studying the original Pentium, which has 3.1 million transistors.<span id=\"fnref:versions\"><a class=\"ref\" href=\"#fn:versions\">1</a></span>\nThe die photo below shows the Pentium's fingernail-sized silicon die under a microscope. \nThe chip has three layers of metal wiring on top of the silicon so the underlying silicon is almost entirely obscured.</p>\n<!--\nThe tiny white squares around the edges of the chip are bond pads. Bond wires attached to these pads provide the\nconnections between the chip and its grid of 273 external pins.\n-->\n\n<p><a href=\"https://static.righto.com/images/pentium-antenna/pentium-labeled.jpg\"><img alt=\"The Pentium die with the main functional blocks labeled. Click this photo (or any other) for a larger version.\" class=\"hilite\" height=\"525\" src=\"https://static.righto.com/images/pentium-antenna/pentium-labeled-w500.jpg\" title=\"The Pentium die with the main functional blocks labeled. Click this photo (or any other) for a larger version.\" width=\"500\" /></a><div class=\"cite\">The Pentium die with the main functional blocks labeled. Click this photo (or any other) for a larger version.</div></p>\n<p>Modern processors are built from CMOS circuitry, which uses two types of transistors: NMOS and PMOS.\nThe diagram below shows how an NMOS transistor is constructed.\nA transistor can be considered a switch between the source and drain, controlled by the gate.\nThe source and drain regions (green) consist of silicon doped with impurities to change its semiconductor properties, forming N+ silicon.\nThe gate consists of a layer of polysilicon (red), separated from the silicon by an absurdly thin insulating oxide layer.\nSince the oxide layer is just a few hundred atoms thick,<span id=\"fnref:gate\"><a class=\"ref\" href=\"#fn:gate\">2</a></span> it is very fragile and easily damaged by excess voltage.\n(This is why CMOS chips are sensitive to static electricity.) \nAs we will see, the oxide layer can also be damaged by voltage during manufacturing.</p>\n<p><a href=\"https://static.righto.com/images/pentium-antenna/mosfet-n.jpg\"><img alt=\"Diagram showing the structure of an NMOS transistor.\" class=\"hilite\" height=\"231\" src=\"https://static.righto.com/images/pentium-antenna/mosfet-n-w400.jpg\" title=\"Diagram showing the structure of an NMOS transistor.\" width=\"400\" /></a><div class=\"cite\">Diagram showing the structure of an NMOS transistor.</div></p>\n<p>The Pentium processor is constructed from multiple layers.\nStarting at the bottom, the Pentium has millions of transistors similar to the diagram above.\nPolysilicon wiring on top of the silicon not only forms the transistor gates but also provides short-range wiring.\nAbove that, three layers of metal wiring connect the parts of the chip.\nRoughly speaking, the bottom layer of metal connects to the silicon and polysilicon to construct logic gates from the transistors, while the upper layers of wiring\ntravel longer distances, with one layer for signals traveling horizontally and the other layer for signals traveling vertically.\nTiny tungsten plugs called vias provide connections between the different layers of wiring.\nA key challenge of chip design is routing, directing signals through the multiple layers of wiring while packing the circuitry as densely as possible.</p>\n<p>The photo below shows a small region of the Pentium die with the three metal layers visible.\nThe golden vertical lines are the top metal layer, formed from aluminum and copper.\nUnderneath, you can see the horizontal wiring of the middle metal layer.\nThe more complex wiring of the bottom metal layer can be seen, along with the silicon and polysilicon that form transistors.\nThe small black dots are the tungsten vias that connect metal layers, while the larger dark circles are contacts with the\nunderlying silicon or polysilicon.\nNear the bottom of the photo, the vertical gray bands are polysilicon lines, forming transistor gates.\nAlthough the chip appears flat, it has a three-dimensional structure with multiple layers of metal\nseparated by insulating layers of silicon dioxide. This three-dimensional structure will be important in the discussion below.\n(The metal wiring is much denser over most of the chip; this region is one of the rare spots where all the layers are visible.)</p>\n<p><a href=\"https://static.righto.com/images/pentium-antenna/metal-layers.jpg\"><img alt=\"Closeup of the Pentium die showing the metal layers.\nThe L-shaped hook towards the lower left is a connection to an antenna diode.\nThis photo shows a tiny part of the floating point unit. To show all the layers in focus, I combined multiple images with focus stacking.\" class=\"hilite\" height=\"430\" src=\"https://static.righto.com/images/pentium-antenna/metal-layers-w400.jpg\" title=\"Closeup of the Pentium die showing the metal layers.\nThe L-shaped hook towards the lower left is a connection to an antenna diode.\nThis photo shows a tiny part of the floating point unit. To show all the layers in focus, I combined multiple images with focus stacking.\" width=\"400\" /></a><div class=\"cite\">Closeup of the Pentium die showing the metal layers.\nThe L-shaped hook towards the lower left is a connection to an antenna diode.\nThis photo shows a tiny part of the floating point unit. To show all the layers in focus, I combined multiple images with focus stacking.</div></p>\n<p>The manufacturing process for an integrated circuit is extraordinarily complicated but\nI'll skip over most of the details and focus on how each metal layer is constructed, layer by layer.\nFirst, a uniform metal layer is constructed over the silicon wafer.\nNext, the desired pattern is produced on the surface using a process called photolithography:\na light-sensitive chemical called \"resist\"\nis applied to the wafer and exposed to light through a patterned mask. \nThe light hardens the resist, creating a protective coating with the pattern of the desired wiring.\nFinally, the unprotected metal is etched away, leaving the wiring.</p>\n<p>In the early days of integrated circuits, the metal was removed with liquid acids, a process called wet etching.\nInconveniently, wet etching tended to eat away metal underneath the edges of the mask, which became a problem as integrated circuits\nbecame denser and the wires needed to be thinner.\nThe solution was dry etch, using a plasma to remove the metal.\nBy applying a large voltage to plates above and below the chip, a gas such as HCl is ionized into a highly reactive plasma.\nThis plasma attacks the surface (unless it is protected by the resist), removing the unwanted metal.\nThe advantage of dry etching is that it can act vertically (anisotropically), providing more control over the line width.</p>\n<p>Although plasma etching improved the etching process, it caused another problem: plasma-induced oxide damage, also\ncalled (metaphorically) the \"antenna effect.\"<span id=\"fnref:antenna\"><a class=\"ref\" href=\"#fn:antenna\">3</a></span>\nThe problem is that long metal wires on the chip could pick up an electrical charge from the plasma, producing a large voltage.\nAs described earlier, the thin oxide layer under a transistor's gate is sensitive to voltage damage.\nThe voltage induced by the plasma can destroy the transistor by blowing a hole through the gate oxide or\nit can degrade the transistor's performance by embedding charges inside the oxide layer.<span id=\"fnref:damage\"><a class=\"ref\" href=\"#fn:damage\">4</a></span></p>\n<p>Several factors affect the risk of damage from the antenna effect.\nFirst, only the transistor's gate is sensitive to the induced voltage, due to the oxide layer.\nIf the wire is also connected to a transistor's source or drain, the wire is \"safe\" since the source and drain provide\nconnections to the chip's substrate, allowing the charge to dissipate harmlessly.\nNote that when the chip is completed, every transistor gate is connected to another transistor's source or drain (which provides\nthe signal to the gate), so there is no risk of damage. \nThus, the problem can only occur during manufacturing, with a metal line that is connected to a gate on one end but isn't\nconnected on the other end.\nMoreover, the highest layer of metal is \"safe\" since everything is connected at that point.\nAnother factor is that the induced voltage is proportional to the length of the metal wire, so short wires don't pose a risk.\nFinally, only the metal layer currently being etched poses a risk; since the lower layers are\ninsulated by the thick oxide between layers, they won't pick up charge.</p>\n<p>These factors motivate several ways to prevent antenna problems.<span id=\"fnref:papers\"><a class=\"ref\" href=\"#fn:papers\">5</a></span>\nFirst, a long wire can be broken into shorter segments, connected by jumpers on a higher layer.\nSecond, moving long wires to the top metal layer eliminates problems.<span id=\"fnref:top-metal\"><a class=\"ref\" href=\"#fn:top-metal\">6</a></span>\nThird, diodes can be added to drain the charge from the wire; these are called \"antenna diodes\".\nWhen the chip is in use, the antenna diodes are reverse-biased so they have no electrical effect.\nBut during manufacturing, the antenna diodes let charge flow to the substrate before it\ncauses problems.</p>\n<p>The third solution, the antenna diodes, explains the mysterious connections that I saw in the Pentium.\nIn the diagram below, these diodes are visible on the die as square regions of doped silicon.\nThe larger regions of doped silicon form PMOS transistors (upper) and NMOS transistors (lower). \nThe polysilicon lines are faintly visible; they form transistor gates where they cross the doped silicon.\n(For this photo, I removed all the metal wiring.)</p>\n<p><a href=\"https://static.righto.com/images/pentium-antenna/silicon-diagram.jpg\"><img alt=\"Closeup of the Pentium die showing transistors. The metal and polysilicon layers have been removed to show the silicon.\" class=\"hilite\" height=\"574\" src=\"https://static.righto.com/images/pentium-antenna/silicon-diagram-w450.jpg\" title=\"Closeup of the Pentium die showing transistors. The metal and polysilicon layers have been removed to show the silicon.\" width=\"450\" /></a><div class=\"cite\">Closeup of the Pentium die showing transistors. The metal and polysilicon layers have been removed to show the silicon.</div></p>\n<p>Confusingly, the antenna diodes look almost identical to \"well taps\", connections from the substrate to the chip's positive voltage supply,\nbut have a completely different purpose.\nIn the Pentium, the PMOS transistors are \nconstructed in \"wells\" of N-type silicon.\nThese wells must be raised to the chip's positive voltage, so there are numerous well tap connections\nfrom the positive supply to\nthe wells.\nThe well taps consist of squares of N+ doped silicon in the the N-type silicon well, providing an electrical connection.\nOn the other hand, the antenna diodes also consist of N+ doped silicon, but embedded in P-type silicon.\nThis forms a P-N junction that creates the diode.</p>\n<p>In the Pentium, antenna diodes are used for only a small fraction of the wiring. The diodes require extra area on the\ndie, so they are used only when necessary. Most of the antenna problems on the Pentium were apparently resolved through\nrouting.\nAlthough the antenna diodes are relatively rare, they are still frequent enough that they caught my attention.</p>\n<p>Antenna effects are still an issue in modern integrated circuits.\nIntegrated circuit fabricators provide rules on the maximum allowable size of antenna wires for a particular manufacturing process.<span id=\"fnref:rules\"><a class=\"ref\" href=\"#fn:rules\">7</a></span>\nSoftware checks the design to ensure that the antenna rules are not violated, modifying the routing and inserting diodes as\nnecessary.\nViolating the antenna rules can result in damaged chips and a very low yield, so it's more than just a theoretical issue.</p>\n<p>Thanks to <a href=\"https://www.reddit.com/r/chipdesign/comments/1gwkm65/pentium_why_are_signal_lines_connected_to_the/\">/r/chipdesign</a> \nand Discord for discussion.\nIf you're interested in the Pentium, I've written about <a href=\"https://www.righto.com/2024/07/pentium-standard-cells.html\">standard cells</a> in the Pentium, and the Pentium as a <a href=\"https://www.righto.com/2024/08/pentium-navajo-fairchild-shiprock.html\">Navajo rug</a>.\nFollow me on Mastodon (<a href=\"https://oldbytes.space/@kenshirriff\">@kenshirriff@oldbytes.space</a>) or Bluesky (<a href=\"https://bsky.app/profile/righto.com\">@righto.com</a>)\nor <a href=\"http://www.righto.com/feeds/posts/default\">RSS</a> for updates.</p>\n<h2>Notes and references</h2>\n<div class=\"footnote\">\n<ol>\n<li id=\"fn:versions\">\n<p>In this post, I'm looking at the Pentium model 80501 (codenamed P5). This model was soon replaced with a faster, lower-power version\ncalled the 80502 (P54C). Both are considered original Pentiums.&#160;<a class=\"footnote-backref\" href=\"#fnref:versions\" title=\"Jump back to footnote 1 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:gate\">\n<p><a href=\"https://www.ardent-tool.com/CPU/docs/MPR/19930531/070705.pdf\">IC manufacturing drives CPU performance</a> states that gate\noxide thickness was 100 to 300 angstroms in 1993.&#160;<a class=\"footnote-backref\" href=\"#fnref:gate\" title=\"Jump back to footnote 2 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:antenna\">\n<p>The wires are acting metaphorically as antennas, not literally, as they collect charge, not picking up radio waves.</p>\n<p>Plasma-induced oxide damage gave rise to research and conferences in the 1990s to address this problem.\nThe <a href=\"https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&amp;arnumber=715190\">International Symposium on Plasma- and Process-Induced Damage</a> started in 1996 and continued until 2003. Numerous researchers from semiconductor companies and academia\nstudied the causes and effects of plasma damage.&#160;<a class=\"footnote-backref\" href=\"#fnref:antenna\" title=\"Jump back to footnote 3 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:damage\">\n<p>The damage is caused by \"Fowler-Nordheim tunneling\", where electrons tunnel through the oxide and cause damage.\nFlash memory uses this tunneling to erase the memory; the cumulative damage is why flash memory can only be written a\nlimited number of times.&#160;<a class=\"footnote-backref\" href=\"#fnref:damage\" title=\"Jump back to footnote 4 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:papers\">\n<p>Some relevant papers:\n<a href=\"https://doi.org/10.1116/1.585577\">Magnetron etching of polysilicon: Electrical damage</a> (1991),\n<a href=\"https://doi.org/10.1109/55.145056\">Thin-oxide damage from gate charging during plasma processing</a> (1992),\n<a href=\"https://doi.org/10.1109/RELPHY.1998.670660\">Antenna protection strategy for ultra-thin gate MOSFETs</a> (1998),\n<a href=\"https://doi.org/10.1109/ISQED.2000.838883\">Fixing antenna problem by dynamic diode dropping and jumper insertion</a> (2000).\nThe Pentium uses the \"dynamic diode dropping\" approach, adding antenna diodes only as needed, rather than putting them in every circuit.\nI noticed that the Pentium uses extension wires to put the diode in a more distant site if there is no room for the diode\nunder the existing wiring.\nAs an aside, the third paper uses the curious length unit of kµm; by calling 1000 µm a kµm, you can think in\nmicrometers, even though this unit is normally called a mm.&#160;<a class=\"footnote-backref\" href=\"#fnref:papers\" title=\"Jump back to footnote 5 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:top-metal\">\n<p>Sources say that routing signals on the top metal prevents antenna violations.\nHowever, I see several antenna diodes in the Pentium that are connected directly from the bottom metal (M1) through\nM2 to long lines on M3. These diodes seem redundant since the source/drain connections are in place by that time.\nSo there are still a few mysteries...&#160;<a class=\"footnote-backref\" href=\"#fnref:top-metal\" title=\"Jump back to footnote 6 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:rules\">\n<p>Foundries have antenna rules provided as part of the Process Design Kit (PDK). Here are the rules for <a href=\"https://www.southampton.ac.uk/~bim/notes/ice/DesignRules/guidelines.html\">MOSIS</a> and <a href=\"https://skywater-pdk.readthedocs.io/en/main/rules/antenna.html\">SkyWater</a>.\nI've focused on antenna effects from the metal wiring, but polysilicon and vias can also cause antenna damage.\nThus, there are rules for these layers too.\nPolysilicon wiring is less likely to cause antenna problems, though, as it is usually restricted to short\ndistances due to its higher resistance.&#160;<a class=\"footnote-backref\" href=\"#fnref:rules\" title=\"Jump back to footnote 7 in the text\">&#8617;</a></p>\n</li>\n</ol>\n</div>",
  "id": "tag:blogger.com,1999:blog-6264947694886887540.post-347521141499861916"
}