{
  "title": "You should start a blog",
  "link": "https://maurycyz.com/misc/starting_a_blog/",
  "published": "Sun, 04 Jan 2026 00:00:00 +0000",
  "summary": "<!-- mksite: start of content -->\n<p class=\"dropcap\">\nW<em>riting something down forces you to fully understand it.</em> \nWhen the idea is on paper, you can see all the missing assumptions and leaps in logic.\nIt's common to start writing, do some research and find out that your <a href=\"https://lcamtuf.substack.com/p/you-should-write-more\">original point was wrong</a>.\n</p><p>\n<em>This is a good thing.</em>\n<!-- snip -->\n</p>\n<p>\nYou are now less wrong then you were before, and have something you can share so that we can all be less wrong.  \n</p><p>\n<em>Even if you don't learn anything new in the process</em>, we don't find our interests and hobbies by magic:\nWe read about them from someone else. \nSimply writing about what you did yesterday\n&mdash; <a href=\"https://notes.eatonphil.com/is-it-worth-writing-about.html\">even if you are not an expert on the topic</a> &mdash;\ncan be very valuable to the right person. \n</p><p>\n<h1>Why a blog:</h1>\n</p><p>\n<!-- Shelf life, editing --> \n<em>Blogs have a long shelf-life</em>:\nSocial media posts vanish in hours, but a good blog post can stay readable and relevant for decades. \nYour work can have a lasting impact on lots of people rather then being briefly noticed by a few. \n</p><p>\nSince posts are mutable and long lived, you don't have to aim for perfection.\nIt's perfectly fine start with a single sentance and expand it over time:\nBlog posts are living documents that grow alongside your ideas.\n</p><p>\n<!-- Intelectual complexity --> \n<em>Articles can build on each other</em>, cite sources or provide <a href=\"https://lcamtuf.coredump.cx/gcnc/\">hundreds of pages worth of detail</a>.\nNone of these are requirements, but having the option allows actual learning and nuanced discussions to take place.\n</p><p>\nYou can write a detailed response to someone else's detailed opinion instead of just throwing insults:\nmeaningful human interaction that just isn't possible on \"social\" media.\n</p><p>\n<!-- Control --> \n<em>You can own your identity</em>:\nIf you register <u>yourname.com</u> (costs around around $10/year) you aren't tied to any particular service.\nSwitching hosting provides is completely seamless: None of your readers will even notice anything's different. \n</p>\n\n<p>\nCompare that to being \"@yourname on <u>Twitter</u>\":\nIf the platform tries to extort you, gets sold to a horrible person, or vanishes without a trace... \nYou are out of luck.\nSure, you could move to \"@yourname on <u>Mastodon</u>\" but at the price of loosing your all readers and breaking every link to your work. \n</p>\n\n<p>\n<em>On your own website, you can customize everything</em>, and there's no risk of a company forcing a terrible redesign on you.\nInstead of being yet-another-post-feed, you can have your own\nunique place on the internet\n</p><p>\n<!-- Discoverability -->\n<em>Posts can be indexed by Google and friends</em>:\nA niche post can become the top search result and keep that spot for years. \nSocial media does have some indexing, but it is very hit-and-miss. \n</p><p>\nYou can use RSS or mailing lists to keep readers updated without having to worry if the algorithmic feed is showing your work...\nalthough, of course, you can link to your site on social media. \n</p><p>\n<h1>The alternative...</h1>\n</p><p>\n<!-- Social media sucks! -->\n<em>On social media</em>, if a post doesn't immediately go viral, it's effectively dead and will be burried by the algoritic feed. \n</p><p>\nThe only thing that people ever see are short and anger-inducing posts:\nThey have to be short or readers will get distracted all the other content next to them.\nPosts also need \"engagement\", and anger is a great motivator. \n</p><p>\nSocial media rewards posting short (and often misleading) content with a broad appeal.\nMeaningful intellectual discussions are punished:\nsome places have character limits that prevent you from even trying. \n</p><p>\nNiche topics don't fare any better:\nUnless it can find a large audience in the first few hours, it won't be shown to anyone.\nWhen someone who is interested does come along, they often won't be able to find it because the search feature doesn't work.\n</p><p>\n<em>It's not an accident that these places are full of bad political takes and endless arguments</em>. \nThey make money <a href=\"https://maurycyz.com/misc/ads/\">from advertising</a>:\nThey want to keep the greatest number of people the site for as long as possible...\neven if they become <a href=\"https://en.wikipedia.org/wiki/Enshittification\">horrible places</a> to be. \n</p><p>\n<h1>Hosting:</h1>\n</p><p>\n<em>This site is hosted on a VPS</em> and made with handwritten HTML with a custom <a href=\"/misc/new_ssg/\">site generator</a> to create the index pages. \nI'd only recommend this if you are planning to do other things on the server: \nOtherwise it's overkill and more expensive ($3.50/month) then other options. \n</p><p>\n<em>If you are willing to write some HTML</em>, <a href=\"https://pages.github.com/\">Github Pages</a> or <a href=\"https://pages.cloudflare.com/\">Cloudflare Pages</a> will host a site for free. \nBecause it's just some slightly fancy text files, switching providers in the future will be painless.\n</p><p>\n<b>Update 2026-01-14</b>: I now have a companion article describing how write your <a href=\"/tutorials/website/\">own website in HTML</a>.\nReading it is highly recomended unless you want to use a premade blogging tool with a generic theme. \n</p><p>\n<em>There are also plenty of blog specific hosting services</em> that let you get by without typing a single angle bracket. \nHowever, I haven't used any of them so I can't give specific recommendations.\n</p><p>\nIf you bring your own domain, don't stress to much about the choice:\nYou can always switch without affecting your readers. \n</p><p>\n<h1>Closing notes:</h1>\n<!-- Practice -->\n</p><p>\n<em>Your first blog post will probably be bad.\nThat's ok</em>: Your second one will be better, and your third will be even better.\nAll that matters is that you wrote something and put it out into the world. \n</p><p>\n<em>Writing is a skill:</em> you will get better with time.\n</p><p>\n<!-- The internet is nice -->\n<em>While social media can be super toxic, most people on the internet are nice</em>:\nThe vast majority of what I receive is praise, \"Thank You\"-s and polite corrections.\nOut of hundreds of emails, I've only gotten a single piece of hate-mail. \n</p><p>\n<!-- NO SLOP! -->\n<em>... but please: Don't use an LLM to generate posts for you.</em>\nI want to interact with a human and not a robot.\nEven if it's got a few spelling mistakes it's still yours and still has value.\nAn LLM generated post is worthless: \nIf I wanted to read AI slop, I would have generated it myself. \n</p><p>\nIf you feel inclined to ChatGPT something, don't:\n</p><p>\n<em>Post what you would have used as the prompt. That's the important part.</em>\n</p>\n<!-- mksite: end of content -->",
  "id": "http://maurycyz.com/misc/starting_a_blog/"
}