{
  "title": "memories of .us",
  "link": "https://computer.rip/2025-11-11-dot-us.html",
  "published": "11 Nov 2025 00:00:00 UT",
  "summary": "<p>How much do you remember from elementary school? I remember vinyl tile floors,\nthe playground, the teacher sentencing me to standing in the hallway. I had a\nteacher who was a chess fanatic; he painted a huge chess board in the paved\nschoolyard and got someone to fabricate big wooden chess pieces. It was enough\nof an event to get us on the evening news. I remember Run for the Arts, where I\ntried to talk people into donating money on the theory that I could run, which\nI could not. I'm about six months into trying to change that and I'm good for a\nmediocre 5k now, but I don't think that's going to shift the balance on K-12\nart funding.</p>\n<p>I also remember a domain name: bridger.pps.k12.or.us</p>\n<p>I have quipped before that\ncomputer science is a field mostly concerned with assigning numbers to things,\nwhich is true, but it only takes us so far. Computer scientists also like to\norganize those numbers into structures, and one of their favorites has always\nbeen the tree. The development of wide-area computer networking surfaced a\nwhole set of problems around naming or addressing computer systems that belong\nto organizations. A wide-area network consists of a set of institutions that\nmanage their own affairs. Each of those institutions may be made up of\ndepartments that manage their own affairs. A tree seemed a natural fit. Even\nthe &quot;low level&quot; IP addresses, in the days of &quot;classful&quot; addressing, were\na straightforward hierarchy: each dot separated a different level of the tree,\na different step in an organizational hierarchy.</p>\n<p>The first large computer networks, including those that would\nbecome the Internet, initially relied on manually building lists of machines by\nname. By the time the Domain Name System was developed, this had already become\ncumbersome. The rapid growth of the internet was hard to keep up with, and besides,\nwhy did any one central entity---Jon Postel or whoever---even care about the\nnames of all of the computers at Georgia Tech? Like IP addressing, DNS was designed\nas a hierarchy with delegated control. A registrant obtains a name in the hierarchy,\nsay gatech.edu, and everything &quot;under&quot; that name is within the control, and\nresponsibility, of the registrant. This arrangement is convenient for both the\nDNS administrator, which was a single organization even after the days of Postel,\nand for registrants.</p>\n<p>We still use the same approach today... mostly. The meanings of levels of the\nhierarchy have ossified. Technically speaking, the top of the DNS tree, the DNS\nroot, is a null label referenced by a trailing dot. It's analogous to the '/'\nat the beginning of POSIX file paths. &quot;gatech.edu&quot; really should be written as\n&quot;gatech.edu.&quot; to make it absolute rather than relative, but since resolution of\nrelative URLs almost always recurses to the top of the tree, the trailing dot\nis &quot;optional&quot; enough that it is now almost always omitted. The analogy to POSIX\nfile paths raises an interesting point: domain names are backwards. The 'root'\nis at the end, rather than at the beginning, or in other words, they run from\nleast significant to most significant, rather than most significant to least\nsignificant. That's just... one of those things, you know? In the early days\none wasn't obviously better than the other, people wrote hierarchies out both\nways, and as the dust settled the left-to-right convention mostly prevailed\nbut right-to-left hung around in some protocols. If you've ever dealt with\nendianness, this is just one of those things about computers that you have to\naccept: we cannot agree on which way around to write things.</p>\n<p>Anyway, the analogy to file paths also illustrates the way that DNS has ossified.\nThe highest &quot;real&quot; or non-root component of a domain name is called the top-level\ndomain or TLD, while the component below it is called a second-level domain. In\nthe US, it was long the case that top-level domains were fixed while second-level\ndomains were available for registration. There have always been exceptions in\nother countries and our modern proliferation of TLDs has changed this somewhat,\nbut it's still pretty much true. When you look at &quot;gatech.edu&quot; you know that\n&quot;edu&quot; is just a fixed name in the hierarchy, used to organize domain names by\norganization type, while &quot;gatech&quot; is a name that belongs to a registrant.</p>\n<p>Under the second-level name, things get a little vague. We are all familiar with\nthe third-level name &quot;www,&quot; which emerged as a convention for web servers and\nbecame a practical requirement. Web servers having the name &quot;www&quot; under an\norganization's domain was such a norm for so many years that hosting a webpage\ndirectly at a second-level name came to be called a &quot;naked domain&quot; and had some\ncaveats and complications.</p>\n<p>Other than www, though, there are few to no standards for the use of third-level\nand below names. Larger organizations are more likely to use third-level names\nfor departments, infrastructure operators often have complex hierarchies of\nnames for their equipment, and enterprises the world 'round name their load-balanced\nwebservers &quot;www2,&quot; &quot;www3&quot; and up. If you think about it, this situation seems like\nkind of a failure of the original concept of DNS... we do use the hierarchy, but\nfor the most part it is not intended for human consumption. Users are only\nexpected to remember two names, one of which is a TLD that comes from a relatively\nconstrained set.</p>\n<p>The issue is more interesting when we consider geography. For a very long time, TLDs\nhave been split into two categories: global TLDs, or gTLDs, and country-code TLDs,\nor ccTLDs. ccTLDs reflect the ISO country codes of each country, and are intended for\nuse by those countries, while gTLDs are arbitrary and reflect the fact that DNS was\ndesigned in the US. The &quot;.gov&quot; gTLD, for example, is for use by the US government,\nwhile the UK is stuck with &quot;.gov.uk&quot;. This does seem unfair but it's now very much\ncemented into the system: for the large part, US entities use gTLDs, while entities\nin other countries use names under their respective ccTLDs. The &quot;.us&quot; ccTLD exists\njust as much as all the others, but is obscure enough that my choice to put my\npersonal website under .us (not an ideological decision but simply a result of where\na nice form of my name was available) sometimes gets my email address rejected.</p>\n<p>Also, a common typo for &quot;.us&quot; is &quot;.su&quot; and that's geopolitically amusing. .su is of\ncourse the ccTLD for the Soviet Union, which no longer exists, but the ccTLD lives\non in a limited way because it became Structurally Important and difficult to remove, as names and addresses\ntend to do.</p>\n<p>We can easily imagine a world where this historical injustice had been fixed: as\nthe internet became more global, all of our US institutions could have moved under\nthe .us ccTLD. In fact, why not go further? Geographers have long organized political\nboundaries into a hierarchy. The US is made up of states, each of which has been\nassigned a two-letter code by the federal government. We have &quot;.us&quot;, why not &quot;nm.us&quot;?</p>\n<p>The answer, of course, is that we do.</p>\n<p>In the modern DNS, all TLDs have been delegated to an organization who administers\nthem. The .us TLD is rightfully administered by the National Telecommunications and\nInformation Administration, on the same basis by which all ccTLDs are delegated to\ntheir respective national governments. Being the US government, NTIA has naturally\nprivatized the function through a contract to telecom-industrial-complex giant\nNeustar. Being a US company, Neustar restructured and sold its DNS-related business\nto GoDaddy. Being a US company, GoDaddy rose to prominence on the back of infamously\ntasteless television commercials, and its subsidiary Registry Services LLC now\noperates our nation's corner of the DNS.</p>\n<p>But that's the present---around here, we avoid discussing the present so as to hold\ncrushing depression at bay. Let's turn our minds to June 1993, and the publication of\nRFC 1480 &quot;The US Domain.&quot; To wit:</p>\n<blockquote>\n<p>Even though the original intention was that any educational\ninstitution anywhere in the world could be registered under the EDU\ndomain, in practice, it has turned out with few exceptions, only\nthose in the United States have registered under EDU, similarly with\nCOM (for commercial). In other countries, everything is registered\nunder the 2-letter country code, often with some subdivision.  For\nexample, in Korea (KR) the second level names are AC for academic\ncommunity, CO for commercial, GO for government, and RE for research.\nHowever, each country may go its own way about organizing its domain,\nand many have.</p>\n</blockquote>\n<p>Oh, so let's sort it out!</p>\n<blockquote>\n<p>There are no current plans of putting all of the organizational\ndomains EDU, GOV, COM, etc., under US.  These name tokens are not\nused in the US Domain to avoid confusion.</p>\n</blockquote>\n<p>Oh. Oh well.</p>\n<blockquote>\n<p>Currently, only four year colleges and universities are being\nregistered in the EDU domain.  All other schools are being registered\nin the US Domain.</p>\n</blockquote>\n<p>Huh?</p>\n<p>RFC 1480 is a very interesting read. It makes passing references to so many\nfacets of DNS history that could easily be their own articles. It also\ndefines a strict, geography-based hierarchy for the .us domain that is a\ncompletely different universe from the one in which we now live. For example,\nwe learned above that, in 1993, only four-year institutions were being\nplaced under .edu. What about the community colleges? Well, RFC 1480 has an\nanswer. Central New Mexico Community College would, of course, fall under\ncnm.cc.nm.us. Well, actually, in 1993 it was called the Technical-Vocational\nInstitute, so it would have been tvi.tec.nm.us. That's right, the RFC\ndescribes both &quot;cc&quot; for community colleges and &quot;tec&quot; for technical institutes.</p>\n<p>Even more surprising, it describes placing entities under a &quot;locality&quot; such as\na city. The examples of localities given are &quot;berkeley.ca.us&quot; and &quot;portland.wa.us&quot;, the\nlatter of which betrays an ironic geographical confusion. It then specifies &quot;ci&quot;\nfor city and &quot;co&quot; for county, meaning that the city government of our notional\nPortland, Washington would be ci.portland.wa.us. Agencies could go under the\ncity government component (the RFC gives the example &quot;Fire-Dept.CI.Los-Angeles.CA.US&quot;)\nwhile private businesses could be placed directly under the city (e.g. &quot;IBM.Amonk.NY.US&quot;).\nThe examples here reinforce that the idea itself is different from how we use DNS\ntoday: The DNS of RFC 1480 is far more hierarchical and far more focused on full\nnames, without abbreviations.</p>\n<p>Of course, the concept is not limited to local government. RFC 1480 describes\n&quot;fed.us&quot; as a suffix for the federal government (the example &quot;dod.fed.us&quot; illustrates\nthat this has not at all happened), and even &quot;General Independent Entities&quot; and\n&quot;Distributed National Institutes&quot; for those trickier cases.</p>\n<p>We can draw a few lessons from how this proposal compares to our modern day.\nBack in the 1990s, .gov was limited to the federal government.\nThe thinking was that all government agencies would move into .us, where the\nhierarchical structure made it easier to delegate management of state and\nlocality subtrees. What actually happened was the opposite: the .us thing\nnever really caught on, and a more straightforward and automated management\nprocess made .gov available to state and local governments. The tree has\neffectively been flattened.</p>\n<p>That's not to say that none of these hierarchical names saw use.\nGoDaddy continues to maintain what they call the &quot;usTLD Locality-Based\nStructure&quot;. At the decision of the relevant level of the hierarchy (e.g.\na state), locality-based subdomains of .us can either be delegated to\nthe state or municipality to operate, or operated by GoDaddy itself as\nthe &quot;Delegated Manager.&quot; The latter arrangement is far more common, and\nit's going to stay that way: RFC 1480 names are not dead, but they are\non life support. GoDaddy's contract allows them to stop onboarding any\nadditional delegated managers, and they have.</p>\n<p>Few of these locality-based names found wide use, and there are even\nfewer left today. Multnomah County Library once used &quot;multnomah.lib.or.us,&quot;\nwhich I believe was actually the very first &quot;library&quot; domain name registered.\nIt now silently redirects to &quot;multcolib.org&quot;, which\nwe could consider a graceful name only in that the spelling of\n&quot;Multnomah&quot; is probably not intuitive to those not from the region. As\nfar as I can tell, the University of Oregon and OGI (part of OHSU)\nwere keeping very close tabs on the goings-on of academic DNS, as\nOregon entities are conspicuously over-represented in the very early\ndays of RFC 1480 names---behind only California, although Georgia\nTech and Trent Heim of former Colorado company XOR both registered enough names to give their\nstates a run for the money.</p>\n<p>&quot;co.bergen.nj.us&quot; works, but just gets you a redirect notice page to\nbergencountynj.gov. It's interesting that this name is actually longer\nthan the RFC 1480 name, but I think most people would agree that bergencountynj.gov\nis easier to remember. Some of that just comes down to habit, we all know &quot;.gov&quot;,\nbut some of it is more fundamental. I don't think that people often\nunderstand the hierarchical structure of DNS, at least not intuitively, and\nthat makes &quot;deeply hierarchical&quot; (as GoDaddy calls them) names confusing.</p>\n<p>Certainly the RFC 1480 names for school districts produced complaints.\nThey were also by far the most widely adopted. You can pick and choose\nexamples of libraries (.lib.[state].us) and municipal governments that have\nused RFC 1480 names, but school districts are another world: most school\ndistricts that existed at the time have a legacy of using RFC 1480 naming.\nAs one of its many interesting asides, RFC 1480 explains why: the practice\nof putting school districts under [district].k12.[state].us actually\npredates RFC 1480. Indeed, the RFC seems to have been written in part to\nformalize the existing practice. The idea of the k12.[state].us hierarchy\noriginated within IANA in consultation with InterNIC (newly created at\nthe time) and the Federal Networking Council, a now-defunct advisory\ncommittee of federal agencies that made a number of important early\ndecisions about internet architecture.</p>\n<p>RFC 1480 is actually a revision on the slightly older RFC 1386, which\ninstead of saying that schools were already using the k12 domains, says that\n&quot;there ought to be a consistent scheme for naming them.&quot; It then says\nthat the k12 branch has been &quot;introduced&quot; for that purpose. RFC 1386 is\nmostly silent on topics <em>other</em> than schools, so I think it was written\nto document the decision made about schools with other details about\nthe use of locality-based domains left sketchy until the more thorough\nRFC 1480.</p>\n<p>The decision to place &quot;k12&quot; under the state rather than under a municipality\nor county might seem odd, but the RFC gives a reason. It's not unusual for\nschool districts, even those named after a municipality, to cover a larger\narea than the municipality itself. Albuquerque Public Schools operates\nschools in the East Mountains; Portland Public Schools operates schools\nacross multiple counties and beyond city limits. Actually the RFC gives\nexactly that second one as an example:</p>\n<blockquote>\n<p>For example, the Portland school\ndistrict in Oregon, is in three or four counties.  Each of those\ncounties also has non-Portland districts.</p>\n</blockquote>\n<p>I include that quote mostly because I think it's funny that the authors\nnow know what state Portland is in. When you hear &quot;DNS&quot; you think Jon\nPostel, at least if you're me, but RFC 1480 was written by Postel along\nwith a less familiar name, Ann Westine Cooper. Cooper was a coworker of\nPostel at USC, and RFC 1480 very matter-of-factly names the duo of\nPostel and Cooper as the administrator of the .US TLD. That's interesting\nconsidering that almost five years later Postel would become involved in\na notable conflict with the federal government over control of DNS---one\nof the events that precipitated today's eccentric model of public-private\nDNS governance.</p>\n<p>There are other corners of the RFC 1480 scheme that were not contemplated\nin 1993, and have managed to outlive many of the names that were. Consider,\nfor example, our indigenous nations: these are an exception to the normal\npolitical hierarchy of the US. The Navajo Nation, for example, exists in a\nstate that is often described as parallel to a state, but isn't really.\nNative nations are sovereign, but are also subject to federal law by\nstatute, and subject to state law by various combinations of statute,\njurisprudence, and bilateral agreement. I didn't really give any detail\nthere and I probably still got something wrong, such is the complicated\nlegal history and present of Native America. So where would a native\nsovereign government put their website? They don't fall under the\ntraditional realm of .gov, federal government, nor do they fall under a\nstate-based hierarchy. Well, naturally, the Navajo Nation is found at\nnavajo-nsn.gov.</p>\n<p>We can follow the &quot;navajo&quot; part but the &quot;nsn&quot; is odd, unless they spelled\n&quot;nation&quot; wrong and then abbreviated it, which I've always thought is what\nit looks like on first glance. No, this domain name is very much an artifact\nof history. When the problem of sovereign nations came to Postel and Cooper,\nthe solution they adopted was a new affinity group, like &quot;fed&quot; and &quot;k12&quot;\nand &quot;lib&quot;: &quot;nsn&quot;, standing for Native Sovereign Nation. Despite being a\nlate comer, nsn.us probably has the most enduring use of any part of the\nRFC 1480 concept. Dozens of pueblos, tribes, bands, and confederations\nstill use it. squamishtribe.nsn.us, muckleshoot.nsn.us, ctsi.nsn.us,\nsandiapueblo.nsn.us.</p>\n<p>Yet others have moved away... in a curiously &quot;partial&quot; fashion. navajo-nsn.gov\nas we have seen, but an even more interesting puzzler is tataviam-nsn.us. It's\nonly one character away from a &quot;standardized&quot; NSN affinity group locality domain,\nbut it's so far away. As best I can tell, most of these governments initially\nadopted &quot;nsn.us&quot; names, which cemented the use of &quot;nsn&quot; in a similar way to &quot;state&quot;\nor &quot;city&quot; as they appear in many .gov domains to this day. Policies on .gov\nregistration may be a factor as well, the policies around acceptable .gov names\nseem to have gone through a long period of informality and then changed a number\nof times. Without having researched it too deeply, I have seen bits and pieces\nthat make me think that at various points NTIA has preferred that .gov domains\nfor non-federal agencies have some kind of qualifier to indicate their &quot;level&quot;\nin the political hierarchy. In any case, it's a very interesting situation because\n&quot;native sovereign nation&quot; is not otherwise a common term in US government.\nIt's not like lawyers or lawmakers broadly refer to tribal governments as NSNs,\nthe term is pretty much unique to the domain names.</p>\n<p>So what ever happened to locality-based names? RFC 1480 names have fallen\nout of favor to such an extent as to be considered legacy by many of their\nusers. Most Americans are probably not aware of this name hierarchy at all,\ndespite it ostensibly being the unified approach for this country. In\nshort, it failed to take off, and those sectors that had widely adopted it\n(such as schools) have since moved away. But why?</p>\n<div class=\"beg\">\n<hr />\n<p>I put a lot of time into writing this, and I hope that you enjoy reading\nit. If you can spare a few dollars, consider <a href=\"https://ko-fi.com/jbcrawford\">supporting me on\nko-fi</a>. You'll receive an occasional extra,\nsubscribers-only post, and defray the costs of providing artisanal, hand-built\nworld wide web directly from Albuquerque, New Mexico.</p>\n<hr />\n</div>\n<p>As usual, there seem to be a few reasons. The first is user-friendliness.\nThis is, of course, a matter of opinion---but anecdotally, many people\nseem to find deeply hierarchical domain names confusing. This may be a\nself-fulfilling prophecy, since the perception that multi-part DNS names\nare user-hostile means that no one uses them which means that no users\nare familiar with them. Maybe, in a different world, we could have broken\nout of that loop. I'm not convinced, though. In RFC 1480, Postel and\nCooper argue that a deeper hierarchy is valuable because it allows for\nmore entities to have their &quot;obviously correct&quot; names. That does make\nsense to me, splitting the tree up into more branches means that there is\nless name contention within each branch. But, well, I think it might be\nthe kind of logic that is intuitive only those who work in computing.\nFor the general public, I think long multi-part names quickly become\ndifficult to remember and difficult to type. When you consider the dollar\namounts that private companies have put into dictionary word domain names,\nit's no surprise that government agencies tend to prefer one-level names\nwith full words and simple abbreviations.</p>\n<p>I also think that the technology outpaced the need that RFC 1480 was\nintended to address. The RFC makes it very clear that Postel and Cooper\nwere concerned about the growing size of the internet, and expected the\nsheer number of organizations going online to make maintenance of the DNS\nimpractical. They correctly predicted the explosion of hosts, but not the\ncorresponding expansion of the DNS bureaucracy. Between the two versions\nof the .us RFC, DNS operations were contracted to Network Solutions. This\nbegan a winding path that lead to delegation of DNS zones to various\nprivate organizations, most of which fully automated registration and\ndelegation and then federated it via a common provisioning protocol. The\nsize of, say, the .com zone really did expand beyond what DNS's designers\nhad originally anticipated... but it pretty much worked out okay. The\nmechanics of DNS's maturation probably had a specifically negative effect\non adoption of .us, since it was often under a different operator from the\n&quot;major&quot; domain names and not all &quot;registrars&quot; initially had access.</p>\n<p>Besides, the federal government never seems to have been all that on board\nwith the concept. RFC 1480 could be viewed as a casualty of the DNS wars,\na largely unexplored path on the branch of DNS futures that involved IANA\nbecoming completely independent of the federal government. That didn't\nhappen. Instead, in 2003 .gov registration was formally opened to municipal,\nstate, and tribal governments. It became federal policy to encourage use of\n.gov for trust reasons (DNSSEC has only furthered this), and .us began to fall by the wayside.</p>\n<p>That's not to say that RFC 1480 names have ever gone away. You can still\nfind many of them in use. state.nm.us doesn't have an A record, but governor.state.nm.us\nand a bunch of other examples under it do. The internet is littered\nwith these locality-based names, many of them hiding out in smaller\nagencies and legacy systems. Names are hard to get right, and one of the reasons is\nthat they're very hard to get rid of.</p>\n<blockquote>\n<p>When things are bigger, names have to be longer.  There is an\nargument that with only 8-character names, and in each position allow\na-z, 0-9, and -, you get 37**8 = 3,512,479,453,921 or 3.5 trillion\npossible names.  It is a great argument, but how many of us want\nnames like &quot;xs4gp-7q&quot;.  It is like license plate numbers, sure some\npeople get the name they want on a vanity plate, but a lot more\npeople who want something specific on a vanity plate can't get it\nbecause someone else got it first.  Structure and longer names also\nlet more people get their &quot;obviously right&quot; name.</p>\n</blockquote>\n<p>You look at Reddit these days and see all these usernames that are two\nrandom words and four random numbers, and you see that Postel and Cooper\nwere right. Flat namespaces create a problem, names must either be complex\nor long, and people don't like it either. What I think they got wrong, at\na usability level, is that deep hierarchies still create names that are\ncomplex <em>and</em> long. It's a kind of complexity that computer scientists\nare more comfortable with, but that's little reassurance when you're\nstaring down the barrel of &quot;bridger.pps.k12.or.us&quot;.</p>",
  "id": "https://computer.rip/2025-11-11-dot-us.html"
}