{
  "title": "Notes from \"On Writing Well\"",
  "link": "https://evanhahn.com/on-writing-well-book-notes/",
  "published": "Sun, 04 Jan 2026 00:00:00 +0000",
  "summary": "<p>I&rsquo;ve been trying to improve my writing so I read <a href=\"https://www.harpercollins.com/products/on-writing-well-william-zinsser\"><em>On Writing Well</em></a> by William Zinsser.</p>\n<p>My main takeaways:</p>\n<ul>\n<li>\n<p><strong>Clear thinking is a prerequisite for clear writing.</strong> How do you avoid cluttered writing? &ldquo;The answer is to clear our heads of clutter. Clear thinking becomes clear writing; one can&rsquo;t exist without the other. It&rsquo;s impossible for a muddy thinker to write good English.&rdquo;</p>\n</li>\n<li>\n<p><strong>Reduce scope.</strong> Zinsser hammers this point repeatedly. For instance: &ldquo;Nobody can write a book or an article &lsquo;about&rsquo; something. Tolstoy couldn&rsquo;t write a book about war and peace, or Melville a book about whaling. They made certain reductive decisions about time and place and about individual characters in that time and place—one man pursuing one whale. Every writing project must be reduced before you start to write.&rdquo;</p>\n</li>\n<li>\n<p><strong>Keep the thesis in mind.</strong> &ldquo;Writers must [&hellip;] constantly ask: what am I trying to say? Surprisingly often they don&rsquo;t know. Then they must look at what they have written and ask: have I said it?&rdquo;</p>\n</li>\n</ul>\n<p>I don&rsquo;t want to write like this guy. I think Zinsser&rsquo;s writing is dogmatic, verbose, outdated, and above all: not to my taste. But that helps me clarify my own style by showing me what I <em>don&rsquo;t</em> want to do.</p>\n<p>And despite all that, I agree with a lot of his recommendations. Even though there were many parts I disliked, I think <em>On Writing Well</em> holds better advice than <a href=\"https://evanhahn.com/economist-style-guide-book-takeaways/\">a writing guide I read last year</a>.</p>\n<p>I hope my writing improves as a result of reading this book.</p>",
  "id": "https://evanhahn.com/on-writing-well-book-notes/"
}