{
  "title": "My impressions of the MacBook Pro M4",
  "link": "https://michael.stapelberg.ch/posts/2025-10-31-macbook-pro-m4-impressions/",
  "published": "2025-10-31T11:04:59+01:00",
  "summary": "<p>I have been using a MacBook Pro M4 as my portable computer for the last half a\nyear and wanted to share a few short impressions. As always, I am not a\nprofessional laptop reviewer, so in this article you won’t find benchmarks, just\nsubjective thoughts!</p>\n<p>Back in 2021, I wrote about the <a href=\"/posts/2021-11-28-macbook-air-m1/\">MacBook Air\nM1</a>, which was the first computer I used that\ncontained Apple’s own ARM-based CPU. Having a silent laptop with long battery\nlife was a game-changer, so I wanted to keep those properties.</p>\n<p>When the US government announced tariffs, I figured I would replace my 4-year\nold MacBook Air M1 with a more recent model that should last a few more\nyears. Ultimately, Apple’s prices remained stable, so, in retrospect, I could\nhave stayed with the M1 for a few more years. Oh well.</p>\n<h2 id=\"the-nano-textured-display\">The nano-textured display</h2>\n<p>I went to the Apple Store to compare the different options in\nperson. Specifically, I was curious about the display and whether the increased\nweight and form factor of the MacBook Pro (compared to a MacBook Air) would be\nacceptable. Another downside of the Pro model is that it comes with a fan, and I\nreally like absolutely quiet computers. Online, I read from other MacBook Pro\nowners that the fan mostly stays off.</p>\n<p>In general, I would have preferred to go with a MacBook Air because it has\nenough compute power for my needs and I like the case better (no ventilation\nslots), but unfortunately only the MacBook Pro line has the better displays.</p>\n<p>Why aren’t all displays nano-textured? The employee at the Apple Store presented\nthe trade-off as follows: The nano texture display is great at reducing\nreflections, at the expense of also making the picture slightly less vibrant.</p>\n<p>I could immediately see the difference when placing two laptops side by side:\nThe bright Apple Store lights showed up very prominently on the normal display\n(left), and were almost not visible at all on the nano texture display (right):</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<a href=\"https://michael.stapelberg.ch/posts/2025-10-31-macbook-pro-m4-impressions/2025-10-30-macbooks-displays.jpg\"><img alt=\"MacBook Air (left) vs. MacBook Pro (right)\" height=\"409\" src=\"https://michael.stapelberg.ch/posts/2025-10-31-macbook-pro-m4-impressions/2025-10-30-macbooks-displays_hu_4cb7e6e8fae8437.jpg\" style=\"border: 1px solid #000;\" title=\"MacBook Air (left) vs. MacBook Pro (right)\" width=\"600\" /></a>\n\n\n\n<p>Personally, I did not perceive a big difference in “vibrancy”, so my choice was\nclear: I’ll pick the MacBook Pro over the MacBook Air (despite the weight) for\nthe nano texture display!</p>\n<p>After using the laptop in a number of situations, I am very happy with this\nchoice. In normal scenarios, I notice no reflections at all (where my previous\nlaptop did show reflections!). This includes using the laptop on a train (next\nto the window), or using the laptop outside in daylight.</p>\n<h2 id=\"specs-m4-or-m4-pro\">Specs: M4 or M4 Pro?</h2>\n<p>(When I chose the new laptop, Apple’s M4 chips were current. By now, they have\nreleased the first devices with M5 chips.)</p>\n<p>I decided to go with the MacBook Pro with M4 chip instead of the M4 <strong>Pro</strong> chip\nbecause I don’t need the extra compute, and the M4 needs less cooling — the M4\nPro apparently runs hotter. This increases the chance of the fan staying off.</p>\n<p>Here are the specs I ended up with:</p>\n<ul>\n<li>14&quot; Liquid Retina XDR Display with nano texture</li>\n<li>Apple M4 Chip (10 core CPU, 10 core GPU)</li>\n<li>32 GB RAM (this is the maximum!), 2 TB SSD (enough for this computer)</li>\n</ul>\n<h2 id=\"impressions\">Impressions</h2>\n<p>One thing I noticed is that the MacBook Pro M4 sometimes gets warm, even when it\nis connected to power, but is suspended to RAM (and has been fully charged for\nhours). I’m not sure why.</p>\n<p>Luckily, the fan indeed stays silent. I think I might have heard it spin up once\nin half a year or so?</p>\n<p>The battery life is amazing! The previous MacBook Air M1 had amazing all-day\nbattery life already, and this MacBook Pro M4 lasts even longer. For example,\nwatching videos on a train ride (with VLC) for 3 hours consumed only 10% of\nbattery life. I generally never even carry the charger.</p>\n<p>Because of that, Apple’s re-introduction of MagSafe, a magnetic power connector\n(so you don’t damage the laptop when you trip over it), is nice-to-have but\ndoesn’t really make much of a difference anymore. In fact, it might be better to\npack a USB-C cable when traveling, as that makes you more flexible in how you\nuse the charger.</p>\n<h2 id=\"120-hz-display\">120 Hz display</h2>\n<p>I was curious whether the 120 Hz display would make a difference in practice. I\nmostly notice the increased refresh rate when there are animations, but not,\nfor example, when scrolling.</p>\n<p>One surprising discovery (but obvious in retrospect) is that even non-animations\ncan become faster. For example, when running a Go web server on <code>localhost</code>, I\nnoticed that navigating between pages by clicking links felt faster on the 120\nHz display!</p>\n<p>The following illustration shows why that is, using a page load that takes 6ms\nof processing time. There are three cases (the illustration shows an average\ncase and the worst case):</p>\n<ol>\n<li>Best case: Page load finishes <em>just before</em> the next frame is displayed: no delay.</li>\n<li>Worst case: Page load finishes <em>just after</em> a frame is displayed: one frame of delay.</li>\n<li>Most page loads are somewhere in between. We’ll have 0.x to 1.0 frames of delay</li>\n</ol>\n\n\n\n\n<a href=\"https://michael.stapelberg.ch/posts/2025-10-31-macbook-pro-m4-impressions/2025-10-31-delay-60-vs-120.svg\"><img alt=\"delay\" src=\"https://michael.stapelberg.ch/posts/2025-10-31-macbook-pro-m4-impressions/2025-10-31-delay-60-vs-120.svg\" style=\"border: 1px solid #000;\" title=\"delay\" /></a>\n\n\n<p>As you can see, the waiting time becomes shorter when going from 60 Hz (one\nframe every 16.6ms) to 120 Hz (one frame every 8.3ms). So if you’re working with\na system that has &lt;8ms response times, you might observe actions completing (up\nto) twice as fast!</p>\n<p>I don’t notice going back to 60 Hz displays on computers. However, on phones,\nwhere a lot more animations are a key part of the user experience, I think 120\nHz displays are more interesting.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>My ideal MacBook would probably be a MacBook Air, but with the nano-texture display! :)</p>\n<p>I still don’t like macOS and would prefer to run Linux on this laptop. But\n<a href=\"https://asahilinux.org/\">Asahi Linux</a> still needs some work before it’s usable\nfor me (I need external display output, and M4 support). This doesn’t bother me\ntoo much, though, as I don’t use this computer for serious work.</p>",
  "id": "https://michael.stapelberg.ch/posts/2025-10-31-macbook-pro-m4-impressions/"
}