{
  "title": "the steorn orbo",
  "link": "https://computer.rip/2025-10-28-the-steorn-orbo.html",
  "published": "27 Oct 2025 00:00:00 UT",
  "summary": "<blockquote>\n<p>We think that we're converting time into energy... that's the engineering\nprinciple.</p>\n</blockquote>\n<p>In the 1820s, stacks, ovens, and gasometers rose over the docklands of Dublin.\nThe Hibernian Gas Company, one of several gasworks that would eventually occupy\nthe land around the Grand Canal Docks, heated coal to produce town gas. That gas\nwould soon supply thousands of lights on the streets of Dublin, a quiet\nrevolution in municipal development that paved the way for\nelectrification---both conceptually, as it proved the case for public lighting,\nand literally, as town gas fired the city's first small power plants.</p>\n<p>Ireland's supply of coal became scarce during the Second World War; as part of\nrationing of the town gas supply most street lights were shut off. Town gas\nwould never make a full recovery. By that time, electricity had proven its case\nfor lighting. Although coal became plentiful after the war, imported from England\nand transported from the docks to the gasworks by horse teams, even into the\n1960s---this form of energy had become obsolete. In the 1980s, the gasworks\nstoked their brick retorts for the last time. Natural gas had arrived. It was\ncheaper, cleaner, safer.</p>\n<p>The Docklands still echo with the legacy of the town gas industry. The former\nsite of the Hibernian gasworks is now the Bord Gáis Energy Theatre, a performing\narts center named for the British-owned energy conglomerate that had once run\nIreland's entire gas industry as a state monopoly. Metal poles, the Red Sticks,\njut into the sky from the Grand Canal Square. They are an homage to the stacks\nthat once loomed over the industrial docks. Today, those docks have turned\nover to gastropubs, offices, the European headquarters of Google.</p>\n<p>Out on the water, a new form of energy once spun to life. In December of 2009, a\nman named Sean McCarthy booked the Waterways Ireland Visitors Centre for a press\nevent. In the dockside event space, and around the world through a live stream,\nhe invited the public to witness a demonstration of his life's work. The\nculmination of three years of hype, controversy, and no small amount of\nridicule, this was his opportunity to prove what famed physicist Michio Kaku and\nhis own hand-picked jury of scientists had called a sham.</p>\n<p>He had invented a perpetual motion machine.</p>\n<hr />\n<p>Sean McCarthy had his start in the energy industry. Graduating with an\nengineering degree in the 1980s, he took a software position with a company\nthat quickly became part of European energy equipment giant ABB. By some route\nnow lost to history, he made is way into sales. 1994 found McCarthy in Bahrain,\nmanaging sales for the Middle East.</p>\n<p>McCarthy is clearly a strong salesman. In Bahrain, he takes credit for growing\nABB's business by orders of magnitude. Next, ABB sent him to Houston, where he\nworked sales to Central and South America. In 1999, the company called him to\nAzerbaijan---but he chose otherwise, leaving ABB and returning to Dublin.</p>\n<p>Contacts from the energy industry, and no doubt his start in software, brought\nGraham to the world of the internet. 1999 in Dublin was, like so many places,\ncrowded with dotcom boom startups. McCarthy saw opportunity: not necessarily by\njoining the fray, but by selling expertise and experience to those who already\nhad. With his brother-in-law, a lawyer, he formed Steorn.</p>\n<p>The nature of Steorn's business during these early years is a bit hazy. As\nMcCarthy recounts it, to Barry Whyte for the book <em>The Impossible Dream</em>, Steorn\ngathered some early support from the Dublin internet industry that connected him\nwith both capital and clients. One of their most notable clients, attested by\nseveral sources, was dotcom wonder WorldOfFruit.com. The World of Fruit, a\nsubsidiary of fruit importer Fyffes, was a web-based auction platform for\nwholesale import and export of fruit. I have not been able to clarify how\nexactly Steorn was involved in World Of Fruit, although it cannot be ignored\nthat the aforementioned brother-in-law and cofounder, Francis Hackett, had been\nthe general counsel of World Of Fruit before becoming involved in Steorn. As for\nthe future of online fruit trading, it went about as well as most dotcom-era\nmarket platforms did, stumbling on for a few years before folding with millions\nof Euro lost.</p>\n<p>Later, by McCarthy's telling, Steorn shifted its business more towards R&amp;D.\nThey worked on a project for a client fighting credit card fraud, which led to\nlater work for Irish and British law enforcement organizations, mostly related to\nvideo surveillance and machine vision.  For Ireland's DART commuter train, for\nexample, Steorn attempted a system that would automatically detect aggressive\nbehavior in platform surveillance video---though it was canceled before\ncompletion. These projects floated Steorn through the worst of the dotcom bust\nand supported an in-house R&amp;D operation that trialed a variety of ideas,\nincluding something like an early version of California's modern electronic\nlicense plates.</p>\n<p>I am not sure who well this account squares with Steorn's public presence.\nSteorn was incorporated in July of 2000, and when their website appeared in 2001\nit advertised &quot;programme management and technical assessment advice for European\ncompanies engaging in e-commerce projects.&quot; The main emphasis of the website was\nin the project management experience of McCarthy and the company's CTO, Sean\nMenzies, formerly of recruiting and staffing firm Zartis. The primary claim was\nthat Steorn could oversee projects to develop and launch e-commerce websites,\nreducing the risk and expense of jumping into the world wide web.</p>\n<blockquote>\n<p>Steorn has been formed by individuals with significant experience in this area\nwho have recognised that there is an absence in the market of genuinely\nimpartial and objective advice as to the best way of implementing e-commerce\nideas.</p>\n</blockquote>\n<p>A few months later, Steorn's business became a little more general: &quot;Steorn is\nan expert in the field of technology risk management.&quot; In August of 2001, Steorn\nlaunched its first concrete product offering, one that is curiously absent from\nMcCarthy's later stories of the company. Not only would Steorn supervise\ntechnology projects, it had partnered with an insurance company to underwrite\nsurety bonds on the completion of those projects.</p>\n<p>Steorn had a proprietary program management methodology which they called GUIDE.\nFrustratingly, although GUIDE is always styled in all caps, I have not found any\nindication that it stood for something. What I do know is that GUIDE &quot;offers\npredictability, visibility, control and results,&quot; and that it has some relation\nto a project planning methodology called DIRECT.</p>\n<p>In all truth, while Steorn's 2001 websites are laden with bespoke buzzwords, the\nproject and risk management services they offer seem unremarkable in a good way.\nProbabalistic project scheduling models, checkpoints and interim deliverables,\n&quot;an approach which is systematic yet sufficiently flexible.&quot; The only way that\nSteorn's services seem foolish is the extent to which these methods have been\nadopted by every technology project---or have become so dated or unfashionable\nas to appear obsolete.</p>\n<p>This was 2001, though, and many established companies found themselves plunging\ninto the deep end of the online economy for the first time. No doubt the\nguidance of an outside expert with experience in online projects could be\nvaluable. But, then, I am a sympathetic audience: they were hiring technical\narchitects. That's my day job! The benefits package was, they said, best in\nclass. Alas, the conditions that may necessitate my own move to Dublin come more\nthan twenty years too late.</p>\n<p>Despite McCarthy's description of their multiple projects in security,\nsurveillance, and machine vision, Steorn never seems to have advertised or\npublicized any work in those areas. In 2003, their website underwent a redesign\nthat added &quot;services for technology inventors&quot; and advertised a subsidiary web\nhosting provider called HostsMe. Perhaps my view is too colored by the\nlate-2000s context in which I came to understand the internet industry, but\npivoting to the low barrier of entry, low chance of success shared hosting\nmarket feels like a move of desperation. In 2004, the website changed again,\nbecoming a single page of broken links with a promise that it is &quot;being\nredesigned.&quot;</p>\n<p>For this entire period, from late 2001 after the announcement of their risk\nunderwriting service to the company's complete swerve into energy from nothing,\nI can find no press mentions of Steorn or any of their projects. McCarthy seems\nto suggest that Steorn had a staff of engineers and technicians, but I struggle\nto find any names or details. Well, that was a long time ago, and of course the\nstaff are not all listed on LinkedIn. On the other hand, one of McCarthy's\ninvestors, shown a laboratory full of white-coated scientists, later came to\nsuspect they were temps hired only to create an appearance.</p>\n<p>This is not to accuse McCarthy of lying. Some details definitely check out. For\nexample, their project with Fraudhalt to detect tampering with ATMs via machine\nvision is the subject of a patent listing Sean McCarthy's name. But I do think\nthat McCarthy is prone to exaggerating his successes and, in the process,\nmuddling the details. When it comes to Steorn's most famous invention, McCarthy\nand early employee and project manager Michael Daly agree that it was an\naccidental discovery. Both tell detailed stories of a project for which Steorn\npurchased and modified small wind turbines. The trouble is that they are not\ndescribing the same project. Two different customers, two different contexts,\ntwo different objectives; but both lead to the Orbo.</p>\n<p>Other attempts at checking into the particulars of Steorn's early business lead\nin more whimsical directions. To Whyte, McCarthy described a sort of joke\nproject by Steorn to create an &quot;online excuse exchange&quot; called\nWhatsMyExcuse.com. I can't find any evidence of this project, although there's\nno particular reason I would. What I can say is that some ideas are evergreen:\nfour months ago, a Reddit user posted that they &quot;built a tiny excuse generator for\nfun.&quot; It's live right now, at whatsmyexcuse.com.</p>\n<p>In any case, the nature of Steorn around 2003 remains mysterious to me.\nMcCarthy's claims to have been a regional expert on credit card fraud are hard\nto square with the complete lack of any mention of this line of business on\nSteorn's website. On the other hand, Steorn had a confusing but clearly close\nrelationship with Fraudhalt to such an extent that I think Steorn may have gone\nlargely dormant as McCarthy spent his time with the other company.</p>\n<hr />\n<p>After five years of near silence, a period that McCarthy characterized as modest\nsuccess, Steorn captured the world's attention with what must be one of the\nboldest pivots of all time. An August 2006 full-page ad in the <em>Economist</em> began\nwith a George Bernard Shaw quote, &quot;all great truths begin as blasphemies.&quot;\n&quot;Imagine,&quot; it reads below, &quot;a world with an infinite supply of pure energy.\nNever having to recharge your phone. Never having to refuel your car.&quot;</p>\n<p>Steorn's website underwent a complete redesign, now promoting the free energy\ndevice they dubbed the Orbo. A too-credulous press went wild with the story,\nespecially in Ireland where Steorn's sudden prominence fit a narrative of a new\nIrish technology renaissance. The <em>Irish Independent</em> ran a photo of McCarthy\nkneeling on the floor beside a contraption of aluminum extrusion and wheels and\nwiring. &quot;Irish firm claims to have solved energy crisis&quot; is the headline. The\nphoto caption reminds us that it &quot;has been treated with some skepticism in the\nscientific community because it appears to contravene the laws of physics.&quot;</p>\n<p>I will not devote much time to a detailed history of the development of the\nOrbo; that topic is much better addressed by Barry Whyte's book, which benefits\ngreatly from interviews with McCarthy. The CliffsNotes <sup class=\"footnote-ref\" id=\"fnref-1\"><a href=\"#fn-1\">1</a></sup> go something like\nthis: Steorn was working on some surveillance project and wanted to power the\ncameras with small wind turbines. The exact motivations here are confusing\nsince, whichever version of the story you go with, the cameras were being\ninstalled in locations that already had readily available electrical service. It\nmay have been simple greenwashing. In any case, the project lead Steorn to\nexperimenting with modifications to off-the-shelf compact wind turbines.</p>\n<p>At some point, presumably one or two years before 2006, it was discovered that a\nmodified turbine seemed to produce more energy in output than it received as\ninput. I have not been able to find enough detail on these experiments to\nunderstand what exactly was being done, so I am limited to this vague\ndescription. Steorn at first put it out of mind, but McCarthy later returned to\nthis mystery and built a series of prototypes that further demonstrated the\neffect. A series of physicists and research teams were brought in to evaluate\nthe device. This part of the story is complicated and details conflict, but an\nopinionated summary is that entrepreneurially-inclined technology development\nexecutives tended to find the Orbo promising while academic physicists found the\nwhole thing so laughable that they declined to look at it. Trinity College\ncontained both, and in 2005 McCarthy's discussions with a technology\ncommercialization team there lead to a confrontation with physicist Michael\nCoey. From that point on, McCarthy viewed the scientific establishment as\nresistance to be overcome.</p>\n<p>McCarthy determined that the only way to bring Orbo to the world was to\ndefinitively prove that it worked, and to do so largely without outside\nexperience. For that, he would need equipment and a team. After long discussions\nwith a venture capital firm, McCarthy seems to have balked at the amount of due\ndiligence involved in such formal investment channels. Instead, he brought on a\nhaphazard series of individuals, mostly farmers, who collectively put up about\n20 million euro.</p>\n<hr />\n<p>One of the curious things about the Orbo was Steorn's emphasis on cell phone\nbatteries. I suppose it is understandable, in that ubiquitous mobile phones were\nnew at the time and the hassle of keeping them charged was suddenly a familiar\nproblem to all. It also feels like a remarkable failure of ambition. Having\ninvented a source of unlimited free energy, most of what McCarthy had to say was\nthat you wouldn't have to charge your phone any more. Sure, investment documents\naround Steorn laid out a timeline to portable generators, vehicles, standby\ngenerators for telecom applications... a practical set of concerns, sure, but\none that is rather underwhelming from the creator of the first over-unity\nenergy device.</p>\n<p>It is also, when you think about it, a curious choice. McCarthy later talked\nabout pitching the device to Apple's battery suppliers. The timeline here is a\nbit confusing, given that the iPhone launched after the period I think he was\ndiscussing, but still, it makes a good example. The first-generation iPhone was\nabout a half inch thick, hefty by today's standards but a very far cry from\nSteorn's few publicized prototypes, which occupied perhaps two feet square.\nMiniaturization is a challenge for most technologies, with the result that\npocket-portable devices are usually a late-stage application, not an early one.\nThat's especially true for an electromechanical generator, one that involves\nbearings and electromagnets and a spinning rotor. Still, it was all about\nphones.</p>\n<p>Steorn's trouble getting the attention of battery manufacturers lead them to\nseek independent validation. Turned away, as McCarthy tells it, by university\nphysics departments and industrial laboratories, Steorn came up with an\nunconventional plan. In the 2006 <em>Economist</em> advertisement, they announced\n&quot;The Challenge.&quot; Steorn was recruiting scientists and engineers to form a\npanel of independent jurors who would evaluate the technology. You could apply\nat steorn.com. Nearly 500 people did.</p>\n<p>The steorn.com of the Orbo era is a fascinating artifact. It has a daily poll in\na sidebar, just for some interactive fun. You could apply for the scientific\njury, or just sign up to express your interest in the technology. Most\nintriguingly, though, there was a forum.</p>\n<p>This is some intense mid-2000s internet. There was a time when it just made\nsense for every website to have a forum; I guess the collective internet\nindustry hadn't yet learned that user-generated content is, on average, about as\ngood as toxic waste, and that giving the general public the ability to publish\ntheir opinions under your brand is rarely a good business decision.  Still,\nSteorn did, and what few threads of the steorn.com discussion forum survive in\nthe Internet Archive are a journey through a bygone era. Users have the obvious\narguments: is Orbo real, or a scam? They have the less obvious arguments, over\neach other's writing styles. There is a thread for testing BBCode. A few\noveractive users appear seemingly everywhere, always hostile and dismissive.\nAn occasional thread will become suddenly, shockingly misogynistic. This is, of\ncourse, the soup we all grew up in.</p>\n<p>The forum exemplifies one of the things that I find most strange about Steorn.\nThe company was often obsessively secret, apparently working on the Orbo\ntechnology in quiet for years, but it was also incredibly bold, choosing a\nfull-page ad for a publicity stunt as their first public announcement.  McCarthy\nwas well aware that the scientific establishment viewed him as a fraud, by this\ntime individual investors seemed to be growing skeptical, and yet they had a\ndiscussion forum.</p>\n<hr />\n<p>The late years of Steorn are best summarized as a period of humiliation. In\n2007, the company promised a public demonstration of the Orbo at a science\nmuseum in London. I remember following this news in real time: the announcement\nof the demonstration triggered a new round of press coverage, and then it was\ncanceled before it even began. Steorn claimed that the lighting in the museum\nhad overheated the device and damaged it. The public mostly laughed.</p>\n<p>In 2009, Steorn arranged a second public demonstration, the one at the Waterways\nVisitors Centre in Dublin. This one actually happened, but the device clearly\nincorporated a battery and Steorn didn't allow any meaningful level of\ninspection. The demonstration proved nothing but that Steorn could use a battery\nto make a wheel spin, hardly a world-changing innovation. Not even a way to\ncharge a phone.</p>\n<p>Later that same year, The Challenge came to its close. The independent jury of\nexperts, after meetings, demonstrations, experiments, and investigations,\nreturned its verdict. The news was not good. Jurors unanimously approved a\nstatement that Steorn had not shown any evidence of energy production.</p>\n<p>When something is as overhyped and underdeveloped as the Orbo, when a company\nclaims the impossible and still attracts millions, you sort of expect a dramatic\nfailure. Surely, you cannot just claim to have created a source of free energy\nand then wander on through life as usual. Or, perhaps you can. In 2010,\nsteorn.com gained the Developer Community, where you could pay a licensing fee\nfor access to information on the Steorn technology.</p>\n<p>Even the mobile phones were not abandoned. In 2015, Steorn mounted another\ndemonstration, of a sort. A small Orbo device, now apparently solid-state, was\ndisplayed supposedly charging a phone in a Dublin pub. A lot of big claims are\nmade and tested in pubs, but few with so much financial backing. Steorn had\nbeen reduced to a story told over beer and the internet: at the end of 2015,\nMcCarthy announced via Facebook that an Orbo phone and phone charger would soon\ngo on sale. The charger, the Orbo Cube, ran €1,200 and was due to ship within\nthe month.</p>\n<p>As far as I can tell, these devices were actually completely unrelated to the\noriginal Orbo. The &quot;solid-state Orbo&quot; was completely novel design, to the extent\nthat you would call it a design. Some units did ship, and reverse engineering\nefforts revealed an eccentric set of components including two alkaline 9v\nbatteries and shrinkwrapped mystery cells that have the appearance of capacitors\nbut are, supposedly, proprietary components relying on some kind of magnetic\neffect. It's hard to find much solid information about these devices, I think\nvery few were made and they shipped mostly to &quot;friendly&quot; customers.  It is said\nthat many of them failed to work at all, the result of an acknowledged quality\ncontrol problem with the clearly handmade interior. There is a lot of electrical\ntape involved. Like a lot. And some potting compound, but mostly electrical\ntape. The two I've found detailed accounts of failed to charge a phone even when\nnew out of the box.</p>\n<p>Through this whole period, Steorn was still McCarthy's day job, at least on\npaper. But he had turned towards a new way to make money: poker. Starting around\n2015, McCarthy became a professional poker player, apparently his main form of\nincome to this day.  He announced that Steorn would be liquidated in 2017; it\nwas finally dissolved in 2024.</p>\n<hr />\n<p>History is replete with perpetual motion machines. There are rumors of some sort\nof machine in the 8th century, although questions about the historicity of these\naccounts lead to difficult questions around what makes a perpetual motion\nmachine &quot;real.&quot; Of the many putative free energy sources of history, many have\ninvolved some configuration of magnets. I can understand why: magnets offer just\nthe right combination of the mysterious and the relatable. They seem to work as\nif by magic, and yet, they are physical objects that we can hold and manipulate.\nYou can see how someone might develop an intuitive understanding of magnetic\nbehavior, extend it to an impossible idea, and remain quite convinced of their\ndiscovery.</p>\n<p>If perpetual motion machines are a dime a dozen, why does the story of Steorn so\nfascinate me? I think that it has many parallels to our situation today. The\nOrbo is not merely the product of a deluded inventor, it's the product of a\nperiod of Irish economic history. Whyte's book is focused primarily on this\naspect of the story. He articulates how the overstuffed, overhyped Irish economy\nof the 2000s, a phenomenon known as the Celtic Tiger, created an environment in\nwhich just about any claim could raise millions---no matter how outlandish.</p>\n<p>And here we are today, with some of the largest components of our economy run by\npeople who fashion themselves as technical experts but have backgrounds mostly\nin business. They, too, are collecting money on the premise that they may build\na world-changing technology---AGI.</p>\n<p>Sure, this analogy is imperfect in many ways. But I think it is instructive. Sean\nMcCarthy wrote of Steorn's early days:</p>\n<blockquote>\n<p>It was just a gold rush: if you weren't doing web, you didn't exist. So, a\nbanana import-export business needs to invest millions in e-commerce. They\nprobably did need to invest, but it was driven, in  my opinion, by all of\nthese companies driving their share price up by doing something on the web\nrather than by any real business cases.</p>\n</blockquote>\n<p>The dotcom boom and bust was an embarrassment to the computer industry, and it\nwas also a pivotal moment in its growth. E-commerce, the graveyard of many '90s\nbusinesses, is one of the pillars of modern life. The good days of easy money\ncan be an incubator for important ideas. They can also be an incubator for\nidiocy.</p>\n<p>Whenever I read about some historic scam, I always wonder about the people at\nthe top. Was Sean McCarthy a fraud, or was he deluded? Did he play up the Orbo\nto keep the money coming in, or did he really believe that he just needed one\nmore demonstration?</p>\n<p>Whyte's book takes a strong position for the latter, that McCarthy had the best\nintentions and got in over his head. He still believes in Orbo, to this day. Of\ncourse, Whyte is far more sympathetic than I find myself. The book is almost\nhalf written by McCarthy himself in the form of its lengthy excerpts from his\nstatements. I am more cynical, I think that McCarthy must have known things were\ngoing sideways well before he shipped out broken power banks with nine volt\nbatteries covered in electrical tape. I don't think he started out that way,\nthough.</p>\n<p>I think he started out with the best intentions: the leader of a moderately\nsuccessful tech company, one that wasn't getting much business but had ready\naccess to capital. He went fishing for ideas, for opportunities for growth, and\nhe hooked the biggest of them all. A world-changing idea, one so profound that\nhe himself struggled to understand its implications. An impossible dream of not\nhaving to charge his phone. To sustain the company, he had to bring in money.\nTo bring in money, he had to double down. Perpetual motion was always just\naround the corner.</p>\n<p>I believe that McCarthy is a con man, in that he has too much confidence. It's a\ntrait that makes for a good poker player. McCarthy saw something remarkable,\nperhaps an error in measurement or an error in understanding. He placed a bet,\nand spent the next decade pushing more money into the pot, trying to make it\nwork out. I would hope that our industry has learned to be more cautious, but\nthen, we're only human. We watched the wheels spin, faster and faster, and we\nconvince ourselves that they can spin forever.</p>\n<div class=\"footnotes\">\n<ol>\n<li id=\"fn-1\">\n<p>CliffsNotes was a primitive technology for summarizing large texts, which\nrelied mostly on humans to do the summarization. Since summarizing texts has\nsince become the primary focus of the US economy, the process has become more\nautomated but does not necessarily produce better results.<a class=\"footnote\" href=\"#fnref-1\">&#8617;</a></p></li>\n</ol>\n</div>",
  "id": "https://computer.rip/2025-10-28-the-steorn-orbo.html"
}