{
  "title": "Attention Media ≠ Social Networks",
  "link": "https://susam.net/attention-media-vs-social-networks.html",
  "published": "Tue, 20 Jan 2026 00:00:00 +0000",
  "summary": "<p>\n  When web-based social networks started flourishing nearly two\n  decades ago, they were genuinely social networks.  You would sign up\n  for a popular service, follow people you knew or liked and read\n  updates from them.  When you posted something, your followers would\n  receive your updates as well.  Notifications were genuine.  The\n  little icons in the top bar would light up because someone had sent\n  you a direct message or engaged with something you had posted.\n  There was also, at the beginning of this millennium, a general sense\n  of hope and optimism around technology, computers and the Internet.\n  Social networking platforms were one of the services that were part\n  of what was called Web 2.0, a term used for websites built around\n  user participation and interaction.  It felt as though the\n  information superhighway was finally reaching its potential.  But\n  sometime between 2012 and 2016, things took a turn for the worse.\n</p>\n<p>\n  First came the infamous infinite scroll.  I remember feeling uneasy\n  the first time a web page no longer had a bottom.  Logically, I knew\n  very well that everything a browser displays is a virtual construct.\n  There is no physical page.  It is just pixels pretending to be one.\n  Still, my brain had learned to treat web pages as objects with a\n  beginning and an end.  The sudden disappearance of that end\n  disturbed my sense of ease.\n</p>\n<p>\n  Then came the bogus notifications.  What had once been meaningful\n  signals turned into arbitrary prompts.  Someone you followed had\n  posted something unremarkable and the platform would surface it as a\n  notification anyway.  It didn't matter whether the notification was\n  relevant to me.  The notification system stopped serving me and\n  started serving itself.  It felt like a violation of an unspoken\n  agreement between users and services.  Despite all that, these\n  platforms still remained social in some diluted sense.  Yes, the\n  notifications were manipulative, but they were at least about people\n  I actually knew or had chosen to follow.  That, too, would change.\n</p>\n<p>\n  Over time, my timeline contained fewer and fewer posts from friends\n  and more and more content from random strangers.  Using these\n  services began to feel like standing in front of a blaring\n  loudspeaker, broadcasting fragments of conversations from all over\n  the world directly in my face.  That was when I gave up on these\n  services.  There was nothing social about them anymore.  They had\n  become <em>attention media</em>.  My attention is precious to me.  I\n  cannot spend it mindlessly scrolling through videos that have\n  neither relevance nor substance.\n</p>\n<p>\n  But where one avenue disappeared, another emerged.  A few years ago,\n  I stumbled upon Mastodon and it reminded me of the early days of\n  Twitter.  Back in 2006, I followed a small number of folks of the\n  nerd variety on Twitter and received genuinely interesting updates\n  from them.  But when I log into the ruins of those older platforms\n  now, all I see are random videos presented to me for reasons I can\n  neither infer nor care about.  Mastodon, by contrast, still feels\n  like social networking in the original sense.  I follow a small\n  number of people I genuinely find interesting and I receive their\n  updates and only their updates.  What I see is the result of my own\n  choices rather than a system trying to optimise my behaviour.  There\n  are no bogus notifications.  The timeline feels calm and\n  predictable.  If there are no new updates from people I follow,\n  there is nothing to see.  It feels closer to how social networks\n  used to work originally.  I hope it stays that way.\n</p>\n<!-- ### -->\n<p>\n  <a href=\"https://susam.net/attention-media-vs-social-networks.html\">Read on website</a> |\n  <a href=\"https://susam.net/tag/miscellaneous.html\">#miscellaneous</a>\n</p>",
  "id": "amnsm"
}