{
  "title": "My Coding Adventures in 2025",
  "link": "https://susam.net/code-2025.html",
  "published": "Wed, 24 Dec 2025 00:00:00 +0000",
  "summary": "<p>\n  In this post, I return with a retrospective on my coding adventures,\n  where I summarise my hobby projects and recreational programming\n  activities from the current year.  I did the last such retrospective\n  in <a href=\"code-2023.html\">2023</a>.  So I think this is a good\n  time to do another retrospective.\n</p>\n<p>\n  At the outset, I should mention that I have done less hobby\n  computing this year than in the past few, largely because I spent a\n  substantial portion of my leisure time studying Galois theory and\n  algebraic graph theory.  In case you are wondering where I am\n  learning these subjects from, the books are <em>Galois Theory</em>,\n  5th ed. by Ian Stewart and <em>Algebraic Graph Theory</em> by Godsil\n  and Royle.  Both are absolutely fascinating subjects and the two\n  books I mentioned are quite good as well.  I highly recommend them.\n</p>\n<p>\n  Now back to the coding adventures.  Here they go:\n</p>\n<ul>\n  <li>\n    <p>\n      <a href=\"https://github.com/susam/mathb\">MathB</a>: The year\n      began not with the release of a new project but with the\n      opposite: discontinuing a project I had maintained for 13 years.\n      MathB.in, a mathematics pastebin service, was discontinued early\n      this year.  This is a project I developed in 2012 for myself and\n      my friends.  Although a rather simple project, it was close to\n      my heart, as I have many fond memories of exchanging\n      mathematical puzzles and solutions with my friends using this\n      service.  Over time, the project grew quite popular on IRC\n      networks, as well as in some schools and universities, where IRC\n      users, learners and students used the service to share problems\n      and solutions with one another, much as my friends and I had\n      done in its early days.\n    </p>\n    <p>\n      I shut it down this year because I wanted to move on from the\n      project.  Before the shutdown, a kind member of the\n      <a href=\"https://wiki.archiveteam.org/\">Archive Team</a> worked\n      with me to\n      <a href=\"https://web.archive.org/web/*/https://mathb.in/\">archive</a>\n      all posts from the now-defunct website.  Although shutting down\n      this service was a bittersweet event for me, I feel relieved\n      that I no longer have to run a live service in my spare time.\n      While this was a good hobby ten years ago, it no longer is.  See\n      my blog post\n      <a href=\"mathbin-is-shutting-down.html\">MathB.in Is Shutting\n      Down</a> for more details on the reasons behind this decision.\n      The source code of this project remains open source and\n      available at\n      <a href=\"https://github.com/susam/mathb\">github.com/susam/mathb</a>.\n    </p>\n  </li>\n  <li>\n    <p>\n      <a href=\"https://github.com/susam/quickqwerty\">QuickQWERTY</a>:\n      This is a touch-typing tutor that runs in a web browser.  I\n      originally developed it in 2008 for myself and my friends.\n      While I learnt touch typing on an actual typewriter as a child,\n      those lessons did not stick with me.  Much later, while I was at\n      university, I came across a Java applet-based touch-typing tutor\n      that finally helped me learn touch typing properly.  I disliked\n      installing Java plugins in the web browser, which is why I later\n      developed this project in plain HTML and JavaScript.  This year,\n      I carried out a major refactoring to collapse the entire project\n      into a single standalone HTML file with no external\n      dependencies.  The source code has been greatly simplified as\n      well.\n    </p>\n    <p>\n      When I was younger and more naive, inspired by the complexity\n      and multiple layers of abstraction I saw in popular open source\n      and professional projects, I tended to introduce similar\n      abstractions and complexity into my personal projects.  Over\n      time, however, I began to appreciate simplicity.  The new code\n      for this project is smaller and simpler.  I am quite happy with\n      the end result.  You can take a look at the code here:\n      <a href=\"https://github.com/susam/quickqwerty/blob/main/quickqwerty.html\">quickqwerty.html</a>.\n      If you want to use the typing tutor, go here:\n      <a href=\"quickqwerty.html\">QuickQWERTY</a>.  Unfortunately, it\n      does not support keyboard layouts other than QWERTY.  When I\n      originally developed this project, my view of the computing\n      world was rather limited.  I was not even aware that other\n      keyboard layouts existed.  You are, however, very welcome to\n      fork the project and adapt the lessons for other layouts.\n    </p>\n  </li>\n  <li>\n    <p>\n      <a href=\"https://github.com/susam/cfrs\">CFRS[]</a>: This project\n      was my first contribution to the quirky world of esolangs.\n      CFRS[] is an extremely minimal drawing language consisting of\n      only six simple commands: <code>C</code>, <code>F</code>,\n      <code>R</code>, <code>S</code>, <code>[</code> and\n      <code>]</code>.  I developed it in 2023 and have since been\n      maintaining it with occasional bug fixes.  This year, I\n      <a href=\"https://github.com/susam/cfrs/commit/9bae21f\">fixed an\n      annoying bug</a> that caused the drawing canvas to overflow on\n      some mobile web browsers.  A new demo also arrived from the\n      community this year and has now been added to the community demo\n      page.  See\n      <a href=\"https://susam.github.io/cfrs/demo.html#glimmering-galaxy\">Glimmering\n      Galaxy</a> for the new demo.  If you want to play with CFRS[]\n      now, visit <a href=\"cfrs.html\">CFRS[]</a>.\n    </p>\n  </li>\n  <li>\n    <p>\n      <a href=\"https://github.com/susam/fxyt\">FXYT</a>: This is\n      another esolang project of mine.  This too is a minimal drawing\n      language, though not as minimal as CFRS[].  Instead, it is a\n      stack-based, postfix canvas colouring language with only 36\n      simple commands.  The canvas overflow bug described in the\n      previous entry affected this project as well.  That has now been\n      fixed.  Further, by popular demand, the maximum allowed code\n      length has been increased from 256 bytes to 1024 bytes.  This\n      means there is now more room for writing more complex FXYT\n      programs.  Additionally, the maximum code length for\n      distributable demo links has been increased from 64 bytes to 256\n      bytes.  This allows several more impressive demos to have their\n      own distributable links.  Visit <a href=\"fxyt.html\">FXYT</a> to\n      try it out now.  See also the\n      <a href=\"https://susam.github.io/fxyt/demo.html\">Community Demos</a> to\n      view some fascinating artwork created by the community.\n    </p>\n  </li>\n  <li>\n    <p>\n      <a href=\"https://github.com/susam/nq\">Nerd Quiz</a>: This is a\n      new project I created a couple of months ago.  It is a simple\n      HTML tool that lets you test your nerdiness through short\n      quizzes.  Each question is drawn from my everyday moments of\n      reading, writing, thinking, learning and exploring.  The project\n      is meant to serve as a repository of interesting facts I come\n      across in daily life, captured in the form of quiz questions.\n      Go here to try it out: <a href=\"nq.html\">Nerd Quiz</a>.  I hope\n      you will enjoy these little bits of knowledge as much as I\n      enjoyed discovering them.\n    </p>\n  </li>\n  <li>\n    <p>\n      <a href=\"primegrid.html\">Prime Number Grid Explorer</a>: This is\n      a simple prime number grid visualiser I wrote for fun.  It plots\n      the prime numbers in a grid where you can set the number of rows\n      and the number of columns.  It uses the Miller-Rabin primality\n      test with bases drawn from\n      <a href=\"https://oeis.org/A014233\">oeis.org/A014233</a> to\n      determine whether a number is prime.  This allows it to\n      accurately test whether a number is prime up to\n      3317044064679887385961980.  For example,\n      <a href=\"primegrid.html#3317044064679887385961781-20-10\">this\n      grid</a> shows the upper limit of the numbers this tool can\n      check.  The three circles displayed there represent the prime\n      numbers 3317044064679887385961783, 3317044064679887385961801 and\n      3317044064679887385961813.\n    </p>\n  </li>\n  <li>\n    <p>\n      <a href=\"https://github.com/susam/mvs\">Mark V. Shaney\n      Junior</a>: Finally, I have my own Markov gibberish generator.\n      Always wanted to have one.  The project is inspired by the\n      legendary Usenet bot named Mark V. Shaney that used to post\n      messages to various newsgroups in the 1980s.  My Markov chain\n      program is written in about 30 lines of Python.  I ran it on my\n      24 years of blog posts consisting of over 200 posts and about\n      200,000 words and it generated some pretty interesting\n      gibberish.  See my blog post\n      <a href=\"fed-24-years-of-posts-to-markov-model.html\">Fed 24\n      Years of My Posts to Markov Model</a> to see the examples.\n    </p>\n  </li>\n  <li>\n    <p>\n      <a href=\"elliptical-python-programming.html\">Elliptical Python\n      Programming</a>: If the previous item was not silly enough, this\n      one surely is.  Earlier this year, I wrote a blog post\n      describing the fine art of Python programming using copious\n      amounts of ellipses.  I will not discuss it further here to\n      avoid spoilers.  I'll just say that any day I'm able to do\n      something pointless, whimsical and fun with computers is a good\n      day for me.  And it was a good day when I wrote this post.\n      Please visit the link above to read the post.  I hope you find\n      it fun.\n    </p>\n  </li>\n  <li>\n    <p>\n      <a href=\"fizz-buzz-with-cosines.html\">Fizz Buzz with\n      Cosines</a>: Another silly post in which I explain how to\n      compute the discrete Fourier transform of the Fizz Buzz sequence\n      and derive a closed-form expression that can be used to print\n      the sequence.\n    </p>\n  </li>\n  <li>\n    <p>\n      <a href=\"fizz-buzz-in-css.html\">Fizz Buzz in CSS</a>: Yet\n      another Fizz Buzz implementation, this time using just four\n      lines of CSS.\n    </p>\n  </li>\n</ul>\n<p>\n  That wraps up my coding adventures for this year.  There were fewer\n  hobby projects than usual but I enjoyed spending more time learning\n  new things and revisiting old ones.  One long-running project came\n  to an end, another was cleaned up and a few small new ideas appeared\n  along the way.  Looking forward to what the next year brings.\n</p>\n<!-- ### -->\n<p>\n  <a href=\"https://susam.net/code-2025.html\">Read on website</a> |\n  <a href=\"https://susam.net/tag/programming.html\">#programming</a> |\n  <a href=\"https://susam.net/tag/technology.html\">#technology</a> |\n  <a href=\"https://susam.net/tag/retrospective.html\">#retrospective</a>\n</p>",
  "id": "cdtwf"
}