{
  "title": "The Don’t “Contact Us” Page",
  "link": "https://blog.jim-nielsen.com/2026/dont-contact-us-page/",
  "published": "Wed, 28 Jan 2026 19:00:00 GMT",
  "summary": "<p><a href=\"https://www.nicchan.me/blog/the-f-off-contact-page/\">Nic Chan comes out as the whistleblower</a> on how many “Contact Us” pages are made (spoiler: they’re designed to keep us from contacting anyone).</p>\n<blockquote>\n<p>A “fuck off contact page” is what a company throws together when they actually don’t want anyone to contact them at all. They […] are trying to reduce the amount of money they spend on support by carefully hiding the real support channels […] If you solve your own problem by reading the knowledge base, then this is a win for the company. They don’t want to hear from you, they want you to fuck off.</p>\n</blockquote>\n<p>It’s true. This is how the proverbial sausage is made. I’ve been there. I’ve seen these decisions handed down. Which means, like Chan, I know how to read between the lines of most “Contact Us” pages on the internet.</p>\n<blockquote>\n<p>I’m not sure about you, but as a user, when I see [these kinds of pages], knowing that whatever my original query was, [I know] I’m going to have to solve it unassisted.</p>\n</blockquote>\n<p>My process follows this arc:</p>\n<ul>\n<li>I have a question.</li>\n<li>Go to the company’s “Contact Us” page.</li>\n<li>Immediately intuit from the design of the page whether I’m actually going to be able to contact someone and get help, or if I’m on my own.</li>\n</ul>\n<p><a href=\"https://blog.jim-nielsen.com/2025/everything-is-broken/\">A direct line to a human is the ultimate luxury in today’s world.</a></p>\n<blockquote>\n<p>The project finished on time, everyone got paid, and the client was happy with the end result, but I still felt very disappointed in the whole thing. </p>\n</blockquote>\n<p>So it goes.</p>\n<hr />\n<p>There’s <a href=\"https://www.youtube.com/watch?v=IojqOMWTgv8\">a scene from <em>The Matrix</em></a> that kept echoing in my head while reading Chan’s post.</p>\n<p>There are contact pages, my friends. Endless “Contact Us” pages.</p>\n<p>Where human beings no longer exist.</p>\n<p>For a long time I probably wouldn’t have believed it, and then I saw the pages made with my own eyes. Watched them remove the ability for human beings to contact one another.</p>\n<p>And standing there, facing the pure, automated precision of it all, I came to realize the obviousness of the truth.</p>\n<p>What is the “Contact Us” page?</p>\n<p>Cost savings.</p>\n<p>The “Contact Us” page is a computer-generated dream world, built to keep us from contacting another human in order to save cost and turn a human being into this: a source of revenue.</p>\n\n    <hr />\n    \n\n    <p>\n      Reply via:\n      \n\n      <a href=\"mailto:jimniels%2Bblog@gmail.com?subject=Re:%20blog.jim-nielsen.com/2026/dont-contact-us-page/\">Email</a>\n      · <a href=\"https://mastodon.social/@jimniels\">Mastodon</a> ·\n\n      <a href=\"https://bsky.app/profile/jim-nielsen.com\">Bluesky</a>\n    </p>",
  "id": "https://blog.jim-nielsen.com/2026/dont-contact-us-page/"
}