{
  "title": "A CT scanner reveals surprises inside the 386 processor's ceramic package",
  "link": "http://www.righto.com/2025/08/intel-386-package-ct-scan.html",
  "published": "2025-08-09T09:08:00.000-07:00",
  "summary": "<p>Intel released the 386 processor in 1985, the first 32-bit chip in the x86 line.\nThis chip was packaged in a ceramic square with 132 gold-plated pins protruding from the underside, fitting into\na socket on the motherboard.\nWhile this package may seem boring, a lot more is going on inside it than you might expect.\n<a href=\"https://www.lumafield.com/\">Lumafield</a> performed a 3-D CT scan of the chip for me, revealing six layers of complex\nwiring hidden inside the ceramic package.\nMoreover, the chip has nearly invisible metal wires connected to the <em>sides</em> of the package, the spikes below.\nThe scan also revealed that the 386 has two separate power and ground networks: one for I/O and one for the CPU's logic.</p>\n<p><a href=\"https://static.righto.com/images/386-package/scan-top.jpg\"><img alt=\"A CT scan of the 386 package. The ceramic package doesn't show up in this image, but it encloses the spiky wires.\" class=\"hilite\" height=\"489\" src=\"https://static.righto.com/images/386-package/scan-top-w500.jpg\" title=\"A CT scan of the 386 package. The ceramic package doesn't show up in this image, but it encloses the spiky wires.\" width=\"500\" /></a><div class=\"cite\">A CT scan of the 386 package. The ceramic package doesn't show up in this image, but it encloses the spiky wires.</div></p>\n<p>The package, below, provides no hint of the complex wiring embedded inside the ceramic.\nThe silicon die is normally not visible, but I removed the square metal lid that covers it.<span id=\"fnref:chisel\"><a class=\"ref\" href=\"#fn:chisel\">1</a></span>\nAs a result, you can also see the two tiers of gold contacts that surround the silicon die.</p>\n<p><a href=\"https://static.righto.com/images/386-package/package-opened.jpg\"><img alt=\"The 386 package with the lid over the die removed.\" class=\"hilite\" height=\"371\" src=\"https://static.righto.com/images/386-package/package-opened-w400.jpg\" title=\"The 386 package with the lid over the die removed.\" width=\"400\" /></a><div class=\"cite\">The 386 package with the lid over the die removed.</div></p>\n<p>Intel selected the 132-pin ceramic package to meet the requirements of a high pin count, good thermal characteristics,\nand low-noise power to the die.<span id=\"fnref:requirements\"><a class=\"ref\" href=\"#fn:requirements\">2</a></span>:\nHowever, standard packages didn't provide sufficient power, so Intel designed a custom package with\n\"single-row double shelf bonding to two signal layers and four power and ground planes.\"\nIn other words, the die's bond wires are connected to the two shelves (or tiers) of pads surrounding the die.\nInternally, the package is like a 6-layer printed-circuit board made from ceramic.</p>\n<p><a href=\"https://static.righto.com/images/386-package/package-cross-section.jpg\"><img alt=\"Package cross-section. Redrawn from &quot;High Performance Technology, Circuits and Packaging for the 80386&quot;.\" class=\"hilite\" height=\"179\" src=\"https://static.righto.com/images/386-package/package-cross-section-w600.jpg\" title=\"Package cross-section. Redrawn from &quot;High Performance Technology, Circuits and Packaging for the 80386&quot;.\" width=\"600\" /></a><div class=\"cite\">Package cross-section. Redrawn from \"High Performance Technology, Circuits and Packaging for the 80386\".</div></p>\n<p>The photo below shows the two tiers of pads with tiny gold bond wires attached: I measured the bond wires at 35 µm in diameter, thinner than a typical human hair.\nSome pads have up to five wires attached to support more current for the power and ground pads.\nYou can consider the package to be a hierarchical interface from the tiny circuits on the die to the\nmuch larger features of the computer's motherboard.\nSpecifically, the die has a feature size of 1 µm,\nwhile the metal wiring on top of the die has 6 µm spacing.\nThe chip's wiring connects to the chip's bond pads, which have 0.01\" spacing (.25 mm).\nThe bond wires connect to the package's pads, which have 0.02\" spacing (.5 mm); double the spacing because there are two tiers.\nThe package connects these pads to the pin grid with 0.1\" spacing (2.54 mm).\nThus, the scale expands by about a factor of 2500 from the die's microscopic circuitry to the chip's pins.\n`</p>\n<p><a href=\"https://static.righto.com/images/386-package/bonding.jpg\"><img alt=\"Close-up of the bond wires.\" class=\"hilite\" height=\"415\" src=\"https://static.righto.com/images/386-package/bonding-w500.jpg\" title=\"Close-up of the bond wires.\" width=\"500\" /></a><div class=\"cite\">Close-up of the bond wires.</div></p>\n<p>The ceramic package is manufactured through a complicated process.<span id=\"fnref:manufacturing\"><a class=\"ref\" href=\"#fn:manufacturing\">4</a></span>\nThe process starts with flexible ceramic \"green sheets\", consisting of ceramic powder mixed with a binding agent.\nAfter holes for vias are created in the sheet, tungsten paste is silk-screened onto the sheet to form the wiring.\nThe sheets are stacked, laminated under pressure, and then sintered at high temperature (1500ºC to 1600ºC)\nto create the rigid ceramic.\nThe pins are brazed onto the bottom of the chip.\nNext, the pins and the inner contacts for the die are electroplated with gold.<span id=\"fnref:gold\"><a class=\"ref\" href=\"#fn:gold\">3</a></span>\nThe die is mounted, gold bond wires are attached, and a metal cap is soldered over the die to encapsulate it.\nFinally, the packaged chip is tested, the package is labeled, and the chip is ready to be sold.</p>\n<p>The diagram below shows a close-up of a signal layer inside the package. \nThe pins are connected to the package's shelf pads through metal traces, spectacularly colored in the CT scan.\n(These traces are surprisingly wide and free-form; I expected narrower traces to reduce capacitance.)\nBond wires connect the shelf pads to the bond pads on the silicon die.\n(The die image is added to the diagram; it is not part of the CT scan.)\nThe large red circles are vias from the pins. Some vias connect to this signal layer, while other vias pass through to\nother layers.\nThe smaller red circles are connections to a power layer; because the shelf pads are only on the two signal layers,\nthe six power planes have connections to the signal layers for bonding.\nSince bond wires are only connected on the signal layers, the power layers need connections to pads on the signal\nlayers.</p>\n<p><a href=\"https://static.righto.com/images/386-package/signal-layer-diagram.jpg\"><img alt=\"A close-up of a signal layer. The die image is pasted in.\" class=\"hilite\" height=\"415\" src=\"https://static.righto.com/images/386-package/signal-layer-diagram-w450.jpg\" title=\"A close-up of a signal layer. The die image is pasted in.\" width=\"450\" /></a><div class=\"cite\">A close-up of a signal layer. The die image is pasted in.</div></p>\n<p>The diagram below shows the corresponding portion of a power layer.\nA power layer looks completely different from a signal layer; it is a single conductive plane with holes.\nThe grid of smaller holes allows the ceramic above and below this layer to bond, forming a solid piece of ceramic.\nThe larger holes surround pin vias (red dots), allowing pin connections to pass through to a different layer.\nThe red dots that contact the sheet are where power pins connect to this layer.\nBecause the only connections to the die are from the signal layers, the power layers have connections to the\nsignal layers; these are the smaller dots near the bond wires, either power vias passing through or vias connected\nto this layer.</p>\n<p><a href=\"https://static.righto.com/images/386-package/power-layer-diagram.jpg\"><img alt=\"A close-up of a power layer, specifically I/O Vss. The wavy blue regions are artifacts from neighboring layers. The die image is pasted in.\" class=\"hilite\" height=\"417\" src=\"https://static.righto.com/images/386-package/power-layer-diagram-w450.jpg\" title=\"A close-up of a power layer, specifically I/O Vss. The wavy blue regions are artifacts from neighboring layers. The die image is pasted in.\" width=\"450\" /></a><div class=\"cite\">A close-up of a power layer, specifically I/O Vss. The wavy blue regions are artifacts from neighboring layers. The die image is pasted in.</div></p>\n<p>With the JavaScript tool below, you can look at the package, layer by layer. Click on a radio button to select a layer.\nBy observing the path of a pin through the layers, you can see where it ends up. For instance, the upper left\npin passes through multiple layers until the upper signals layer connects it to the die. The pin to its right\npasses through all the layers until it reaches the logic Vcc plane on top.\n(Vcc is the 5-volt supply that powers the chip, called Vcc for historical reasons.)</p>\n\n<p><label for=\"layer0\"><input id=\"layer0\" name=\"layer\" type=\"radio\" />Pins</label>\n<label for=\"layer1\"><input id=\"layer1\" name=\"layer\" type=\"radio\" />I/O Vcc</label>\n<label for=\"layer2\"><input checked=\"checked\" id=\"layer2\" name=\"layer\" type=\"radio\" />Signals</label>\n<label for=\"layer3\"><input id=\"layer3\" name=\"layer\" type=\"radio\" />I/O gnd</label>\n<label for=\"layer4\"><input id=\"layer4\" name=\"layer\" type=\"radio\" />Signals</label>\n<label for=\"layer5\"><input id=\"layer5\" name=\"layer\" type=\"radio\" />Logic gnd</label>\n<label for=\"layer6\"><input id=\"layer6\" name=\"layer\" type=\"radio\" />Logic Vcc</label>\n<br />\n<img id=\"stack\" src=\"https://static.righto.com/images/386-package/layer2.jpg\" style=\"width: 100%;\" /></p>\n<p>If you select the logic Vcc plane above, you'll see a bright blotchy square in the center.\nThis is not the die itself, I think, but the adhesive that attaches the die to the package, epoxy filled with\nsilver to provide thermal and electrical conductivity. Since silver blocks X-rays, it is highly visible in the image.</p>\n<h2>Side contacts for electroplating</h2>\n<p>What surprised me most about the scans was seeing wires that stick out to the sides of the package.\nThese wires are used during manufacturing when the pins are electroplated with gold.<span id=\"fnref:electroplating\"><a class=\"ref\" href=\"#fn:electroplating\">5</a></span>\nIn order to electroplate the pins, each pin must be connected to a negative voltage so it can function as a cathode.\nThis is accomplished by giving each pin a separate wire that goes to the edge of the package.</p>\n<p>This diagram below compares the CT scan (above) to a visual side view of the package (below).\nThe wires are almost invisible, but can be seen as darker spots.\nThe arrows show how three of these spots match with the CT scan; you can match up the other spots.<span id=\"fnref:multimeter\"><a class=\"ref\" href=\"#fn:multimeter\">6</a></span></p>\n<p><a href=\"https://static.righto.com/images/386-package/edge-contacts.jpg\"><img alt=\"A close-up of the side of the package compared to the CT scan, showing the edge contacts. I lightly sanded the edge of the package to make the contacts more visible. Even so, they are almost invisible.\" class=\"hilite\" height=\"389\" src=\"https://static.righto.com/images/386-package/edge-contacts-w500.jpg\" title=\"A close-up of the side of the package compared to the CT scan, showing the edge contacts. I lightly sanded the edge of the package to make the contacts more visible. Even so, they are almost invisible.\" width=\"500\" /></a><div class=\"cite\">A close-up of the side of the package compared to the CT scan, showing the edge contacts. I lightly sanded the edge of the package to make the contacts more visible. Even so, they are almost invisible.</div></p>\n<h2>Two power networks</h2>\n<p>According to the datasheet, the 386 has 20 pins connected to +5V power (Vcc) and 21 pins connected to ground (Vss).\nStudying the die, I noticed that the I/O circuitry in the 386 has separate power and ground connections from the\nlogic circuitry.\nThe motivation is that the output pins require high-current driver circuits.\nWhen a pin switches from 0 to 1 or vice versa, this can cause a spike on the power and ground wiring.\nIf this spike is too large, it can interfere with the processor's logic, causing malfunctions.\nThe solution is to use separate power wiring inside the chip for the I/O circuitry and for the logic circuitry,\nconnected to separate pins.\nOn the motherboard, these pins are all connected to the same power and ground, but decoupling capacitors absorb\nthe I/O spikes before they can flow into the chip's logic.</p>\n<p>The diagram below shows how the two power and ground networks look on the die, with separate pads and wiring.\nThe square bond pads are at the top, with dark bond wires attached.\nThe white lines are the two layers of metal wiring, and the darker regions are circuitry.\nEach I/O pin has a driver circuit below it, consisting of relatively large transistors to pull the pin high or low.\nThis circuitry is powered by the horizontal lines for\nI/O Vcc (light red) and I/O ground (Vss, light blue).\nUnderneath each I/O driver is a small logic circuit, powered by thinner\nVcc (dark red) and Vss (dark blue).\nThicker Vss and Vcc wiring goes to the logic in the rest of the chip.\nThus, if the I/O circuitry causes power fluctuations, the logic circuit remains undisturbed, protected by\nits separate power wiring.</p>\n<p><a href=\"https://static.righto.com/images/386-package/power-wiring.jpg\"><img alt=\"A close-up of the top of the die, showing the power wiring and the circuitry for seven data pins.\" class=\"hilite\" height=\"229\" src=\"https://static.righto.com/images/386-package/power-wiring-w650.jpg\" title=\"A close-up of the top of the die, showing the power wiring and the circuitry for seven data pins.\" width=\"650\" /></a><div class=\"cite\">A close-up of the top of the die, showing the power wiring and the circuitry for seven data pins.</div></p>\n<p>The datasheet doesn't mention the separate I/O and logic power networks, but\nby using the CT scans, I determined which pins power I/O, and which pins power logic.\nIn the diagram below, the light red and blue pins are power and ground for I/O, while the dark red and blue pins are\npower and ground for logic.\nThe pins are scattered across the package, allowing power to be supplied to all four sides of the die.</p>\n<p><a href=\"https://static.righto.com/images/386-package/pinmap.jpg\"><img alt=\"The pinout from the Intel386DX Microprocessor Datasheet. This is the view from the pin side.\" class=\"hilite\" height=\"450\" src=\"https://static.righto.com/images/386-package/pinmap-w450.jpg\" title=\"The pinout from the Intel386DX Microprocessor Datasheet. This is the view from the pin side.\" width=\"450\" /></a><div class=\"cite\">The pinout from the <a href=\"http://csys.yonsei.ac.kr/lect/os/file/386dx.pdf#page=5\">Intel386DX Microprocessor Datasheet</a>. This is the view from the pin side.</div></p>\n<h2>\"No Connect\" pins</h2>\n<p>As the diagram above shows, the 386 has eight pins labeled \"NC\" (No Connect)&mdash;when the chip is installed in a computer,\nthe motherboard must leave these pins unconnected.\nYou might think that the 132-pin package simply has eight extra, unneeded pins, but it's more complicated than that.\nThe photo below shows five bond pads at the bottom of the 386 die. Three of these pads have bond wires attached,\nbut two have no bond wires: these correspond to No Connect pins.\nNote the black marks in the middle of the pads: the marks are from test probes that were applied to the die\nduring testing.<span id=\"fnref:testing\"><a class=\"ref\" href=\"#fn:testing\">7</a></span>\nThe No Connect pads presumably have a function during this testing process, providing access to an important\ninternal signal.</p>\n<p><a href=\"https://static.righto.com/images/386-package/nc-pins.jpg\"><img alt=\"A close-up of the die showing three bond pads with bond wires and two bond pads without bond wires.\" class=\"hilite\" height=\"193\" src=\"https://static.righto.com/images/386-package/nc-pins-w500.jpg\" title=\"A close-up of the die showing three bond pads with bond wires and two bond pads without bond wires.\" width=\"500\" /></a><div class=\"cite\">A close-up of the die showing three bond pads with bond wires and two bond pads without bond wires.</div></p>\n<p>Seven of the eight No Connect pads are <em>almost</em> connected: the package has a spot for a bond wire in the die cavity\nand the package has internal wiring to a No Connect pin.\nThe only thing missing is the bond wire between the pad and the die cavity.\nThus, by adding bond wires, Intel could easily create special chips with these pins connected, perhaps for debugging\nthe test process itself.</p>\n<p>The surprising thing is that one of the No Connect pads <em>does</em> have the bond wire in place, completing the connection to\nthe external pin.\n(I marked this pin in green in the pinout diagram earlier.)\nFrom the circuitry on the die, this pin appears to be an output.\nIf someone with a 386 chip hooks this pin to an oscilloscope, maybe they will see something interesting.</p>\n<h2>Labeling the pads on the die</h2>\n<p>The earlier 8086 processor, for example, is packaged in a DIP (Dual-Inline Package) with two rows of pins.\nThis makes it \nstraightforward to figure out which pin (and thus which function) is connected\nto each pad on the die.\nHowever, since the 386 has a two-dimensional grid of pins, the mapping to the pads is unclear.\nYou can guess that pins are connected to a nearby pad, but ambiguity remains.\nWithout knowing the function of each pad, I have a harder time reverse-engineering the die.</p>\n<p>In fact, my primary motivation for scanning the 386 package was to determine the pin-to-pad mapping and thus the\nfunction of each pad.<span id=\"fnref:beep\"><a class=\"ref\" href=\"#fn:beep\">8</a></span>\nOnce I had the CT data, I was able to trace out each hidden connection between the pad and the external pin.\nThe image below shows some of the labels; click <a href=\"https://static.righto.com/images/386-package/die-pin-labels.jpg\">here</a> for the full, completely labeled image.\nAs far as I know, this information hasn't been available outside Intel until now.</p>\n<p><a href=\"https://static.righto.com/images/386-package/die-labeled-closeup.jpg\"><img alt=\"A close-up of the 386 die showing the labels for some of the pins.\" class=\"hilite\" height=\"313\" src=\"https://static.righto.com/images/386-package/die-labeled-closeup-w400.jpg\" title=\"A close-up of the 386 die showing the labels for some of the pins.\" width=\"400\" /></a><div class=\"cite\">A close-up of the 386 die showing the labels for some of the pins.</div></p>\n<!--\nIntel wrote in detail about the Pentium III's package in [Flip Chip Pin Grid Array (FC-PGA) Packaging Technology](https://doi.org/10.1109/EPTC.2000.906346).\nThis package was essentially a 6-layer printed circuit board with pins and decoupling capacitors on the bottom and the\ndie on top.\nThe die was mounted as a flip chip, with the die soldered directly to the board using C4 solder balls rather than\nbond wires.\nThis package replaced the OLGA (Organic Land Grid Array) package from the Pentium II, which had contacts (lands) on\nthe bottom of the package rather than pins\nSee also [Package Type Guide for Intel Desktop Processors](https://www.intel.com/content/www/us/en/support/articles/000005670/processors.html).\n-->\n\n<h2>Conclusions</h2>\n<p>Intel's early processors were hampered by inferior packages, but by the time of the 386, Intel had realized\nthe importance of packaging.\nIn Intel's early days, management held the bizarre belief that chips should never have more than 16 pins, even though\nother companies used 40-pin packages.\nThus, Intel's first microprocessor, the 4004 (1971), was crammed into a 16-pin package, limiting its performance.\nBy 1972, larger memory chips forced Intel to move to 18-pin packages, extremely reluctantly.<span id=\"fnref:faggin\"><a class=\"ref\" href=\"#fn:faggin\">9</a></span>\nThe eight-bit 8008 processor (1972) took advantage of this slightly larger package, but performance still suffered because\nsignals were forced to share pins.\nFinally, Intel moved to the standard 40-pin package for the 8080 processor (1974),\ncontributing to the chip's success.\nIn the 1980s, <a href=\"https://doi.org/10.1109/MSPEC.1985.6370492\">pin-grid arrays</a> became popular in the industry\nas chips required more and more pins.\nIntel used a ceramic pin grid array (PGA) with 68 pins for the 186 and 286 processors (1982),\nfollowed by the 132-pin package for the 386 (1985).</p>\n<p>The main drawback of the ceramic package was its cost.\nAccording to the <a href=\"https://archive.computerhistory.org/resources/access/text/2015/06/102702019-05-01-acc.pdf#page=25\">386 oral history</a>,\nthe cost of the 386 die decreased over time to the point where the chip's package cost as much as the die.\nTo counteract this, Intel introduced a low-cost plastic package for the 386 that cost just a dollar to manufacture,\nthe Plastic Quad Flat Package (PQFP) (<a href=\"https://datasheets.chipdb.org/Intel/x86/386/datashts/24126703.PDF\">details</a>).</p>\n<p>In later Intel processors, the number of connections exponentially increased.\nA typical modern laptop processor uses a Ball Grid Array with 2049 solder balls;\nthe chip is soldered directly onto the circuit board.\nOther Intel processors use a Land Grid Array (LGA): the chip has flat contacts called\nlands, while the <em>socket</em> has the pins.\nSome Xeon processors have <a href=\"https://en.wikipedia.org/wiki/LGA_7529\">7529</a> contacts, a remarkable growth from the 16 pins of\nthe Intel 4004.</p>\n<p>From the outside, the 386's package looks like a plain chunk of ceramic.\nBut the CT scan revealed surprising complexity inside, from numerous contacts for electroplating to six layers of\nwiring. Perhaps even more secrets lurk in the packages of modern processors.</p>\n<p>Follow me on\nBluesky (<a href=\"https://bsky.app/profile/righto.com\">@righto.com</a>),\nMastodon (<a href=\"https://oldbytes.space/@kenshirriff\">@kenshirriff@oldbytes.space</a>),\nor <a href=\"http://www.righto.com/feeds/posts/default\">RSS</a>.\n(I've given up on Twitter.)\nThanks to Jon Bruner and <a href=\"https://www.lumafield.com/\">Lumafield</a> for scanning the chip.\nLumafield's interactive CT scan of the 386 package is available <a href=\"https://voyager.lumafield.com/project/11b55bba-910c-4c78-8e73-467157c64032\">here</a> if you to want to examine it yourself.\nLumafield also scanned a <a href=\"https://www.righto.com/2022/08/lumafield-flip-flop.html\">1960s cordwood flip-flop</a> and\nthe Soviet <a href=\"https://voyager.lumafield.com/project/d848dd54-d594-479f-a723-a463547ea7aa\">Globus</a> spacecraft navigation\ninstrument for us.\nThanks to John McMaster for taking 2D X-rays.</p>\n<h2>Notes and references</h2>\n<div class=\"footnote\">\n<ol>\n<li id=\"fn:chisel\">\n<p>I removed the metal lid with a chisel, as hot air failed to desolder the lid.\nA few pins were bent in the process, but I straightened them out, more or less.&#160;<a class=\"footnote-backref\" href=\"#fnref:chisel\" title=\"Jump back to footnote 1 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:requirements\">\n<p>The 386 package is described in \"High Performance Technology, Circuits and Packaging for the 80386\",\nProceedings, ICCD Conference, Oct. 1986.\n(Also see\n<a href=\"https://doi.org/10.1109/MDT.1987.295165\">Design and Test of the 80386</a> by Pat Gelsinger,\nformer Intel CEO.)</p>\n<p>The paper gives the following requirements for the 386 package:</p>\n<p><ol>\n<li>Large pin count to handle separate 32-bit data and address buses.</li>\n<li>Thermal characteristics resulting in junction temperatures under 110°.</li>\n<li>Power supply to the chip and I/O able to supply 600mA/ns with noise levels less than 0.4V (chip) and less than 0.8V (I/O).</li>\n</ol></p>\n<p>The first and second criteria motivated the selection of a 132-pin ceramic pin grid array (PGA).\nThe custom six-layer package was designed to achieve the third objective.\nThe power network is claimed to have an inductance of 4.5 nH per power pad on the device, compared to\n12-14 nH for a standard package, about a factor of 3 better.</p>\n<p>The paper states that logic Vcc, logic Vss, I/O Vcc, and I/O Vss each have 10 pins assigned.\nCuriously, the datasheet states that the 386 has 20 Vcc pins and <em>21</em> Vss pins, which doesn't add up.\nFrom my investigation, the \"extra\" pin is assigned to logic Vss, which has 11 pins.&#160;<a class=\"footnote-backref\" href=\"#fnref:requirements\" title=\"Jump back to footnote 2 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:gold\">\n<p>I estimate that the 386 package contains roughly 0.16 grams of gold, currently worth about $16. \nIt's hard to find out how much gold is in a processor since online numbers are all over the place.\nMany people recover the gold from chips, but the amount of gold one can recover depends on the\nprocess used. Moreover, people tend to keep accurate numbers to themselves so they can profit.\nBut I made some estimates after searching around a bit.\nOne <a href=\"https://www.reddit.com/r/Gold/comments/10igj4m/comment/j5imss3/\">person</a> reports 9.69g of gold per kilogram of chips,\nand other sources seem roughly consistent.\nA ceramic 386 <a href=\"https://www.cpu-world.com/forum/viewtopic.php?p=74549\">reportedly</a> weighs 16g.\nThis works out to 160 mg of gold per 386.&#160;<a class=\"footnote-backref\" href=\"#fnref:gold\" title=\"Jump back to footnote 3 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:manufacturing\">\n<p>I don't have information on Intel's package manufacturing process specifically.\nThis description is based on other descriptions of ceramic packages, so I don't guarantee that the details\nare correct for the 386.\nA Fujitsu patent, <a href=\"https://patents.google.com/patent/US4458291\">Package for enclosing semiconductor elements</a>, describes\nin detail how ceramic packages for LSI chips are manufactured.\nIBM's process for ceramic multi-chip modules is described in\n<a href=\"https://doi.org/10.1147/rd.271.0011\">Multi-Layer Ceramics Manufacturing</a>, but it is probably less similar.&#160;<a class=\"footnote-backref\" href=\"#fnref:manufacturing\" title=\"Jump back to footnote 4 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:electroplating\">\n<p>An IBM patent, <a href=\"https://patents.google.com/patent/US6214180B1\">Method for shorting pin grid array pins for plating</a>,\ndescribes the prior art of electroplating pins with nickel and/or gold.\nIn particular, it describes using leads to connect all input/output pins to a common bus at the edge of the package,\nleaving the long leads in the structure. \nThis is exactly what I see in the 386 chip. The patent mentions that a drawback of this approach is that the leads\ncan act as antennas and produce signal cross-talk.\nFujitsu patent <a href=\"https://patents.google.com/patent/US4458291\">Package for enclosing semiconductor elements</a>\nalso describes wires that are exposed at side surfaces.\nThis patent covers methods to avoid static electricity damage through these wires.\n(Picking up a 386 by the sides seems safe, but I guess there is a risk of static damage.)</p>\n<p>Note that each input/output pin requires a separate wire to the edge.\nHowever, the multiple pins for each power or ground plane are connected inside the package, so they do not \nrequire individual edge connections; one or two suffice.&#160;<a class=\"footnote-backref\" href=\"#fnref:electroplating\" title=\"Jump back to footnote 5 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:multimeter\">\n<p>To verify that the wires from pins to the edges of the chip exist and are exposed,\nI used a multimeter and found connectivity between pins and tiny spots on the sides of \nthe chip.&#160;<a class=\"footnote-backref\" href=\"#fnref:multimeter\" title=\"Jump back to footnote 6 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:testing\">\n<p>To reduce costs, each die is tested while it is still part of the silicon wafer and each faulty die is marked\nwith an ink spot.\nThe wafer is \"diced\", cutting it apart into individual dies, and only the functional, unmarked dies are packaged, avoiding\nthe cost of packaging a faulty die.\nAdditional testing takes place after packaging, of course.&#160;<a class=\"footnote-backref\" href=\"#fnref:testing\" title=\"Jump back to footnote 7 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:beep\">\n<p>I tried several approaches to determine the mapping between pads and pins before using the CT scan.\nI tried to beep out the connections between the pins and the pads with a multimeter, but because the pads are\nso tiny, the process was difficult, error-prone, and caused damage to the package.</p>\n<p>I also looked at the pinout of the 386 in a plastic package (<a href=\"https://datasheets.chipdb.org/Intel/x86/386/datashts/24126703.PDF#page=3\">datasheet</a>).\nSince the plastic package has the pins in a single ring around the border, the mapping to the die is\nstraightforward.\nUnfortunately, the 386 die was slightly redesigned at this time, so some pads were moved around and new pins\nwere added, such as <code>FLT#</code>.\nIt turns out that the pinout for the plastic chip <em>almost</em> matches the die I examined, but not quite.&#160;<a class=\"footnote-backref\" href=\"#fnref:beep\" title=\"Jump back to footnote 8 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:faggin\">\n<p>In his <a href=\"http://archive.computerhistory.org/resources/text/Oral_History/Faggin_Federico/Faggin_Federico_1_2_3.oral_history.2004.102658025.pdf\">oral history</a>, Federico Faggin, a designer of the 4004, 8008, and Z80 processors, describes Intel's fixation on 16-pin packages.\nWhen a memory chip required 18 pins instead of 16, it was \"like the sky had dropped from heaven.\nI never seen so [many] long faces at Intel, over this issue, because it was a religion in Intel; everything had to be 16 pins, in those days.\nIt was a completely silly requirements [sic] to have 16 pins.\" At the time, other manufacturers were using 40- and 48-pin packages, so there was no technical limitation, just a minor cost saving from the smaller package.&#160;<a class=\"footnote-backref\" href=\"#fnref:faggin\" title=\"Jump back to footnote 9 in the text\">&#8617;</a></p>\n</li>\n</ol>\n</div>",
  "id": "tag:blogger.com,1999:blog-6264947694886887540.post-4351020075475457068"
}