{
  "title": "Knight Ride: a game about rogue (chess) knight",
  "link": "https://rakhim.exotext.com/knight-ride-a-game-about-rogue-chess-knight",
  "published": "Sat, 29 Mar 2025 18:50:06 GMT",
  "summary": "<p>I made a little puzzle game called Knight Ride. You can play it here: <strong><a href=\"https://knightride.rakhim.org\">knightride.rakhim.org</a></strong>. </p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/hh6bOgQYmhTkNPnVrU2N3.png\" /></p>\n<p>A few months ago, I started learning game development with <a href=\"https://godotengine.org/\">Godot</a> and began building a chess-inspired game.</p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/HCw5ezTIKHf0OjWlVJ40k.png\" /></p>\n<p>Game development is new and unintuitive to me, so for some quick 'build-n-ship' dopamine, I took one mechanic from that project and turned it into a simple browser game. The idea is simple: you have one knight on a chess board with a few random enemy pieces and the target square. You have to reach the target square. Well, okay, that sounds boring—until you realize you can capture pieces and earn points: 1 for a pawn, 3 for a bishop or knight, 5 for a rook, and 9 for a queen. And you have a limited number of moves. When you reach the target, your points get multiplied by the number of moves left, and you proceed to the next level.</p>\n<p>I decided to implement this in the simplest way possible, so no game engines, not even chess board libraries like <a href=\"https://chessboardjs.com/\">chessboard.js</a>. Just HTML, raw JS, some SVGs and some sounds.</p>\n<p>I took the chess pieces in SVG format from <a href=\"https://commons.wikimedia.org/wiki/Category:SVG_chess_pieces\">Wikipedia</a>, and simply dumped the SVG code into JS as strings. For some reason, I love minimizing the number of network requests (as if that's a bottleneck for my high-stakes gaming empire); for the same reason I prefer to encode favicons like this: <code>&lt;link rel=&quot;shortcut icon&quot; href=&quot;data:image/svg+xml;base64,PD94bWw.....&quot; /&gt;</code>.</p>\n<p>Then I set up the board using CSS <a href=\"https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_grid_layout\">grid layout</a>, which seems to be the perfect representation for this. I'm no CSS pro, so I asked Claude LLM and got this nice stylesheet:</p>\n<pre><code class=\"hljs language-css\"><span class=\"hljs-attribute\">display</span>: grid;\n<span class=\"hljs-attribute\">grid-template-columns</span>: <span class=\"hljs-built_in\">repeat</span>(<span class=\"hljs-number\">8</span>, <span class=\"hljs-built_in\">var</span>(--cell-size));\n<span class=\"hljs-attribute\">grid-template-rows</span>: <span class=\"hljs-built_in\">repeat</span>(<span class=\"hljs-number\">8</span>, <span class=\"hljs-built_in\">var</span>(--cell-size));\n</code></pre><p>I didn't know we're so ahead in declarative computation in CSS!</p>\n<p>A very tricky part was putting the SVG pieces in correct places with correct sizes. The <code>viewBox</code> property of the <code>svg</code> element is not the most intuitive concept. I found this blog post on CSS Tricks (<a href=\"https://css-tricks.com/scale-svg/\">How to Scale SVG</a>) very helpful.</p>\n<p>In traditional software development, we often try to avoid global state, but in game development, it's a core architectural pattern. It makes sense, because ultimately a game can be viewed as a reactive renderer of visual frames, and if you have a singular state object, it's easier to make deal with it for both making changes and extracting some representation. For my small browser game, having a global state isn't as crucial, but it feels oddly liberating.&quot;</p>\n<p>So, everything is stored in a <code>gameState</code> object, even things that don't really represent the state like paths to sound files. Hell, why not, maybe I'd have settings or game saves later on, so I'll just dump that object into storage.</p>\n<p>The game starts with an intro screen explaining the mechanics and displaying the high score so far. The high score is saved into browser's local storage. There are no sign ups and no accounts, this is a single HTML page (plus some mp3 files). There's a start button, of course. Clicking it simply hides one <code>div</code> and reveals another.</p>\n<p>Computing legal moves for a chess piece is a straight-forward task if you have a representation of the board as a 2D array. For the knight, I just have pre-defined offsets of 8 moves:</p>\n<pre><code class=\"hljs language-javascript\"><span class=\"hljs-keyword\">const</span> moveOffsets = [\n    { <span class=\"hljs-attr\">row</span>: -<span class=\"hljs-number\">2</span>, <span class=\"hljs-attr\">col</span>: -<span class=\"hljs-number\">1</span> }, { <span class=\"hljs-attr\">row</span>: -<span class=\"hljs-number\">2</span>, <span class=\"hljs-attr\">col</span>: <span class=\"hljs-number\">1</span> },\n    { <span class=\"hljs-attr\">row</span>: -<span class=\"hljs-number\">1</span>, <span class=\"hljs-attr\">col</span>: -<span class=\"hljs-number\">2</span> }, { <span class=\"hljs-attr\">row</span>: -<span class=\"hljs-number\">1</span>, <span class=\"hljs-attr\">col</span>: <span class=\"hljs-number\">2</span> },\n    { <span class=\"hljs-attr\">row</span>: <span class=\"hljs-number\">1</span>, <span class=\"hljs-attr\">col</span>: -<span class=\"hljs-number\">2</span> }, { <span class=\"hljs-attr\">row</span>: <span class=\"hljs-number\">1</span>, <span class=\"hljs-attr\">col</span>: <span class=\"hljs-number\">2</span> },\n    { <span class=\"hljs-attr\">row</span>: <span class=\"hljs-number\">2</span>, <span class=\"hljs-attr\">col</span>: -<span class=\"hljs-number\">1</span> }, { <span class=\"hljs-attr\">row</span>: <span class=\"hljs-number\">2</span>, <span class=\"hljs-attr\">col</span>: <span class=\"hljs-number\">1</span> }\n];\n</code></pre><p>Of course, some of the moves would jump beyond the board, so I just filter things:</p>\n<pre><code class=\"hljs language-javascript\"><span class=\"hljs-keyword\">const</span> newRow = row + offset.<span class=\"hljs-property\">row</span>;\n<span class=\"hljs-keyword\">const</span> newCol = col + offset.<span class=\"hljs-property\">col</span>;\n<span class=\"hljs-keyword\">if</span> (newRow &gt;= <span class=\"hljs-number\">0</span> &amp;&amp; newRow &lt; <span class=\"hljs-number\">8</span> &amp;&amp; newCol &gt;= <span class=\"hljs-number\">0</span> &amp;&amp; newCol &lt; <span class=\"hljs-number\">8</span>) {\n    possibleMoves.<span class=\"hljs-title function_\">push</span>({ <span class=\"hljs-attr\">row</span>: newRow, <span class=\"hljs-attr\">col</span>: newCol });\n}\n</code></pre><p>Since possible moves are stored in <code>gameState</code>, I can check legality with <code>gameState.possibleMoves.some(move =&gt; move.row === row &amp;&amp; move.col === col)</code>.</p>\n<p>The game state holds the logical state, but the visuals are separate, and this does not feel nice to my programmer's brain. Of course, one could've implemented a proper one-way rendering, where the screen is always derived from the state directly, and simply refreshed when required, without the need to directly manipulate (e.g. delete a piece from the board). Or maybe even not simply refresh the whole board, but calculate the diff and apply it... oh, and maybe not do this on the DOM itself, since it's clunky and slow, but on some separate in-memory DOM. Wait, this sounds like React. Was React inspired by game dev?</p>\n<p>Anyway, I didn't do the proper thing and ended up just directly manipulating the visual part of the game in sync with the state changes, hoping that the limited complexity of Knight Ride will allow me to avoid bugs. For example, the knight's position (column and row) is in <code>gameState</code>, but the actual visual knight is in the DOM, and I access it via data attributes:</p>\n<pre><code class=\"hljs language-javascript\"><span class=\"hljs-keyword\">const</span> knightPiece = <span class=\"hljs-variable language_\">document</span>.<span class=\"hljs-title function_\">querySelector</span>(<span class=\"hljs-string\">&#x27;.piece[data-type=&quot;knight&quot;]&#x27;</span>);\n</code></pre><p>The cell the knight occupies is a div (one of 64 children of that grid I mentioned earlier), and accessing it is so ugly it's beautiful:</p>\n<pre><code class=\"hljs language-javascript\"><span class=\"hljs-keyword\">const</span> oldCell = <span class=\"hljs-variable language_\">document</span>.<span class=\"hljs-title function_\">querySelector</span>(<span class=\"hljs-string\">`.cell[data-row=&quot;<span class=\"hljs-subst\">${gameState.knightPosition.row}</span>&quot;][data-col=&quot;<span class=\"hljs-subst\">${gameState.knightPosition.col}</span>&quot;]`</span>);\n</code></pre><p>The cell the user clicked on (in an attempt to move the knight there) is:</p>\n<pre><code class=\"hljs language-javascript\"><span class=\"hljs-keyword\">const</span> newCell = <span class=\"hljs-variable language_\">document</span>.<span class=\"hljs-title function_\">querySelector</span>(<span class=\"hljs-string\">`.cell[data-row=&quot;<span class=\"hljs-subst\">${row}</span>&quot;][data-col=&quot;<span class=\"hljs-subst\">${col}</span>&quot;]`</span>);\n</code></pre><p>See? It's kind of disgusting. I don't know, maybe I'm overreacting. This approach is so flexible, I can't stop. Like, how to determine whether the cell is empty or contains an enemy piece? Well, it so happens that there are no enemy knights. So...</p>\n<pre><code class=\"hljs language-javascript\"><span class=\"hljs-keyword\">const</span> capturePiece = newCell.<span class=\"hljs-title function_\">querySelector</span>(<span class=\"hljs-string\">&#x27;.piece:not([data-type=&quot;knight&quot;])&#x27;</span>);\n</code></pre><p>Yeah. The &quot;piece to capture&quot; is whatever piece that is not a knight. I hope I don't have to maintain this game!</p>\n<p>Moving the knight and capturing pieces is pretty straight-forward otherwise. Update the state, update the visuals, do some checks: did we win, did we lose, or do we continue.</p>\n<p>The number of enemy pieces grows with the level, but the number of available moves was always 10 in the first version. This felt unfair, so I made the number of moves be <code>10 + Math.floor(numPieces / 2)</code>. Still, you'd lose points by capturing pieces, and would end up with many points but a small multiplier; this would encourage you to hunt for a limited number of high-value pieces. It also felt unfair and kind of deflating, so in the next iteration a capture would give 1 bonus move, essentially making capturing &quot;free&quot;.</p>\n<p>I then decided that free-range movement is boring. The player would get punishment in form of subtracted points if the knight is under attack. At first I made it symmetrical: e.g. if you're under attack of a queen you'd get -9 points, since capturing a queen gives you +9. Or even worse: if multiple pieces attack the knight, all of their negative points are added up. This quickly became unsustainable, and again would encourage the player to do less. I wanted the game to feel like a fast-paced 'boom-headshot!' chess puzzle, so now being under attack always results in just -1 point, no matter the piece or number of attackers. You can get under attack on your way to capture something, and still end up winning.</p>\n<p>With move LLM assistance, I made a floating and disappearing notification-like bubble that shows the number of points gained by capturing, and also the number of points and the multiplier in the end, when reaching the target square. It looks nice and satisfying!</p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/33K71KpOo9jt7Hr-EpdKm.png\" /></p>\n<p>It made me think &quot;hey, let's add more satisfying bonuses&quot;. Capturing piece after piece in a streak already felt cool, so I decided to encourage it with a streak bonus. Once you hit more than 1 piece in a row, the streak length is added to each new capture. For example, capture a rook (+5) then capture another rook on the next move, you'd get +7 points: +5 for the rook and +2 for the 2-piece streak. </p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/D8GCtS4O4aPG6eB0asc3S.png\" /></p>\n<p>Another bonus is given for cleaning the board. It's not <em>always</em> possible to clean it, but if you do, you double the points.</p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/Ixj59b1OJIC_0dJ3Z5-h0.png\" /></p>\n<p>Lastly, some crunchy sounds! At first I just searched for some &quot;move&quot; and &quot;win&quot; and &quot;bang&quot; sounds on <a href=\"https://pixabay.com\">Pixabay</a>, but it's difficult to find multiple sounds that go well together. So I found some cool <a href=\"https://leohpaz.itch.io/minifantasy-dungeon-sfx-pack\">game assets</a> by composer and audio designer named Leohpaz. </p>\n<p>To play the sounds, I just created a bunch of <code>Audio</code> elements in the global state object (like <code>new Audio('assets/sounds/win.mp3')</code>) and made a simple function to play different sounds like so:</p>\n<pre><code class=\"hljs language-javascript\">gameState.<span class=\"hljs-property\">sounds</span>[soundKey].<span class=\"hljs-property\">currentTime</span> = <span class=\"hljs-number\">0</span>;\ngameState.<span class=\"hljs-property\">sounds</span>[soundKey].<span class=\"hljs-title function_\">play</span>().<span class=\"hljs-title function_\">catch</span>(<span class=\"hljs-function\"><span class=\"hljs-params\">e</span> =&gt;</span> <span class=\"hljs-variable language_\">console</span>.<span class=\"hljs-title function_\">log</span>(<span class=\"hljs-string\">&quot;Audio play error:&quot;</span>, e));\n</code></pre><p><code>Audio</code> preloads the files, and it worked well on Firefox and Chrome. But on Safari it was a disaster. Sometimes the sounds would just not play if I trigger them in quick succession. When the do play, the play with a random lag. This <a href=\"https://stackoverflow.com/questions/9811429/html5-audio-tag-on-safari-has-a-delay\">long thread on StackOverflow</a> covers some details, but I decided to just try a 3rd party library called <a href=\"https://createjs.com/soundjs\">soundjs</a> instead, and it worked great. You need to pre-register the sound files like this:</p>\n<pre><code class=\"hljs language-javascript\"><span class=\"hljs-keyword\">for</span> (<span class=\"hljs-keyword\">const</span> [soundID, sound] <span class=\"hljs-keyword\">of</span> <span class=\"hljs-title class_\">Object</span>.<span class=\"hljs-title function_\">entries</span>(gameState.<span class=\"hljs-property\">sounds</span>)) {\n    createjs.<span class=\"hljs-property\">Sound</span>.<span class=\"hljs-title function_\">registerSound</span>(sound, soundID);\n}\n</code></pre><p>Then playing them is as easy as <code>createjs.Sound.play(soundID);</code>.</p>\n<p>The last confusing thing was the absence of sound on iOS. I just gave up and decided sure, let's not have sound on iOS, whatever. Then user cgati on <a href=\"https://lobste.rs/s/dducfq/i_made_little_puzzle_game_about_rogue#c_pjiqrv\">Lobste.rs</a> mentioned that sound started working after flipping the physical ringer switch. D'oh! I haven't touched that switch in years, it's constantly on &quot;silent&quot;. It's weird that I can play videos and music, but not in-browser sounds. </p>\n<p>The source code is available on <a href=\"https://github.com/freetonik/KnightRide/\">Github</a>, but also, of course, in the browser :) I put a lot of comments into the JS part, and everything is in the single HTML file except for sounds. </p>",
  "id": "https://rakhim.exotext.com/knight-ride-a-game-about-rogue-chess-knight"
}