{
  "title": "We are always fighting about things we agree on",
  "link": "https://idiallo.com/byte-size/fighting-about-things-we-agree-on?src=feed",
  "published": "Tue, 30 Sep 2025 00:56:15 GMT",
  "summary": "<p>I was in the elevator when an older couple got in, patiently waiting to get to their stop. I smiled, they smiled back, and I pressed the button for the ground floor, just because. All three of us were going down.</p>\n\n<p>I had my back to them when I heard the lady say, \"I think he will know.\" I turned to see if they were talking to me, since it was just us. She stepped forward, put on her glasses, then rummaged through her purse to get her phone out. Before I could say a word, she handed it to me and asked, \"How can I find all the pictures I have taken?\"</p>\n\n<p>\"Oh boy, here we go again\", the husband said. \"Hush!\" She replied to her husband, while she took the phone from me, pressed the button to turn it on, and then placed it back in my hands.</p>\n\n<p>While this may look unusual, I'm completely accustomed to turning into tech support at a moment's notice. When you take pictures on your phone through the camera app, a small preview appears on the bottom. When you click on those pictures, you can view them. The problem was that you can only view the pictures you just took. This is a security measure since the camera app can be activated without entering your pin.</p>\n\n<p>\"She wanted a brand new phone.\" The husband said. \"Like you don't have a brand new phone,\" she answered. We exited the elevator, the phone still in my hand. Every word the man said was contradicted by his wife, and every question she asked was ridiculed by the husband. But they were laughing all the way. So I told them:</p>\n\n<p>\"I can show you how, but I have one condition.\" The husband pulled his glasses from his front pocket, ready for what was coming. I could almost picture him pulling out a checkbook, ready to pay whatever price I named. \"First, you have to tell me the secret to your successful marriage.\" </p>\n\n<p>\"This old lady?\" the man said. \"I barely met her 50 years ago.\" The lady laughed, then added, \"We are always fighting about things we agree on.\"</p>\n\n<hr />\n\n<p>That was probably 10 years ago, but I can't forget these words. I was sitting down, observing people from my community, shouting, laughing, taunting each other. When you listen to their conversations, it is full of contradictions, but they are laughing nevertheless. I see the same thing online: people bickering about semantics. An outsider might sense some hostility. But an insider will keep coming back to these discussions, because that's what a community is. Fighting about things you already agree on.</p>",
  "id": "https://idiallo.com/byte-size/fighting-about-things-we-agree-on?src=feed"
}