{
  "title": "the essence of frigidity",
  "link": "https://computer.rip/2026-01-25-the-essence-of-frigidity.html",
  "published": "25 Jan 2026 00:00:00 UT",
  "summary": "<p>The front of the American grocery store contains a strange, liminal space: the\ntransitional area between parking lot and checkstand, along the front exterior\nand interior of the building, that fills with oddball commodities. Ice is a\nfixture at nearly every store, filtered water at most, firewood at some. This\nretail purgatory, both too early and too late in the shopping journey for\nimpulse purchases, is mostly good only for items people know they will need as\nthey check out. One of the standard residents of this space has always struck\nme as peculiar: dry ice.</p>\n<p>Carbon dioxide ice is said to have been invented, or we might better say\ndiscovered, in the 1830s. For whatever reason, it took just about a hundred\nyears for the substance to be commercialized. Thomas B. Slate was a son of\nOregon, somehow ended up in Boston, and then realized that the solid form of\nCO2 was both fairly easy to produce and useful as a form of refrigeration.\nWith an eye towards marketing, he coined the name Dry Ice—and founded the\nDryIce Corporation of America. The year was 1925, and word quickly spread.\nIn a widely syndicated 1930 article, &quot;Use of Carbon Dioxide as Ice Said to\nbe Developing Rapidly,&quot; the <em>Alamogordo Daily News</em> and others reported that\n&quot;the development of... 'concentrated essence of frigidity' for use as a\nrefrigerant in transportation of perishable products, is already taxing the\nmanufacturing facilities of the Nation... So rapidly has the use of this new\nform of refrigeration come into acceptance that there is not sufficient\ncarbon dioxide gas available.&quot;</p>\n<p>The rush to dry ice seems strange today, but we must consider the refrigeration\ntechnology of the time. Refrigerated transportation first emerged in the US\nduring the middle of the 19th century. Train boxcars, packed thoroughly with\nice, carried meat and fruit from midwestern agriculture to major cities.\nThis type of refrigerated transportation greatly expanded the availability\nof perishables, and the ability to ship fruits and vegetables between\ngrowing regions made it possible, for the first time, to get some fresh\nfruit out of season. Still, it was an expensive proposition: railroads built\nextensive infrastructure to support the movement of trains loaded down with\nhundreds of tons of ice. The itself had to be quarried from frozen lakes,\nsome of them purpose-built, a whole secondary seasonal transportation\neconomy.</p>\n<p>Mechanical refrigeration, using some kind of phase change process as we are\nfamiliar with today, came about a few decades later and found regular use on\nsteamships by 1900. Still, this refrigeration equipment was big and\nawkward; steam power was a practical requirement. As the Second World War\nbroke out, tens of thousands of refrigerated railcars and nearly 20,000\nrefrigerated trucks were in service—the vast majority still cooled by ice,\nnot mechanical refrigeration.</p>\n<p>You can see, then, the advantages of a &quot;dryer&quot; and lighter form of ice. The\nsheer weight of the ice significantly reduced the capacity of refrigerated\ntransports. &quot;One pound of carbon dioxide ice at 110 degrees below zero is\ndeclared to be equivalent to 16 pounds of water ice,&quot; the papers explained,\nfor the purposes of transportation. The use of dry ice could reduce long-haul\nshipping costs for fruit and vegetables by 50%, the Department of Commerce\nestimated, and dry ice even opened the door to shipping fresh produce from the\nWest Coast to the East—without having to &quot;re-ice&quot; the train multiple times\nalong the way. Indeed, improvements in refrigeration would remake the\nAmerican agricultural landscape. Central California was being irrigated so\nthat produce could grow, and refrigeration would bring that produce to market.</p>\n<p>1916 saw the American Production Company drilling on the dusty plains of\nnortheastern New Mexico, a few miles south of the town of Bueyeros. On the\nbanks of an anonymous wash, in the shadow of Mesa Quitaras, they hoped to\nstrike oil. Instead, at about 2,000 feet, they struck something else: carbon\ndioxide. The well blew wide open, and spewed CO2 into the air for about a\nyear, the production estimated at 25,000,000 cubic feet of gas per day under\nnatural pressure. For American Production, this was an unhappy accident.\nThey could identify no market for CO2, and a year later, they brought the\nwell under control, only to plug and abandon it permanently.</p>\n<p>Though the &quot;No. 1 Bueyeros&quot; well was a commercial failure at the time, it was\nnot wasted effort. American Production had set the future for northeastern\nNew Mexico. There was oil, if you looked in the right place. American Production\nfound its own productive wells, and soon had neighbors. Whiting Brothers,\nonce operator of charismatic service stations throughout the Southwest and\nfamously along Route 66, had drilled their own wells by 1928. American Production\nbecame part of British Petroleum. Breitburn Production of Texas has now consolidated\nmuch of the rest of the field, and more than two million cubic feet of natural\ngas come from northeastern New Mexico each month.</p>\n<p>If you looked elsewhere, there was gas—not natural gas, but CO2. Most wells\nin the region produced CO2 as a byproduct, and the less fortunate attempts yielded\nnothing but CO2. The clear, non-flammable gas was mostly a nuisance in the 1910s\nand 1920s. By the 1930s, though, promotion by the DryIce Corporation of America\n(in no small part through the Bureau of Commerce) had worked. CO2 started to be\nseen as a valuable commodity.</p>\n<p><img alt=\"Harding County dry ice plant\" src=\"https://computer.rip/f/dryice/1.png\" /></p>\n<p>The production of dry ice is deceptively simple. Given my general knowledge\nabout producing and handling cryogenic gases, I was surprised to read of commercial-scale\nproduction with small plants in the 1930s. There is, it turns out, not that much\nto it. One of the chief advantages of CO2 as an industrial gas is its low\ncritical temperature and pressure. If you take yourself back to high school chemistry,\nand picture a phase diagram, we can think about liquifying the CO2 gas coming out\nof a well. The triple point of carbon dioxide, where increasing pressure and\ntemperature will make it a liquid, is at around -60 Celsius and 5 atmospheres. The\ncritical point, beyond which CO2 becomes a supercritical gas-fluid hybrid, is only\nat 30 degrees Celsius and 72 atmospheres. In terms more familiar to us Americans,\nthat's about 88 degrees F and 1,000 PSI.</p>\n<p>In other words, CO2 gas becomes a liquid at temperatures and pressures that\nwere readily achievable, even with the early stages of chemical engineering in\nthe 1930s. With steam-powered chillers and compressors, it wasn't difficult to\nproduce liquid CO2 in bulk. But CO2 makes the next step even more convenient:\nliquid CO2, released into open air, boils very rapidly. As it bubbles away,\nthe phase change absorbs energy, leaving the remaining liquid CO2 even colder.\nSome of it freezes into ice, almost like evaporating seawater to extract the\nsalt, evaporating liquid CO2 leaves a snow-like mass of flaky, loose CO2 ice.\nScoop that snow up, pack it into forms, and use steam power or weight to\ncompress it, and you have a block of the product we call dry ice.</p>\n<p>The Bueyeros Field, as it was initially known, caught the interest of CO2\nentrepreneurs in 1931. A company called Timmons Carbonic, or perhaps\nSouthern Dry Ice Company (I suspect these to be two names for the same\noutfit), produced a well about a mile east, up on the mesa.</p>\n<p>Over the next few years, the Estancia Valley Carbon Dioxide Development Company drilled\na series of wells to be operated by Witt Ice and Gas. These were located in\nthe Estancia field, further southwest and closer to Albuquerque.  Witt built New\nMexico's first production dry ice plant, which operated from 1932 to 1942\noff of a pipeline from several nearby wells. Low pressure and difficult\ndrilling conditions in the Estancia field limited the plant's output, so by\nthe time it shut down Witt had already built a replacement. This facility,\nknown as the Bueyeros plant, produced 17 tons of dry ice per day starting\nin 1940. It is located just a couple of miles from the original American\nProduction well, north of Mesa Quitaras.</p>\n<p>About 2,000' below the surface at Bueyeros lies the Tubb Sandstone, a loose\naggregation of rock stuck below the impermeable Cimarron Anhydrite. Carbon\ndioxide can form underground through several processes, including the breakdown\nof organic materials under great heat and pressure (a process that creates\npetroleum oil as well) and chemical reactions between different minerals,\nespecially when volcanic activity causes rapid mixing with plenty of heat.\nThere are enough mechanisms of formation, either known or postulated, that\nit's hard to say where exactly the CO2 came from. Whatever its source, the\ngas flowed upwards underground into the sandstone, where it became\ntrapped under the airtight layer of Anhydrite. It's still there today, at\nleast most of it, and what stands out in particular about northeastern\nNew Mexico's CO2 is its purity. Most wells in the Bueyeros field produce\n99% pure CO2, suitable for immediate use.</p>\n<p>Near Solano, perhaps 20 miles southwest of Bueyeros by air, the Carbonic\nChemical Co built the state's largest dry ice plant. Starting operation in\n1942, the plant seems to have initially gone by the name &quot;Dioxice,&quot; immortalized\nas a stop on the nearby Union Pacific branch. Dioxice is an occasional synonym\nfor Dry Ice, perhaps intended to avoid the DryIce Corporation's trademark,\nalthough few bothered. The Carbonic Chemical Plant relied on an 18 mile\npipeline to bring gas from the Bueyeros field. Uniquely, this new plant used a\n&quot;high pressure process.&quot; By feeding the plant only with wells producing high\npressure (hundreds of PSI, as much as 500 PSI of natural pressure at some\nwells), the pipeline was made more efficient and reliable. Further, the already\nhigh pressure of the gas appreciably raised the temperature at which it would\nliquefy.</p>\n<p>The Carbonic Chemical plant's ammonia chillers only had to cool the\nCO2 to -15 degrees F, liquifying it before spraying it into &quot;snow\nchambers&quot; that filled with white carbon dioxide ice. A hydraulic press, built\ndirectly into the snow chamber, applied a couple of\nhundred tons of force to create a solid block of dry ice weighing some\n180 pounds. After a few saw cuts, the blocks were wrapped in paper and\nloaded onto insulated train cars for delivery to customers throughout the\nwest—and even some in Chicago.</p>\n<p>The main applications of CO2, a 1959 New Mexico Bureau of Mines report\nexplains, were dry ice for shipping. Secondarily, liquid CO2 was shipped\nin tanks for use in carbonating beverages. Witt Ice and Gas in particular\nbuilt a good business out of distributing liquid CO2 for beverage and\nindustrial use, and for a time was a joint venture with Chicago-based\nnationwide gas distributor Cardox. Bueyeros's gas producers found\ndifferent customers over time, so it is hard to summarize their impact,\nbut we know some salient examples. Most beverage carbonation in\nmid-century Denver, and perhaps all in Albuquerque, used Bueyeros gas.\nDry ice from Bueyeros was used to pack train cars passing through from\nCalifornia, and accompanied them all the way to the major cities of the\nEast Coast.</p>\n<p>By the 1950s, much of the product went to a more modern pursuit. Experimental\nwork pursued by the military and the precursors to the Department of Energy\noften required precise control of low temperatures, and both solid and\nliquid CO2 were suitable for the purpose. In the late 1950s, Carbonic\nChemical listed Los Alamos Scientific Laboratory, Sandia Laboratories,\nand White Sands Missile Range as their primary customers.</p>\n<p>Bueyeros lies in Harding County, New Mexico. Harding County is home to\ntwo incorporated cities (Roy and Mosquero), a couple of railroad stops,\na few highways, and hardly 650 people. It is the least populous county\nof New Mexico, but it's almost the size of Delaware. Harding County has\nnever exactly been a metropolis, but it did used to be a more vital\nplace. In the 1930s, as the CO2 industry built out, there were almost\n4,500 residents. Since then, the population has declined about 20% from\neach census to the next.</p>\n<p><img alt=\"Harding County dry ice plant\" src=\"https://computer.rip/f/dryice/2.png\" /></p>\n<p>CO2 production went into a similar decline. After the war, significant\nimprovements in refrigeration technology made mechanical refrigeration\ninevitable, even for road transportation. Besides, the growing chemical\nindustry had designed many industrial processes that produced CO2 as a\nbyproduct. CO2 for purposes like carbonation and gas blanketing was often\navailable locally at lower prices than shipped-in well CO2, leading to a\ngeneral decline in the CO2 industry.</p>\n<p>Growing understanding of New Mexico geology and a broader reorganizing\nof the stratigraphic nomenclature lead the Bueyeros Field to become part\nof the Bravo Dome. Bravo Dome CO2 production in the 1950s and 1960s was\nlikely supported mostly by military and weapons activity, as by the\nend of the 1960s the situation once again looked much like it did in the\n1910s: the Bravo Dome had a tremendous amount of gas to offer, but there\nwere few applications. The rate of extraction was limited by the size of\nthe market. Most of the dry ice plants closed, contributing, no doubt,\nto the depopulation of Harding County.</p>\n<p>The whole idea of drilling for CO2 is now rather amusing. Our modern problems\nare so much different: we have <em>too much</em> CO2, and we're producing even more\nwithout even intending to. It has at times seemed like the industry of the\nfuture will be putting CO2 down into the ground, not taking it out. What\nhappened out in Harding County was almost the opening of Pandora's box.\nA hundred years ago, before there was a dry ice industry in the US, newspaper\narticles already speculated as to the possibility of global warming by CO2. At\nthe time, it was often presented as a positive outcome: all the CO2 released\nby burning coal would warm the environment and thus reduce the need for that\ncoal, possibly even a self-balancing problem. It's even more ironic that CO2\nwas extracted mostly to make things colder, given the longer-term consequences.\nGiven all that, you would be forgiven for assuming that drilling for CO2 was a\nthing of the past.</p>\n<p>The CO2 extraction industry has always been linked to the oil industry, and oil has\nalways been boom and bust. In 1982, there were 16 CO2 wells operating in the\nBravo Dome field. At the end of 1985, just three years later, there were 258.\nDespite the almost total collapse of demand for CO2 refrigeration, demand for liquid\nCO2 was up by far. It turns out that American Production hadn't screwed up in\n1917, at least not if they had known a little more about petroleum engineering.</p>\n<p>In 1972, the Scurry Area Canyon Reef Operators Committee of West Texas started\nan experiment, attempting industrial application of a technique first proposed\nin the 1950s. Through a network of non-productive oil wells in the Permian Basin,\nthey injected liquid CO2 deep underground. The rapidly evaporating liquid raised\nthe pressure in the overall oil formation, and even lubricated and somewhat\nfractured the rock, all of which increased the flow rate at nearby oil wells.\nA decade later, the concept was proven, and CO2 Enhanced Oil Recovery (EOR)\nswept across the Permian Basin.</p>\n<p>Today, it is estimated that about 62% of the global industrial production of CO2\nis injected into the ground somewhere in North America to stimulate oil production.\nThe original SACROC system is still running, now up to 414 injection wells. There\nare thousands more. Every day, over two billion cubic feet of CO2 are forced into\nthe ground, pushing back up 245,000 barrels of additional oil.</p>\n<p>British Petroleum's acquisition of American Production proved fortuitous. BP\nbecame one of the country's largest producers of CO2, extracted from the ground\naround Bueyeros and transported by pipeline directly to the Permian Basin for\ninjection. In 2000, BP sold their Bravo Dome operations to Occidental Petroleum <sup class=\"footnote-ref\" id=\"fnref-1\"><a href=\"#fn-1\">1</a></sup>.\nNow going by Oxy, the petroleum giant has adopted a slogan of &quot;Zero In&quot;. That's\nzero as in carbon emissions.</p>\n<p>I would not have expected to describe Occidental Petroleum as &quot;woke,&quot; but in our\ncontemporary politics they stand out. Oxy mentions &quot;Diversity, Inclusion, and\nBelonging&quot; on the front page of their website, which was once attractive to\ninvestors but now seems more attractive to our nation's increasingly vindictive\nfederal government. Still, Oxy is sticking to a corporate strategy that involves\nacknowledging climate change as real, which I suppose counts as refreshing.\nFrom a 2025 annual report:</p>\n<blockquote>\n<p>Oxy is building an integrated portfolio of low-carbon projects, products,\ntechnologies and companies that complement our existing businesses; leveraging\nour competitive advantages in CO2 EOR, reservoir management, drilling,\nessential chemicals and major infrastructure projects; and are designed to\nsustain long term shareholder value as we work to implement our Net-Zero\nStrategy.</p>\n</blockquote>\n<p>Yes, Oxy has made achieving net-zero carbon a major part of their brand, and\nyes, this model of reducing carbon emissions relies heavily on CO2 EOR: the\nextraction of CO2 from the ground.</p>\n<p>In a faltering effort to address carbon emissions, the United States has leaned\nheavily on the promise of Carbon Capture and Storage (CCS) technologies. The\nidea is to take CO2 out of the environment (potentially by separating it from\nthe air but, more practically, by capturing it in places where it is already\nconcentrated by industrial processes) and to put it somewhere else. Yes, this\nhas shades of the Australian television sketch about the ship whose front fell\noff, but the key to &quot;sequestration&quot; is time. If we can put enough carbon\nsomewhere that it will say for enough time, we can reduce the &quot;active&quot; greenhouse\ngas content of our environment. The main way we have found of doing this is\ninjecting it deep underground. How convenient, then, that the oil industry is\nalready looking for CO2 for EOR.</p>\n<p>CCS has struggled in many ways, chief among them that the majority of planned\nCCS projects have never been built. As with most of our modern carbon reduction\neconomy, even the CCS that has been built is, well, a little bit questionable.\nThere is something of a Faustian bargain with fossil fuels. As we speak, about\n45 megatons of CO2 are captured from industrial processes each year for CCS. Of\nthat 45 Mt, 9 Mt are injected into dedicated CO2 sequestration projects. The\nrest, 80%, is purchased by the oil industry for use in EOR.</p>\n<p>This form of CCS, in which the captured CO2 is applied to an industrial\nprocess that leads to the production of more CO2, has taken to the name\nCCUS. That's Carbon Capture, <em>Utilization,</em> and Storage. Since the majority\nof the CO2 injected for EOR never comes back up, it is a form of sequestration.\nAlthough the additional oil produced will generally be burned, producing CO2,\nthe process can be said to be <em>inefficient in terms of CO2</em>. In other words,\nthe CO2 produced by burning oil from EOR is less in volume than the CO2\ninjected to stimulate recovery of that oil.</p>\n<div class=\"beg\">\n<hr />\n<p>I put a lot of time into writing this, and I hope that you enjoy reading\nit. If you can spare a few dollars, consider <a href=\"https://ko-fi.com/jbcrawford\">supporting me on\nko-fi</a>. You'll receive an occasional extra,\nsubscribers-only post, and defray the costs of providing artisanal, hand-built\nworld wide web directly from Albuquerque, New Mexico.</p>\n<hr />\n</div>\n<p>Mathematically, CCUS, the use of CO2 to produce oil, leads to a net reduction\nin released CO2. Philosophically, though, it is deeply unsatisfying. This is\nmade all the worse by the fact that CCUS has benefited from significant\ngovernment support. Outright subsidies for CCS are uncommon, although\nthey do exist. What <em>are</em> quite common are grants and subsidized financing\nfor the capital costs of CCS facilities. Nearly all CCS in the US has been\nbuilt with some degree of government funding, totaling at least four billion\ndollars, and regulatory requirements for CCS to offset new fossil fuel plants\nmay create a de facto electrical ratepayer subsidy for CCS. Most of that\nfinancial support, intended for our low-carbon future, goes to the oil\nproducers.</p>\n<p>The Permian Basin is well-positioned for CCS EOR because it produces mostly\nnatural gas. Natural gas in its raw form, &quot;well gas,&quot; almost always includes\nCO2. Natural gas processing plants separate the combustible gases from\nnoncombustible ones, producing natural gas that has a higher energy content\nand burns more cleanly—but, in the process, venting large quantities of CO2\ninto the atmosphere. Oxy is equipping its Permian Basin natural gas plants\nwith a capture system that collects the CO2 and compresses it for use in EOR.</p>\n<p>The problem is that CO2 consumption for EOR has, as always, outpaced\nproduction. There aren't enough carbon capture systems to supply the Permian\nBasin fields, so &quot;sequestered&quot; CO2 is mixed with &quot;new&quot; CO2. Bravo Dome CO2\nproduction has slowly declined since the 1990s, due mostly to declining\noil prices. Even so, northeastern New Mexico is still full of Oxy wells bringing up\nCO2 by the millions of cubic feet. 218 miles of pipeline deliver Bueyeros CO2\ninto West Texas, and 120 miles of pipeline the other way land it in the oil\nfields of Wyoming. There is very nearly one producing CO2 well\nper person in Harding County.</p>\n<p>Considering the totality of the system, it appears that government grants,\nfinancing incentives, and tax credits for CCS are subsidizing not only natural\ngas production but the extraction of CO2 itself. Whether this is progress on\nclimate change or a complete farce depends a mathematical analysis. CO2 goes in,\nfrom several different sources; CO2 goes out, to several different dispositions.\nDo we remove more from the atmosphere than we end up putting back? There isn't\nan obvious answer.</p>\n<p>The oil industry maintains that CCS is one of the most practical means of reducing\ncarbon emissions, with more CO2 injected than produced and a resulting reduction\nin the &quot;net CO2 impact&quot; of the product natural gas.</p>\n<p>As for more independent researchers, well, a paper finding that CCS EOR\n&quot;cannot contribute to reductions&quot; isn't the worst news. A 2020 literature\nreview of reports on CCS EOR projects found that they routinely fail to\naccount for significant secondary carbon emissions and that, due to a mix\nof the construction and operational realities of CCS EOR facilities and\nthe economics of oil consumption, CCS EOR has so far produced a modest net\n<em>increase</em> in greenhouse gas emissions.</p>\n<p>They're still out there today, drilling for carbon dioxide. The reports from\nthe petroleum institute today say that the Permian Basin might need even\nmore shipped in. New Mexico is an oil state; Texas gets the reputation but\nNew Mexico has the numbers. Per-capita oil production here is significantly\nhigher than Texas and second only to North Dakota. New Mexico now produces\nmore oil than Old Mexico, if you will, the country to our south.</p>\n<p>Per capita, New Mexico ranks 12th for CO2 emissions, responsible for about\n1% of the nation's total. Well, I can do a bit better: for CO2 intentionally\nextracted from the ground, New Mexico is #3, behind only Colorado and\nMississippi for total production. We produce something around 17% of the\nnation's supply of extracted CO2, and we even use most of it locally. I\nguess that's something you could put a good spin on.</p>\n<div class=\"footnotes\">\n<ol>\n<li id=\"fn-1\">\n<p>By this time, Armand Hammer was no longer CEO of Occidental, which is\nunfortunate since it deprives me of an excuse to talk at length about how\nutterly bizarre Armand Hammer was, and about the United World College he\nfounded in Las Vegas, NM. Suffice it to say, for now, that Occidental\nhad multiple connections to New Mexico.<a class=\"footnote\" href=\"#fnref-1\">&#8617;</a></p></li>\n</ol>\n</div>",
  "id": "https://computer.rip/2026-01-25-the-essence-of-frigidity.html"
}