{
  "title": "Let’s Destroy The European Union!",
  "link": "https://lucumr.pocoo.org/2025/12/9/fixing-europe/",
  "published": "2025-12-09T00:00:00+00:00",
  "summary": "<p>Elon Musk <a href=\"https://www.politico.eu/article/elon-musk-threatens-response-against-individuals-who-imposed-e120m-x-penalty/\">is not\nhappy</a>\nwith the EU fining his X platform and is currently on a tweet rampage\ncomplaining about it.  Among other things, he wants the whole EU to be\nabolished.  He sadly is hardly the first wealthy American to share their\nopinions on European politics lately.  I&#8217;m not a fan of this outside attention\nbut I believe it&#8217;s noteworthy and something to pay attention to.  In particular\nbecause the idea of destroying and ripping apart the EU is not just popular in\nthe US; it&#8217;s popular over here too.  Something that greatly concerns me.</p>\n<h2>We Have Genuine Problems</h2>\n<p>There is definitely a bunch of stuff we might want to fix over here.  <a href=\"/2025/10/21/eu-resigation/\">I have\ncomplained about our culture</a> before. Unfortunately,\nI happen to think that our challenges are not coming from politicians or civil\nservants, but from us, the people.  Europeans don&#8217;t like to take risks and are\nquite pessimistic about the future compared to their US counterparts.\nAdditionally, we Europeans have been trained to feel a lot of guilt over the\nyears, which makes us hesitant to stand up for ourselves.  This has led to all\nkinds of interesting counter-cultural movements in Europe, like years of\nsignificant support for unregulated immigration and an unhealthy obsession with\nthe idea of degrowth.  Today, though, neither seems quite as popular as it once\nwas.</p>\n<p>Morally these things may be defensible, but in practice they have led to Europe\nlosing its competitive edge and eroding social cohesion.  The combination of a\nstrong social state and high taxes in particular does not mix well with the kind\nof immigration we have seen in the last decade: mostly people escaping wars\nending up in low-skilled jobs.  That means it&#8217;s not unlikely that certain\nclasses of immigrants are going to be net-negative for a very long time, if not\nforever, and increasingly society is starting to think about what the\nimplications of that might be.</p>\n<p>Yet even all of that is not where our problems lie, and it&#8217;s certainly not our\npresumed lack of free speech.  Any conversation on that topic is foolish because\nit&#8217;s too nuanced.  Society clearly wants to place some limits to free speech\nhere, but the same is true in the US.  In the US we can currently see a\nsignificant push-back against &#8220;woke ideologies,&#8221; and a lot of that push-back\ninvolves restricting freedom of expression through different avenues.</p>\n<h2>America Likes a Weak Europe</h2>\n<p>The US might try to lecture Europe right now on free speech, but what it should\nbe lecturing us on is our economic model.  Europe has too much fragmentation,\nincredibly strict regulation that harms innovation, ineffective capital markets,\nand a massive dependency on both the United States and China.  If the US were to\ncut us off from their cloud providers, we would not be able to operate anything\nover here.  If China were to stop shipping us chips, we would be in deep trouble\ntoo (<a href=\"https://www.cnbc.com/2025/11/28/nexperia-crisis-dutch-chipmaker-issues-urgent-plea-to-its-china-unit.html\">we have seen\nthis</a>).</p>\n<p>This is painful because the US is historically a great example when it comes to\nfreedom of information, direct democracy at the state level, and rather low\ncorruption.  These are all areas where we&#8217;re not faring well, at least not\nconsistently, and we should be lectured.  Fundamentally, the US approach to\ncapitalism is about as good as it&#8217;s going to get.  If there was any doubt that\nalternative approaches might have worked out better, at this point there&#8217;s very\nlittle evidence in favor of that.  Yet because of increased loss of civil\nliberties in the US, many Europeans now see everything that the US is doing as\nbad.  A grave mistake.</p>\n<p>Both China and the US are quite happy with the dependency we have on them and\nwith us falling short of our potential.  Europe&#8217;s attempt at dealing with the\ndependency so far has been to regulate and tax US corporations more heavily.\nThat&#8217;s not a good strategy.  The solution must be to become competitive again so\nthat we can redirect that tax revenue to local companies instead.  The Digital\nServices Act is a good example: we&#8217;re punishing Apple and forcing them to open\nup their platform, but we have no company that can take advantage of that\nopening.</p>\n<h2>Europe is Europe&#8217;s Biggest Problem</h2>\n<p>If you read my blog here, you might remember my musings about <a href=\"/2025/9/14/whats-an-foreigner/\">the lack of\nclarity of what a foreigner is</a> in Europe.  The\nreality is that Europe has been deeply integrated for a long time now as a\nresult of how the EU works — but still not at the same level as the US.  I think\nthis is still the biggest problem.  People point to languages as the challenge,\nbut underneath the hood, the countries are still fighting each other.  Austria\nwants to protect its local stores from larger competition in Germany and its\ncarpenters from the cheaper ones coming from Slovenia.  You can replace Austria\nwith any other EU country and you will find the same thing.</p>\n<p>The EU might not be perfect, but it&#8217;s hard to imagine that abolishing it would\nsolve any problem given how national states have shown to behave.  The moment\nthe EU fell away, we would be warming up all border struggles again.  We have\nalready seen similar issues pop up in Northern Ireland after the UK left.</p>\n<p>And we just have so much bureaucracy, so many non-functioning social systems,\nand such a tremendous amount of incoming governmental debt to support our\nflailing pension schemes.  We need growth more than any other bloc, and we have\nsuch a low probability of actually accomplishing that.</p>\n<p>Given how the EU is structured, it&#8217;s also acting as the punching bag for the\nfailure of the nation states to come to agreements.  It&#8217;s not that EU\nbureaucrats are telling Europeans to take in immigrants, to enact chat control\nor to enact cookie banners or attached plastic caps.  Those are all initiatives\nthat come from one or more member states.  But the EU in the end will always\ntake the blame because even local politicians that voted in support of some of\nthese things can easily point towards &#8220;Brussels&#8221; as having created a problem.</p>\n<h2>The United States of Europe</h2>\n<p>A Europe in pieces does not sound appealing to me at all, and that&#8217;s because I\ncan look at what China and the US have.</p>\n<p>What China and the US have that Europe lacks is a strong national identity. Both\ncountries have recognized that strength comes from unity.  China in particular\nis fighting any kind of regionalism tooth and nail.  The US has accomplished\nthis through the pledge of allegiance, a civil war, the Department of Education\npushing a common narrative in schools, and historically putting post offices and\ninfrastructure everywhere.  Europe has none of that. More importantly, Europeans\ndon&#8217;t even want it.  There is a mistaken belief that we can just become these\ntiny states again and be fine.</p>\n<p>If Europe wants to be competitive, it seems unlikely that this can be\naccomplished without becoming a unified superpower.  Yet there is no belief in\nEurope that this can or should happen, and the other superpowers have little\ninterest in seeing it happen either.</p>\n<h2>What Would Fixing Actually Look Like?</h2>\n<p>If I had to propose something constructive, it would be this: Europe needs to\nstop pretending it can be 27 different countries with 27 different economic\npolicies while also being a single market.  The half-measures are killing us. We\nhave a common currency in the Eurozone but no common fiscal policy.  We have\nfreedom of movement but wildly different social systems.  We have common\nregulations but fragmented enforcement.  27 labor laws, 27 different legal\nsystems, tax codes, complex VAT rules and so on.</p>\n<p><a href=\"https://commission.europa.eu/topics/competitiveness/draghi-report_en\">The Draghi\nreport</a>\nfrom last year laid out many of these issues quite clearly: Europe needs massive\ninvestment in technology and infrastructure.  It needs a genuine single market\nfor services, not just goods.  It needs capital markets that can actually fund\nstartups at scale.  None of this is news to anyone paying attention.</p>\n<p>But here&#8217;s the uncomfortable truth: none of this will happen without Europeans\naccepting that more integration is the answer, not less.  And right now, the\npolitical momentum is in the opposite direction.  Every country wants the\nbenefits of the EU without the obligations.  Every country wants to protect its\nown industries while accessing everyone else&#8217;s markets.</p>\n<p>One of the arguments against deeper integration is that Europe hinges on some\nquite unrelated issues.  For instance, the EU is seen as non-democratic, but\nsome of the criticism just does not sit right with me.  Sure, I too would\nwelcome more democracy in the EU, but at the same time, the system really is\nnot undemocratic today.  Take things like chat control: the reason this thing\ndoes not die, is because some member states and their elected representatives\nare pushing for it.</p>\n<p>What stands in the way is that the member countries and their people don&#8217;t\nactually want to strengthen the EU further.  The &#8220;lack of democracy&#8221; is very\nmuch intentional and the exact outcome you get if you want to keep the power\nwith the national states.</p>\n<h2>Foreign Billionaires and European Sovereignty</h2>\n<p>So back to where we started: should the EU be abolished as Musk suggests?  I\nthink this is a profoundly unserious proposal from someone who has little\nunderstanding of European history and even less interest in learning.  The EU\nexists because two world wars taught Europeans that nationalism without checks\nleads to catastrophe.  It exists because small countries recognized they have\nmore leverage negotiating as a bloc than individually.</p>\n<p>I also take a lot of issue with the idea that European politics should be driven\nby foreign interests.  Neither Russians nor Americans have any good reason for\nwhy they should be having so much interest in European politics.  They are not\nliving here; we are.</p>\n<p>Would Europe be more &#8220;free&#8221; without the EU?  Perhaps in some narrow regulatory\nsense.  But it would also be weaker, more divided, and more susceptible to\nmanipulation by larger powers — including the United States.  I also find it\nsomewhat rich that American tech billionaires are calling for the dissolution of\nthe EU while they are greatly benefiting from the open market it provides.\nTheir companies extract enormous value from the European market, more than even\nlocal companies are able to.</p>\n<p>The real question isn&#8217;t whether Europe should have less regulation or more\nfreedom.  It&#8217;s whether we Europeans can find the political will to actually\ncomplete the project we started.  A genuine federation with real fiscal\ntransfers, a common defense policy, and a unified foreign policy would be a\nsuperpower.  What we have now is a compromise that satisfies nobody and leaves\nus vulnerable to exactly the kind of pressure Musk and other oligarchs\nrepresent.</p>\n<h2>A Different Path</h2>\n<p>Europe doesn&#8217;t need fixing in the way the loud present-day critics suggest.  It\ndoesn&#8217;t need to become more like America or abandon its social model entirely.\nWhat it needs is to decide what it actually wants to be.  The current state of\nperpetual ambiguity is unsustainable.</p>\n<p>It also should not lose its values.  Europeans might no longer be quite as hot\non the human rights that the EU provides, and they might no longer want to have\nthe same level of immigration.  Yet simultaneously, Europeans are presented with\na reality that needs all of these things.  We&#8217;re all highly dependent on\nmovement of labour, and that includes people from abroad.  Unfortunately, the\nwars of the last decade have dominated any migration discourse, and that has\ncreated ground for populists to thrive.  Any skilled tech migrant is running\ninto the same walls as everyone else, which has made it less and less appealing\nto come.</p>\n<p>Or perhaps we&#8217;ll continue muddling through, which historically has been Europe&#8217;s\npreferred approach.  It&#8217;s not inspiring, but it&#8217;s also not going to be the\ncatastrophe the internet would have you believe either.</p>\n<p>Is there reason to be optimistic?  On a long enough timeline the graph goes up\nand to the right.  We might be going through some rough patches, but\nstructurally the whole thing here is still pretty solid.  And it&#8217;s not as if the\nrest of the world is cruising along smoothly: the US, China, and Russia are each\ndealing with their own crises.  That shouldn&#8217;t serve as an excuse, but it does\noffer context.  As bleak as things can feel, we&#8217;re not alone in having\nchallenges, but ours are uniquely ours and we will face them.  One way or\nanother.</p>",
  "id": "https://lucumr.pocoo.org/2025/12/9/fixing-europe/"
}