{
  "title": "Producing a video lesson",
  "link": "https://rakhim.exotext.com/producing-a-video-lesson",
  "published": "Wed, 11 Jan 2017 00:00:00 GMT",
  "summary": "<p>A few years ago, I've made a bunch of <a href=\"https://www.youtube.com/@Codexpanse/videos\">videos on YouTube</a> about foundational topics in programming. There are lots of hand-drawn cartoons and some rudimentary animation. People keep asking how I made those, so here we go.</p>\n<h2>Inspiration</h2>\n<ol>\n<li><p><a href=\"https://mitpress.mit.edu/sicp/\"><em>Structure and Interpretation of Computer Programs</em></a> (SICP). If you’re only going to read one book on programming, it should be this one. </p>\n</li>\n<li><p>Interactive articles and talks by <a href=\"http://worrydream.com/\">Bret Victor</a>. An amazing person — at the very least, watch his talk <a href=\"https://www.youtube.com/watch?v=PUv66718DII\"><em>Inventing on Principle</em></a>.</p>\n</li>\n<li><p><a href=\"http://www.goodreads.com/book/show/703532.Mindstorms\"><em>Mindstorms</em></a> by Seymour Papert. About math anxiety, poor teaching methods, and innovative approaches to education. Every teacher — especially math or CS teachers — should read it.</p>\n</li>\n<li><p>A bunch of YouTube channels with great visualizations: <a href=\"https://www.youtube.com/user/TEDEducation\">Ted-ED</a>, <a href=\"https://www.youtube.com/user/voxdotcom\">Vox</a>, <a href=\"https://www.youtube.com/user/minutephysics\">Minute Physics</a>, <a href=\"https://www.youtube.com/user/numberphile\">Numberphile</a>, <a href=\"https://www.youtube.com/user/Computerphile\">Computerphile</a>.</p>\n</li>\n</ol>\n<h2>Scriptwriting</h2>\n<p>First, I define the topic and write the script. I have an initial course outline, but the order sometimes shifts to maintain logical flow.</p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/udTOtgNtsjnj9MwUn0fNN.jpg\" /></p>\n<p>I start with all major topics written on sticky notes, laid out on the desk: past topics, current candidates, and future ones. This helps visualize what concepts were already introduced, which ones I need to reinforce, and which to hint at.</p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/HJOvgowdgzaikgIJSek3l.jpg\" /></p>\n<p>The upcoming lesson is on <a href=\"https://en.wikipedia.org/wiki/Recursion\">recursion</a>. Time to develop the explanation flow and draft visuals.</p>\n<p>Visuals aren’t secondary — they are first-class citizens alongside the verbal explanation. Consistency is key. For example, constants were introduced as sticky notes (name on one side, value on the other). </p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/KlLWxpnDMJrKZRK4EpKUp.gif\" /></p>\n<p>The next lesson had introduced variables: erasable versions of those notes. Functions are boxes with input/output holes. </p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/PkYvAlh_PFLENLVy1-Ey9.gif\" /></p>\n<p>Functions are visualized as boxes that return values. </p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/y3Lq70CPdqAtM2I3pY-0o.png\" /></p>\n<p>Functions can be &quot;chained&quot;, so that the returning value is immediately fed into another function. I mean literally — <code>anotherFunction(someFunction(3))</code> is:</p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/Y1dMW8MkY1KmcNJ8d36bv.jpg\" /></p>\n<p>In this lesson I extend the same metaphor: functions can call other functions, which effectively creates new &quot;boxes&quot;; a function can even call itself, creating a new box of the same structure, but with different data. This is key to understanding recursion visually.</p>\n<p>I sketch the visuals and the structure in a notebook, then switch to Sublime Text 3 for the actual script. One lesson is about 1000 words. Drafting takes 1–3 hours. I review, read aloud, revise, and then move to recording the audio. (though some lessons also contain exercises.)</p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/wg_jkqcCzEDgfBaKSzWH6.png\" /></p>\n<h2>Audio</h2>\n<p>I record using my trusty Rode Podcaster mic (10 years old!). Lessons run 5–6 minutes. I usually do at least two takes. When something goes wrong, I just keep recording, sometimes repeating the same segment multiple times. This is fixed in editing later.</p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/ZNShyWuX2cWLFjgVUe4f-.jpg\" /></p>\n<p>Recording 5 minutes of usable audio takes up to 40 minutes. Once it’s &quot;not terrible&quot;, I clean it up: cut errors, adjust pauses, remove noises, apply filters (noise reduction, EQ, compression).</p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/M4DgB4sFfMw1wuj_-IA16.png\" /></p>\n<h2>Visuals</h2>\n<p>I draw intentionally simple visuals using an excellet iPad app called Paper. I storyboard scenes in alignment with the script. Each lesson folder ends up filled with  three types of media: drawings, videos, and text (mostly code).</p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/BkTtPzmjJKNHHx_ph_D14.jpg\" /></p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/bNWe63vQAOiLYm9B_-QZ5.png\" /></p>\n<p>I also film real-world objects — sticky notes, boxes, strings, pencils — using my phone and a ghetto DIY tripod.</p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/O4jUsav3LG-JhCGMTUlml.jpg\" /></p>\n<h2>Editing and publishing</h2>\n<p>The most time-consuming part. I import everything into Final Cut Pro and sync visuals with audio. Fill the whole timeline with a structural skeleton, and some static filler assets, then proceed to enrich it all with actual detailed content.</p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/MK4GyXcUtp1QX0u7Czhse.png\" /></p>\n<p>Sound effects: I record simple ones myself, others I find online. Occasionally, I add brief music or movie clips for laughs. </p>\n<p>Some sequences, like visualizing recursive factorial calls, are particularly intensive, involving multiple layers of animation and transitions.</p>\n<p>Once exported, I review the video again (at double speed). Then I upload it to YouTube. For the thumbnail, I pick an interesting frame, rearrange elements if needed, and add a handwritten title.</p>\n<p>Subtitles are added using the lesson script — after cleaning it up and removing Markdown. YouTube's auto-sync feature handles timing based on the voice track, which is a lifesaver.</p>\n<h2>Final Result</h2>\n<p>Here’s the final video:</p>",
  "id": "https://rakhim.exotext.com/producing-a-video-lesson"
}