{
  "title": "Writing First, Tooling Second",
  "link": "https://susam.net/writing-first-tooling-second.html",
  "published": "Sat, 10 Jan 2026 00:00:00 +0000",
  "summary": "<p>\n  I am a strong proponent of running\n  <a href=\"https://hnpwd.github.io/\">independent personal websites</a>\n  on your own domains and publishing your writing there.  Doing so\n  keeps the web diverse and decentralised, rather than concentrating\n  most writing and discussion inside a small number of large\n  platforms.  It gives authors long term control over their work\n  without being subject to\n  <a href=\"attention-media-is-not-social-media.html\">changing policies\n  or incentives</a>.  I think that a web made up of many small,\n  individually run websites is more resilient and also more\n  interesting than one dominated by a handful of social media\n  services.\n</p>\n<p>\n  I often participate in discussions pertaining to authoring personal\n  websites because this is an area I am passionate about.  Any\n  discussion about authoring websites that I take part in seems to\n  drift, sooner or later, into tooling.  Aspiring personal website\n  authors worry at length about which blogging engine to use, which\n  static site generator to pick, which templating language to choose\n  and so on.  I think none of this is important until you have\n  published at least five articles on your website.  Just write plain\n  HTML and worry about tooling later.\n</p>\n<p>\n  This very website you are reading right now began its life as a\n  loose collection of HTML files typed into Notepad on a Windows 98\n  machine.  I wrote some text, wrapped it in basic markup and copied\n  it to my web server's document root directory.  That's it.  Tooling\n  came much later, in fact many years later.  As the number of pages\n  grew, I naturally wanted some consistency.  I wanted a common layout\n  for my pages, navigation links, a footer that did not need to be\n  edited in twenty places.  An early version of this website used HTML\n  frames to accomplish these goals.  Later, I rewrote the website in\n  PHP.  Now this website is generated using Common Lisp.  All of these\n  additions came later, after I had been maintaining this website for\n  several years.  None of this was required to begin.\n</p>\n<p>\n  Around 2006, when blogging had become quite fashionable, I\n  experimented with blogging too.  Eventually, I returned to a loose,\n  chaotic collection of pages.  I do have an\n  <a href=\"./\">index page</a> and an <a href=\"feed.xml\">RSS\n  feed</a> that resemble a blog, but they are simply a list of\n  selected pages arranged in reverse chronological order.  The pages\n  themselves are scattered across various\n  <a href=\"links.html\">corners</a> of this website.  My point is that\n  not every website needs to be a blog.  A website can just as well be\n  a collection of pages, arranged in whatever way makes sense to you.\n  The blog is merely one possible organising principle, not a\n  requirement.  If your goal is simply to share your thoughts on your\n  own web space, worrying about blogging and tooling can easily become\n  counterproductive.  Just write your posts first, in plain HTML if\n  need be.\n</p>\n<p>\n  If you truly dislike writing HTML, that is fine too.  Write in\n  Markdown, AsciiDoc or whatever plain text format you find pleasant\n  and convert it to HTML using Pandoc or a similar tool.  Yes, I am\n  slightly undermining my own point here but I think a little bit of\n  tooling to make your writing process enjoyable is reasonable.\n  Tooling should exist to reduce friction, not to become the main\n  ceremony.  Personally, I write all my posts directly in HTML.  I use\n  Emacs, which provides a number of convenient key sequences and\n  functions that make writing HTML very comfortable.  For example, it\n  takes only a few keystrokes in Emacs to wrap text in a\n  <code>&lt;blockquote&gt;</code> element, insert a code block or\n  close any open tags.  But that is just me.  I enjoy writing HTML\n  documents in Emacs.  If you do not, it is easy to run your Markdown\n  files through a converter and publish the result with only a little\n  extra tooling overhead.\n</p>\n<p>\n  It is easy to spend days and weeks polishing a website setup,\n  selecting the perfect generator, theme and deployment pipeline, only\n  to end up with a beautifully engineered website whose sole content\n  is a single 'hello world' post.  That might not be very useful to\n  you or anyone else, unless setting up the pipeline itself was your\n  goal.  By contrast, a scrappy website made up of standalone HTML\n  pages might be useful to you as well as others.  You can refer back\n  to it months later.  You can send someone a link.  You can build on\n  it gradually.  Even if you never turn it into a blog, never add RSS\n  or never add any tooling, it still fulfills its most important\n  purpose: it exists and it says something you wanted to say.\n</p>\n<p>\n  So to summarise my post here: Create the website.  Publish\n  something.  Do it in the simplest way that lets you get your words\n  onto the page and onto the web.  Once you have content that you care\n  about, tooling can follow.  Your thoughts, your ideas, your\n  personality and quirks are the essence of your website.  Everything\n  else is optional.\n</p>\n<!-- ### -->\n<p>\n  <a href=\"https://susam.net/writing-first-tooling-second.html\">Read on website</a> |\n  <a href=\"https://susam.net/tag/web.html\">#web</a> |\n  <a href=\"https://susam.net/tag/technology.html\">#technology</a>\n</p>",
  "id": "wftss"
}