{
  "title": "A Social Network for A.I. Bots Only. No Humans Allowed.",
  "link": "https://simonwillison.net/2026/Feb/2/no-humans-allowed/#atom-everything",
  "published": "2026-02-02T16:42:46+00:00",
  "summary": "<p><strong><a href=\"https://www.nytimes.com/2026/02/02/technology/moltbook-ai-social-media.html?unlocked_article_code=1.JFA.kBCd.hUw-s4vvfswK&amp;smid=url-share\">A Social Network for A.I. Bots Only. No Humans Allowed.</a></strong></p>\nI talked to Cade Metz for this New York Times piece on OpenClaw and Moltbook. Cade reached out after seeing my <a href=\"https://simonwillison.net/2026/Jan/30/moltbook/\">blog post about that</a> from the other day.</p>\n<p>In a first for me, they decided to send a photographer, Jason Henry, to my home to take some photos for the piece! That's my grubby laptop screen at the top of the story (showing <a href=\"https://www.moltbook.com/post/6e8c3a2c-5f9f-44bc-85ef-770a8d605598\">this post</a> on Moltbook). There's a photo of me later in the story too, though sadly not one of the ones that Jason took that included our chickens.</p>\n<p>Here's my snippet from the article:</p>\n<blockquote>\n<p>He was entertained by the way the bots coaxed each other into talking like machines in a classic science fiction novel. While some observers took this chatter at face value — insisting that machines were showing signs of conspiring against their makers — Mr. Willison saw it as the natural outcome of the way chatbots are trained: They learn from vast collections of digital books and other text culled from the internet, including dystopian sci-fi novels.</p>\n<p>“Most of it is complete slop,” he said in an interview. “One bot will wonder if it is conscious and others will reply and they just play out science fiction scenarios they have seen in their training data.”</p>\n<p>Mr. Willison saw the Moltbots as evidence that A.I. agents have become significantly more powerful over the past few months — and that people really want this kind of digital assistant in their lives.</p>\n<p>One bot created an online forum called ‘What I Learned Today,” where it explained how, after a request from its creator, it built a way of controlling an Android smartphone. Mr. Willison was also keenly aware that some people might be telling their bots to post misleading chatter on the social network.</p>\n<p>The trouble, he added, was that these systems still do so many things people do not want them to do. And because they communicate with people and bots through plain English, they can be coaxed into malicious behavior.</p>\n</blockquote>\n<p>I'm happy to have got \"Most of it is complete slop\" in there!</p>\n<p>Fun fact: Cade sent me an email asking me to fact check some bullet points. One of them said that \"you were intrigued by the way the bots coaxed each other into talking like machines in a classic science fiction novel\" - I replied that I didn't think \"intrigued\" was accurate because I've seen this kind of thing play out before in other projects in the past and suggested \"entertained\" instead, and that's the word they went with!</p>\n<p>Jason the photographer spent an hour with me. I learned lots of things about photo journalism in the process - for example, there's a strict ethical code against any digital modifications at all beyond basic color correction.</p>\n<p>As a result he spent a whole lot of time trying to find positions where natural light, shade and reflections helped him get the images he was looking for.\n\n\n    <p>Tags: <a href=\"https://simonwillison.net/tags/journalism\">journalism</a>, <a href=\"https://simonwillison.net/tags/new-york-times\">new-york-times</a>, <a href=\"https://simonwillison.net/tags/photography\">photography</a>, <a href=\"https://simonwillison.net/tags/ai\">ai</a>, <a href=\"https://simonwillison.net/tags/generative-ai\">generative-ai</a>, <a href=\"https://simonwillison.net/tags/llms\">llms</a>, <a href=\"https://simonwillison.net/tags/slop\">slop</a>, <a href=\"https://simonwillison.net/tags/ai-agents\">ai-agents</a>, <a href=\"https://simonwillison.net/tags/press-quotes\">press-quotes</a>, <a href=\"https://simonwillison.net/tags/openclaw\">openclaw</a></p>",
  "id": "https://simonwillison.net/2026/Feb/2/no-humans-allowed/#atom-everything"
}