{
  "title": "When should we require that firmware be free?",
  "link": "https://mjg59.dreamwidth.org/70895.html",
  "published": "Thu, 12 Dec 2024 15:57:59 GMT",
  "summary": "The distinction between hardware and software has historically been relatively easy to understand - hardware is the physical object that software runs on. This is made more complicated by the existence of programmable logic like FPGAs, but by and large things tend to fall into fairly neat categories if we're drawing that distinction.<br /><br />Conversations usually become more complicated when we introduce firmware, but should they? According to Wikipedia, <q>Firmware is software that provides low-level control of computing device hardware</q>, and basically anything that's generally described as firmware certainly fits into the \"software\" side of the above hardware/software binary. From a software freedom perspective, this seems like something where the obvious answer to \"Should this be free\" is \"yes\", but it's worth thinking about <em>why</em> the answer is yes - the goal of free software isn't freedom for freedom's sake, but because the freedoms embodied in the <a href=\"https://www.gnu.org/philosophy/free-sw.en.html#fs-definition\">Free Software Definition</a> (and by proxy the <a href=\"https://www.debian.org/social_contract#guidelines\">DFSG</a>) are grounded in real world practicalities.<br /><br />How do these line up for firmware? Firmware can fit into two main classes - it can be something that's responsible for initialisation of the hardware (such as, historically, BIOS, which is involved in initialisation and boot and then largely irrelevant for runtime[1]) or it can be something that makes the hardware work at runtime (wifi card firmware being an obvious example). The role of free software in the latter case feels fairly intuitive, since the interface and functionality the hardware offers to the operating system is frequently largely defined by the firmware running on it. Your wifi chipset is, these days, largely a software defined radio, and what you can do with it is determined by what the firmware it's running allows you to do. Sometimes those restrictions may be required by law, but other times they're simply because the people writing the firmware aren't interested in supporting a feature - they may see no reason to allow raw radio packets to be provided to the OS, for instance. We also shouldn't ignore the fact that sufficiently complicated firmware exposed to untrusted input (as is the case in most wifi scenarios) may contain exploitable vulnerabilities allowing attackers to gain arbitrary code execution on the wifi chipset - and potentially use that as a way to gain control of the host OS (see <a href=\"https://googleprojectzero.blogspot.com/2017/04/over-air-exploiting-broadcoms-wi-fi_4.html\">this writeup</a> for an example). Vendors being in a unique position to update that firmware means users may never receive security updates, leaving them with a choice between discarding hardware that otherwise works perfectly or leaving themselves vulnerable to known security issues.<br /><br />But even the cases where firmware does nothing other than initialise the hardware cause problems. A lot of hardware has functionality controlled by registers that can be locked during the boot process. Vendor firmware may choose to disable (or, rather, never to enable) functionality that may be beneficial to a user, and then lock out the ability to reconfigure the hardware later. Without any ability to modify that firmware, the user lacks the freedom to choose what functionality their hardware makes available to them. Again, the ability to inspect this firmware and modify it has a distinct benefit to the user.<br /><br />So, from a practical perspective, I think there's a strong argument that users would benefit from most (if not all) firmware being free software, and I don't think that's an especially controversial argument. So I think this is less of a philosophical discussion, and more of a strategic one - is spending time focused on ensuring firmware is free worthwhile, and if so what's an appropriate way of achieving this?<br /><br />I think there's two consistent ways to view this. One is to view free firmware as <em>desirable</em> but not <em>necessary</em>. This approach basically argues that code that's running on hardware that isn't the main CPU would benefit from being free, in the same way that code running on a remote network service would benefit from being free, but that this is much less important than ensuring that all the code running in the context of the OS on the primary CPU is free. The maximalist position is not to compromise at all - all software on a system, whether it's running at boot or during runtime, and whether it's running on the primary CPU or any other component on the board, should be free.<br /><br />Personally, I lean towards the former and think there's a reasonably coherent argument here. I think users <em>would</em> benefit from the ability to modify the code running on hardware that their OS talks to, in the same way that I think users would benefit from the ability to modify the code running on hardware the other side of a network link that their browser talks to. I also think that there's enough that remains to be done in terms of what's running on the host CPU that it's not worth having that fight yet. But I think the latter is absolutely intellectually consistent, and while I don't agree with it from a pragmatic perspective I think things would undeniably be better if we lived in that world.<br /><br />This feels like a thing you'd expect the Free Software Foundation to have opinions on, and it does! There are two primarily relevant things - the <a href=\"https://ryf.fsf.org\">Respects your Freedoms</a> campaign focused on ensuring that certified hardware meets certain requirements (including around firmware), and the <a href=\"https://www.gnu.org/distros/free-system-distribution-guidelines.html\">Free System Distribution Guidelines</a>, which define a baseline for an OS to be considered free by the FSF (including requirements around firmware).<br /><br />RYF <a href=\"https://ryf.fsf.org/about/criteria\">requires</a> that all software on a piece of hardware be free other than under one specific set of circumstances. If software runs on (a) a secondary processor and (b) <q>within which software installation is not intended after the user obtains the product</q>, then the software does not need to be free. (b) effectively means that the firmware has to be in ROM, since any runtime interface that allows the firmware to be loaded or updated is intended to allow software installation after the user obtains the product.<br /><br />The Free System Distribution Guidelines <a href=\"https://www.gnu.org/distros/free-system-distribution-guidelines.html#nonfree-firmware\">require</a> that all non-free firmware be removed from the OS before it can be considered free. The recommended mechanism to achieve this is via <a href=\"https://www.fsfla.org/ikiwiki/selibre/linux-libre/\">linux-libre</a>, a project that produces tooling to remove anything that looks plausibly like a non-free firmware blob from the Linux source code, along with any incitement to the user to load firmware - including even removing suggestions to update CPU microcode in order to mitigate CPU vulnerabilities.<br /><br />For hardware that requires non-free firmware to be loaded at runtime in order to work, linux-libre doesn't do anything to work around this - the hardware will simply not work. In this respect, linux-libre reduces the amount of non-free firmware running on a system in the same way that removing the hardware would. This presumably encourages users to purchase RYF compliant hardware.<br /><br />But does that actually improve things? RYF doesn't require that a piece of hardware have no non-free firmware, it simply requires that any non-free firmware be hidden from the user. CPU microcode is an instructive example here. At the time of writing, every laptop listed <a href=\"https://ryf.fsf.org/index.php/categories/laptops\">here</a> has an Intel CPU. Every Intel CPU has microcode in ROM, typically an early revision that is known to have many bugs. The expectation is that this microcode is updated in the field by either the firmware or the OS at boot time - the updated version is loaded into RAM on the CPU, and vanishes if power is cut. The combination of RYF and linux-libre doesn't reduce the amount of non-free code running inside the CPU, it just means that the user (a) is more likely to hit since-fixed bugs (including security ones!), and (b) has less guidance on how to avoid them.<br /><br />As long as RYF permits hardware that makes use of non-free firmware I think it hurts more than it helps. In many cases users aren't guided away from non-free firmware - instead it's hidden away from them, leaving them less aware that their freedom is constrained. Linux-libre goes further, refusing to even inform the user that the non-free firmware that their hardware depends on can be upgraded to improve their security.<br /><br />Out of sight shouldn't mean out of mind. If non-free firmware is a threat to user freedom then allowing it to exist in ROM doesn't do anything to solve that problem. And if it isn't a threat to user freedom, then what's the point of requiring linux-libre for a Linux distribution to be considered free by the FSF? We seem to have ended up in the worst case scenario, where nothing is being done to actually replace any of the non-free firmware running on people's systems and where users may even end up with a reduced awareness that the non-free firmware even exists.<br /><br />[1] Yes yes SMM<br /><br /><img alt=\"comment count unavailable\" height=\"12\" src=\"https://www.dreamwidth.org/tools/commentcount?user=mjg59&amp;ditemid=70895\" style=\"vertical-align: middle;\" width=\"30\" /> comments",
  "id": "https://mjg59.dreamwidth.org/70895.html"
}