{
  "title": "The Five Levels: from Spicy Autocomplete to the Dark Factory",
  "link": "https://simonwillison.net/2026/Jan/28/the-five-levels/#atom-everything",
  "published": "2026-01-28T21:44:29+00:00",
  "summary": "<p><strong><a href=\"https://www.danshapiro.com/blog/2026/01/the-five-levels-from-spicy-autocomplete-to-the-software-factory/\">The Five Levels: from Spicy Autocomplete to the Dark Factory</a></strong></p>\nDan Shapiro proposes a five level model of AI-assisted programming, inspired by the five (or rather six, it's zero-indexed) <a href=\"https://www.nhtsa.gov/sites/nhtsa.gov/files/2022-05/Level-of-Automation-052522-tag.pdf\">levels of driving automation</a>.</p>\n<ol start=\"0\">\n<li><strong>Spicy autocomplete</strong>, aka original GitHub Copilot or copying and pasting snippets from ChatGPT.</li>\n<li>The <strong>coding intern</strong>, writing unimportant snippets and boilerplate with full human review.</li>\n<li>The <strong>junior developer</strong>, pair programming with the model but still reviewing every line.</li>\n<li>The <strong>developer</strong>. Most code is generated by AI, and you take on the role of full-time code reviewer.</li>\n<li>The <strong>engineering team</strong>. You're more of an engineering manager or product/program/project manager. You collaborate on specs and plans, the agents do the work.</li>\n<li>The <strong>dark software factory</strong>, like a factory run by robots where the lights are out because robots don't need to see.</li>\n</ol>\n\n<p>Dan says about that last category:</p>\n<blockquote>\n<p>At level 5, it's not really a car any more. You're not really running anybody else's software any more. And your software process isn't really a software process any more. It's a black box that turns specs into software.</p>\n<p>Why Dark? Maybe you've heard of the Fanuc Dark Factory, <a href=\"https://www.organizedergi.com/News/5493/robots-the-maker-of-robots-in-fanuc-s-dark-factory\">the robot factory staffed by robots</a>. It's dark, because it's a place where humans are neither needed nor welcome.</p>\n<p>I know a handful of people who are doing this. They're small teams, less than five people. And what they're doing is nearly unbelievable -- and it will likely be our future.</p>\n</blockquote>\n<p>I've talked to one team that's doing the pattern hinted at here. It was <em>fascinating</em>. The key characteristics:</p>\n<ul>\n<li>Nobody reviews AI-produced code, ever. They don't even look at it.</li>\n<li>The goal of the system is to prove that the system works. A huge amount of the coding agent work goes into testing and tooling and simulating related systems and running demos.</li>\n<li>The role of the humans is to design that system - to find new patterns that can help the agents work more effectively and demonstrate that the software they are building is robust and effective.</li>\n</ul>\n<p>It was a tiny team and they stuff they had built in just a few months looked very convincing to me. Some of them had 20+ years of experience as software developers working on systems with high reliability requirements, so they were not approaching this from a naive perspective.</p>\n<p>I'm hoping they come out of stealth soon because I can't really share more details than this.</p>\n<p><strong>Update 7th February 2026</strong>: The demo was by StrongDM's AI team, and they've now <a href=\"https://simonwillison.net/2026/Feb/7/software-factory/\">gone public with details of how they work</a>.\n\n\n    <p>Tags: <a href=\"https://simonwillison.net/tags/ai\">ai</a>, <a href=\"https://simonwillison.net/tags/generative-ai\">generative-ai</a>, <a href=\"https://simonwillison.net/tags/llms\">llms</a>, <a href=\"https://simonwillison.net/tags/ai-assisted-programming\">ai-assisted-programming</a>, <a href=\"https://simonwillison.net/tags/coding-agents\">coding-agents</a></p>",
  "id": "https://simonwillison.net/2026/Jan/28/the-five-levels/#atom-everything"
}