{
  "title": "Resource Management",
  "link": "http://danieldelaney.net/rm/",
  "published": "Thu, 15 Jun 2017 00:00:00 +0000",
  "summary": "<div class=\"hero\">\n  <img alt=\"Sign In\" src=\"/images/work-rm-sign-in.jpg\" />\n</div>\n<div class=\"call-out\">“We had to display a lot of information at once and help them make sense of it. There are many ways to do that wrong and only a few ways to do it right.”</div>\n\n<h2 id=\"the-challenge\">The Challenge</h2>\n<p>The client came to us with a problem: They had paid for a custom tool that didn’t do what they needed. They had expected ease and efficiency. What they got was frustration and unnecessary manual effort.</p>\n\n<p>What they needed was a tool that could help them plan. How much more work could their team take on right now? Did their team have the capacity to complete their projects next October?</p>\n\n<p>My job was to design a tool that worked for them, not against them.</p>\n\n<h2 id=\"my-process\">My Process</h2>\n<p>My first step was to understand where everything had gone wrong. Who were their users? What were their goals? From there I could see the right way forward to the tool they wished they knew how to ask for.</p>\n\n<p><img alt=\"User Journey\" src=\"/images/work-rm-journey.png\" /></p>\n\n<p>A problem well-understood is half solved. That’s why research is the most important part of my process. I discovered that humans were doing hours of tedious mental labor that a computer could do for them. Their software wasn’t presenting the right information at the right time.</p>\n\n<p>Smart planning requires seeing the big picture and specific details at the same time. We had to display a lot of information at once and help them make sense of it. There are many ways to do that wrong and only a few ways to do it right. I went through dozens of sketches before arriving at a solid direction.</p>\n\n<p><img alt=\"Sketching\" src=\"/images/work-rm-sketching.jpg\" /></p>\n\n<p>While the interface would have to be flexible, it would also need to lead the user to the right conclusions. By providing contextual tips, we could cut guesswork and make the user more efficient.</p>\n\n<p><img alt=\"Help\" src=\"/images/work-rm-help.png\" /></p>\n\n<p>One of the biggest deficiencies of the old system was that it didn’t alert users to upcoming issues. It didn’t offer any help solving them, either. These major omissions defeat the purpose of a planning tool.</p>\n\n<p>Instead of making the user find problems on his own, I designed an alert system. Any conflict or discrepancy is obvious when the user first opens the product. (I’ve recommended e-mail alerts as well.)</p>\n\n<p><img alt=\"Notifications\" src=\"/images/work-rm-notifications.png\" /></p>\n\n<p>When working with dense data, I strip everything down to the essentials. It’s hard enough to see what’s going on in a windstorm of information without having to contend with decoration.</p>\n\n<p>Often, designers use still images to communicate screen designs. In my experience, clickable prototypes are non-negotiable. Nobody knows how a product works until they see it working.</p>\n\n<p>(Design nerd footnote: If you haven’t tried the Craft plug-in for Sketch, you should.)</p>\n\n<video loop=\"\" poster=\"/images/work-rm-invision.jpg\">\n  <source src=\"/images/work-rm-invision.webm\" type=\"video/webm\" />\n  <source src=\"/images/work-rm-invision.mp4\" type=\"video/mp4\" />\n  Sorry, this video didn’t work.\n</video>\n\n<h2 id=\"the-finished-product\">The Finished Product</h2>\n<p>Engineering is putting the real thing together now. Preliminary testing has gone great. I’ve designed solutions to their big problems, plus enhancements they didn’t know they needed. The stakeholders can’t wait to see the product working for real. I’ll keep you posted.</p>\n\n<p><img alt=\"Everything\" src=\"/images/work-rm-everything.png\" /></p>",
  "id": "http://danieldelaney.net/rm/"
}