{
  "title": "Writing my own static site generator",
  "link": "https://maurycyz.com/misc/new_ssg/",
  "published": "Fri, 16 Jan 2026 00:00:00 +0000",
  "summary": "<!-- mksite: start of content -->\n<p>\n\n<em>In principle, a static site generator is a good idea:</em>\nThey automatically populate your homepage, index pages and RSS feeds, making it impossible to forget anything.\n</p><p>\nUnlike a CMS like Wordpress, they don't add runtime cost or security vulnerabilities:\nThey run once to generate your site and are never exposed to the internet.\n</p><p>\nHowever, they all put weird restrictions on how you structure your site:\n<!-- snip -->\n</p>\n<p>\n<em>Nearly all of them require you to write in Markdown</em>, which is common, but poorly specified and difficult to parse.\nAs soon as you do anything more complex then bolding a few words, it becomes a struggle to get the parser to do the right thing.\n</p><p>\nI recently spent way too much time trying to figure out how to stop it from link-ifying something that looked like a URL. \n</p><p>\nIn any case, the whole thing seems pointless:\nI'm writing a <a href=\"/tutorials/website\">website</a>, something that will be published exclusively on the web... so...\n</p><p>\n<h1>Why not just use HTML?</h1>\n</p><p>\n<em>Converting from Markdown</em> would make sense if HTML was super ugly, but it's not.\nHere's what bolding looks like in Markdown:\n</p>\n\n<pre>\nThis is an <b>**important point**</b>\n</pre>\n<p>\n... and here's the same in HTML:\n</p>\n<pre>\nThis is an &lt;b&gt;<b>important point</b>&lt;/b&gt;\n</pre>\n<p>\nThat might be harder to type on a phone keyboard, but if you're writing on a phone, you're not having a good time anyway. \n</p><p>\nThere are some things that suck with HTML, like manual syntax highlighting, but that sucks in any language.\nAdding a whole markdown parser just to improve code blocks is overkill.\n</p><p>\n<em>These translation layers are fragile</em>:\nThe <a href=\"https://info.cern.ch/hypertext/WWW/TheProject.html\">original website</a> still renders fine in modern browsers,\nbut there's no shortage of Wordpress blogs where all the formatting broke after a server update...\nand not just a <a href=\"https://madebynathan.com/posts/2021-12-05-how-docker-saved-my-blog/\">Wordpress problem</a>.\n</p><p>\n<h1>Configuration:</h1>\n</p><p>\nThe Markdown thing is somewhat justifiable:\nA lot of people are more comfortable with markdown then HTML.\n</p><p>\n<em>... but they all use weird template formats</em>, which are really entire programming languages shoved inside HTML:\ncomplete with questionable design decisions and without nearly enough documentation.\nAs a result, it's very difficult to get these tools to do what you want:\n</p><p>\nI knew that something as simple as removing the publication date from pages that shouldn't have one \n(like the <a href=\"/archive\">archives</a>)\nwould result in hours of googling cryptic error messages.\n</p><p>\n<em>Using them doesn't feel like handcrafting a website.</em>\nIt feels like throwing arcane bullshit at the wall and seeing what sticks. \n</p><p>\n<h1>I'll just do it myself:</h1>\n</p><p>\n<em>Each article on my site is an HTML file</em> prefixed with a metadata block:\n\n</p><pre>\ntitle Example page:\ndate 2021-02-11\nedited 2025-01-21\ntag electronics\ntag radiation\n---\n\nParagraph one.\n.\nParagraph two \n&lt;!-- snip --&gt;\n.\n... the rest of the page\n</pre><p>\n\nMy program copies all files from the source tree into the destination directory.\nEverything except HTML is left unchanged.\n</p><p>\nWhen it sees an HTML file:\nThe metadata block is parsed and saved for later.\nEverything else is added to a template with the navigation bar and <a href=\"/misc/inline_css/\">styles</a> and written to the output directory.\n</p><p>\nTo make writing easier, the generator supports using a dot on it's own line:\n</p><p>\n<pre>\n.\n</pre>\n</p><p>\n... as a shorthand for paragraph breaks:\n</p><p>\n<pre>\n&lt;/p&gt;&lt;p&gt;\n</pre>\n</p><p>\nDuring this process, the generator also saves everything before the <span title=\"the perks of HTML\">&lt;!-- snip --&gt;</span> comment as an excerpt for the homepage.\nThis manual because a good excerpt should be long enough get an idea of what the post is about...\nbut not any longer.\n</p><p>\n<em>Once done with the content</em>, all the posts are sorted by date in reverse order:\nThe first 5 are added to the <a href=\"/\">homepage</a>.\nThe first 20 are included in the <a href=\"/index.xml\">the RSS feed</a>. \nAll posts except space photos are included in the <a href=\"/archive/\">archive</a> page. \nAll <a href=\"/tags/\">12 tags</a> get their own index pages.\n</p><p>\nThere's also my <a href=\"/astro/catalog.html\">catalog page</a> which is generated from objects tagged in photos I've taken:\nThe index page has a section for each astronomical catalog (i.e. NGC), with links sorted by their number in that catalog. (i.e. 5194)\nImages of the same object are grouped together, and sorted by date taken.\nEverything shoulds to be on one page for easy searching and browsing. \n</p><p>\n<em>This would be very difficult or even impossible to do in a templateing language</em>, but is trivial with a custom site generator. \n</p><p>\n<b>All of this is contained in a <a href=\"/mksite.c\">single C file</a></b>:\nIt has no configuration files, no external assets and no weird domain-specific-language. \nThe code is ~700 lines, including the template HTML.\nIt's something one person can understand and maintain.\n</p><p>\n<em>I highly recommend doing this</em>:\n</p><p>\n<ul>\n<li>There will never be an update that <a href=\"https://www.ii.com/hugo-update-nope/\">breaks your site</a>.\nSure, you could stay on an old version, but it's only a matter of time before you find an annoying bug.<br /><br /></li>\n<li>You have complete control: Want to write pages in Emacs <a href=\"https://github.com/adityaathalye/shite\">Org-mode</a>? LaTeX? AsciiDoc? Plain text? No problem.<br /><br /></li>\n<li>Do you need something weird and very specific? Just add it.<br /><br /></li>\n</ul>\n</p><p>\nIt's not hard to write one:\nIt took only a few hours of work to get mine to the point it could replace <a href=\"https://gohugo.io/\">Hugo</a> with it's 1000+ dependencies...\nand mine is written in C: Not exactly the friendliest language. \n</p><p>\n<!--\nPreviosly, this site was using <a href=https://gohugo.io/>Hugo</a> which pulls in <em>1000+ dependencies</em> from the internet.\nThis simply <em>too much code</em> for me to ever read.\n</p><p>\nHugo might be the right choice for a company that can afford to pay multiple people to maintain the site full-time.\nFor me, I've spent more time trying to fix it then it took to <em>write a replacement</em>.\n</p><p>\nTo be clear: I'm not hating on Hugo.\nI'm sure it works great for the developers: \nIt's just not the right tool for <em>my site</em> (and probobly not for yours)\n</p><p>\n-->\n<h1>Switching:</h1>\n</p><p>\n<em>The longest part</em> was converting all my 100+ blog posts into the new format. \nThis could have been automated, but I wanted the chance to freshen up the writing.\n(... and it still took less time then configuring <a href=\"https://gohugo.io/\">Hugo.</a>)\n</p><p>\nI started this blog to get better at writing:\n<b>All the posts from before 2023 are bad</b>.\n</p><p>\nReally, wanting to delete everything out of shame proves it's working.\nBut since this is <a href=\"/misc/starting_a_blog/\">a blog</a>, I don't have to delete the old stuff: I can just fix all the mistakes.\n</p><p>\nI made sure to keep all URLs and RSS &lt;guid&gt;-s the same as the old site, so most people shouldn't notice the change. \nIf something broke, please send me an email:\n\n</p><pre>\nblog@maurycyz.com\n</pre><p>\n</p>\n<!-- mksite: end of content -->",
  "id": "http://maurycyz.com/misc/new_ssg/"
}