{
  "title": "How to reverse engineer an analog chip: the TDA7000 FM radio receiver",
  "link": "http://www.righto.com/2025/08/reverse-engineering-analog-TDA7000.html",
  "published": "2025-08-02T08:10:00.000-07:00",
  "summary": "<p>Have you ever wanted to reverse engineer an analog chip from a die photo?\nWanted to understand what's inside the \"black box\" of an integrated circuit?\nIn this article, I explain my reverse engineering process, using the\nPhilips TDA7000 FM radio receiver chip as an example.\nThis chip was the first FM radio receiver on a chip.<span id=\"fnref:first-radio\"><a class=\"ref\" href=\"#fn:first-radio\">1</a></span>\nIt was designed in 1977&mdash;an era of large transistors and a single layer of\nmetal&mdash;so it is much easier to examine than modern chips.\nNonetheless, the TDA7000 is a non-trivial chip with over 100 transistors.\nIt includes common analog circuits such as differential amplifiers and current mirrors, along with\nmore obscure circuits such as Gilbert cell mixers.</p>\n<p><a href=\"https://static.righto.com/images/tda7000/die-labeled.jpg\"><img alt=\"Die photo of the TDA7000 with the main functional blocks labeled. Click this image (or any other) for a larger version. Die photo from IEEE's Microchips that Shook the World exhibit page.\" class=\"hilite\" height=\"383\" src=\"https://static.righto.com/images/tda7000/die-labeled-w700.jpg\" title=\"Die photo of the TDA7000 with the main functional blocks labeled. Click this image (or any other) for a larger version. Die photo from IEEE's Microchips that Shook the World exhibit page.\" width=\"700\" /></a><div class=\"cite\">Die photo of the TDA7000 with the main functional blocks labeled. Click this image (or any other) for a larger version. Die photo from IEEE's <a href=\"https://history.ieee.org/programs/ieee-global-museum/microchips-that-shook-the-world/\">Microchips that Shook the World exhibit page</a>.</div></p>\n<p>The die photo above shows the silicon die of the TDA7000; I've labeled the main functional blocks and some interesting\ncomponents.\nArranged around the border of the chip are 18 bond pads: the pads are connected by thin gold bond wires\nto the pins of the integrated circuit package.\nIn this chip, the silicon appears greenish, with slightly different colors&mdash;gray, pink, and yellow-green&mdash;where the\nsilicon has been \"doped\" with impurities to change its properties.\nCarefully examining the doping patterns will reveal the transistors, resistors, and other microscopic components that make up the chip.</p>\n<p>The most visible part of the die is the metal wiring, the speckled white lines that connect the silicon structures.\nThe metal layer is separated from the silicon underneath by an insulating oxide layer, allowing metal lines to pass over\nother circuitry without problem. Where a metal wire connects to the underlying silicon, a small white square is visible;\nthis square is a hole in the oxide layer, allowing the metal to contact the silicon.</p>\n<p><a href=\"https://static.righto.com/images/tda7000/metal.jpg\"><img alt=\"A close-up of the TDA7000 die, showing metal wiring above circuitry.\" class=\"hilite\" height=\"321\" src=\"https://static.righto.com/images/tda7000/metal-w400.jpg\" title=\"A close-up of the TDA7000 die, showing metal wiring above circuitry.\" width=\"400\" /></a><div class=\"cite\">A close-up of the TDA7000 die, showing metal wiring above circuitry.</div></p>\n<p>This chip has a single layer of metal, so it is much easier to examine than modern chips with a dozen or more\nlayers of metal.\nHowever, the single layer of metal made it much more difficult for the designers to route the wiring while\navoiding crossing wires.\nIn the die photo above, you can see how the wiring meanders around the circuitry in the middle, going the long way\nsince the direct route is blocked.\nLater, I'll discuss some of the tricks that the designers used to make the layout successful.</p>\n<h3>NPN transistors</h3>\n<p>Transistors are the key components in a chip, acting as switches, amplifiers, and other active devices.\nWhile modern integrated circuits are fabricated from MOS transistors, earlier chips such as the TDA7000 were\nconstructed from bipolar\ntransistors: NPN and PNP transistors.\nThe photo below shows an NPN transistor in the TDA7000 as it appears on the chip.\nThe different shades are regions of silicon that have been doped with various impurities, forming N and P regions\nwith different electrical properties.\nThe white lines are the metal wiring connected to the transistor's collector (C), emitter (E), and base (B).\nBelow the die photo, the cross-section diagram shows how the transistor is constructed.\nThe region underneath the emitter forms the N-P-N sandwich that defines the NPN transistor.</p>\n<p><a href=\"https://static.righto.com/images/tda7000/transistor-structure-npn.jpg\"><img alt=\"An NPN transistor and cross-section, adapted from the die photo. The N+ and P+ regions have more doping than the N and P regions.\" class=\"hilite\" height=\"247\" src=\"https://static.righto.com/images/tda7000/transistor-structure-npn-w300.jpg\" title=\"An NPN transistor and cross-section, adapted from the die photo. The N+ and P+ regions have more doping than the N and P regions.\" width=\"300\" /></a><div class=\"cite\">An NPN transistor and cross-section, adapted from the die photo. The N+ and P+ regions have more doping than the N and P regions.</div></p>\n<p>The parts of an NPN transistor can be identified by their appearance. The emitter is a compact spot, surrounded\nby the gray silicon of the base region.\nThe collector is larger and separated from the emitter and base, sometimes separated by a significant distance.\nThe colors may appear different in other chips, but the physical structures are similar.\nNote that although the base is in the middle conceptually, it is often not in the middle of the physical layout.</p>\n<p>The transistor is surrounded by a yellowish-green border of P+ silicon; this border\nis an important part of the structure because it isolates the transistor from neighboring transistors.<span id=\"fnref:isolation\"><a class=\"ref\" href=\"#fn:isolation\">2</a></span>\nThe isolation border is helpful for reverse-engineering because it indicates the boundaries between transistors.</p>\n<h3>PNP transistors</h3>\n<p>You might expect PNP transistors to be similar to NPN transistors, just swapping the roles of N and P silicon.\nBut for a variety of reasons, PNP transistors have an entirely different construction.\nThey consist of a circular emitter (P), surrounded by a ring-shaped base (N), which is surrounded by the collector (P).\nThis forms a P-N-P sandwich horizontally (laterally), unlike the vertical structure of an NPN transistor.\nIn most chips, distinguishing NPN and PNP transistors is straightforward because NPN transistors are rectangular\nwhile PNP transistors are circular.</p>\n<p><a href=\"https://static.righto.com/images/tda7000/transistor-structure-pnp.jpg\"><img alt=\"A PNP transistor and cross-section, adapted from the die photo.\" class=\"hilite\" height=\"225\" src=\"https://static.righto.com/images/tda7000/transistor-structure-pnp-w300.jpg\" title=\"A PNP transistor and cross-section, adapted from the die photo.\" width=\"300\" /></a><div class=\"cite\">A PNP transistor and cross-section, adapted from the die photo.</div></p>\n<p>The diagram above shows one of the PNP transistors in the TDA7000.\nAs with the NPN transistor, the emitter is a compact spot.\nThe collector consists of gray P-type silicon; in contrast, the <em>base</em> of an NPN transistor consists of gray P-type silicon.\nMoreover, unlike the NPN transistor, the base contact\nof the PNP transistor is at a distance, while the collector contact is closer.\n(This is because most of the silicon inside the isolation boundary is N-type silicon. In a PNP transistor, this\nregion is connected to the base, while in an NPN transistor, this region is connected to the collector.)</p>\n<p>It turns out that PNP transistors have poorer performance than NPN transistors for semiconductor reasons<span id=\"fnref:pnp\"><a class=\"ref\" href=\"#fn:pnp\">3</a></span>,\nso most analog circuits use NPN transistors except when PNP transistors are necessary.\nFor instance, the TDA7000 has over 100 NPN transistors but just nine PNP transistors.\nAccordingly, I'll focus my discussion on NPN transistors.</p>\n<h3>Resistors</h3>\n<p>Resistors are a key component of analog chips.\nThe photo below shows a zig-zagging resistor in the TDA7000, formed from gray P-type silicon.\nThe resistance is proportional to the length,<span id=\"fnref:resistance\"><a class=\"ref\" href=\"#fn:resistance\">4</a></span> so large-valued resistors snake back and forth to fit into the available\nspace.\nThe two red arrows indicate the contacts between the ends of the resistor and the metal wiring.\nNote the isolation region around the resistor, the yellowish border.\nWithout this isolation, two resistors (formed of P-silicon) embedded in N-silicon could form an unintentional PNP transistor.</p>\n<p><a href=\"https://static.righto.com/images/tda7000/resistor.jpg\"><img alt=\"A resistor on the die of the TDA7000.\" class=\"hilite\" height=\"242\" src=\"https://static.righto.com/images/tda7000/resistor-w250.jpg\" title=\"A resistor on the die of the TDA7000.\" width=\"250\" /></a><div class=\"cite\">A resistor on the die of the TDA7000.</div></p>\n<p>Unfortunately, resistors in ICs are very inaccurate; the resistances can vary by 50% from chip to chip.\nAs a result, analog circuits are typically designed to depend on the <em>ratio</em> of resistor values, which is\nfairly constant within a chip.\nMoreover, high-value resistors are inconveniently large. We'll see below some techniques to reduce the need for\nlarge resistances.</p>\n<h3>Capacitors</h3>\n<p>Capacitors are another important component in analog circuits.\nThe capacitor below is a \"junction capacitor\", which uses a very large reverse-biased diode as a capacitor.\nThe pink \"fingers\" are N-doped regions, embedded in the gray P-doped silicon.\nThe fingers form a \"comb capacitor\"; this layout maximizes the perimeter area and thus increases the capacitance.\nTo produce the reverse bias, the N-silicon fingers are connected to the positive voltage supply through the upper metal strip.\nThe P silicon is connected to the circuit through the lower metal strip.</p>\n<p><a href=\"https://static.righto.com/images/tda7000/capacitor.jpg\"><img alt=\"A capacitor in the TDA7000. I've blurred the unrelated circuitry.\" class=\"hilite\" height=\"187\" src=\"https://static.righto.com/images/tda7000/capacitor-w500.jpg\" title=\"A capacitor in the TDA7000. I've blurred the unrelated circuitry.\" width=\"500\" /></a><div class=\"cite\">A capacitor in the TDA7000. I've blurred the unrelated circuitry.</div></p>\n<p>How does a diode junction form a capacitor?\nWhen a diode is reverse-biased, the contact region between N and P silicon becomes \"depleted\", forming a thin insulating region between the two conductive silicon regions.\nSince an insulator between two conducting surfaces forms a capacitor, the diode acts as a capacitor.\nOne problem with a diode capacitor is that the capacitance varies with the voltage because the thickness of the\ndepletion region changes with voltage.\nBut as we'll see later, the TDA7000's tuning circuit turns this disadvantage into a feature.</p>\n<p>Other chips often create a capacitor with a plate of metal over silicon, separated by a thin layer of oxide or other dielectric.\nHowever, the manufacturing process for bipolar chips generally doesn't provide thin oxide, so junction capacitors are a common alternative.<span id=\"fnref:capacitors\"><a class=\"ref\" href=\"#fn:capacitors\">5</a></span>\nOn-chip capacitors take up a lot of space and have relatively small capacitance, so IC designers try to avoid capacitors.\nThe TDA7000 has seven on-chip capacitors but most of the capacitors in this design are larger, external capacitors:\nthe chip\nuses 12 of its 18 pins just to connect external capacitors to the necessary points in the internal circuitry.</p>\n<h2>Important analog circuits</h2>\n<p>A few circuits are very common in analog chips.\nIn this section, I'll explain some of these circuits, but first,\nI'll give a highly simplified explanation of an NPN transistor, the minimum you should know for reverse engineering.\n(PNP transistors are similar, except the polarities of the voltages and currents are reversed.\nSince PNP transistors are rare in the TDA7000, I won't go into details.)</p>\n<p>In a transistor, the base controls the current between the collector and\nthe emitter, allowing the transistor to operate as a switch or an amplifier.\nSpecifically, if a small current flows from the base of an NPN transistor to the emitter, a much larger current can flow from the collector\nto the emitter, larger, perhaps, by a factor of 100.<span id=\"fnref:emitter\"><a class=\"ref\" href=\"#fn:emitter\">6</a></span>\nTo get a current to flow, the base must be about 0.6 volts higher than the emitter.\nAs the base voltage continues to increase, the base-emitter current increases exponentially, causing the\ncollector-emitter current to increase.\n(Normally, a resistor will ensure that the base doesn't get much more than 0.6V above the emitter, so the currents\nstay reasonable.)</p>\n<p><a href=\"https://static.righto.com/images/tda7000/transistor-diagram.jpg\"><img alt=\"A comparison of the behavior of NPN transistors and PNP transistors.\" class=\"hilite\" height=\"237\" src=\"https://static.righto.com/images/tda7000/transistor-diagram-w500.jpg\" title=\"A comparison of the behavior of NPN transistors and PNP transistors.\" width=\"500\" /></a><div class=\"cite\">A comparison of the behavior of NPN transistors and PNP transistors.</div></p>\n<p>NPN transistor circuits have some general characteristics.\nWhen there is no base current, the transistor is off: the collector is high and the emitter is low. When the transistor turns on, the current\nthrough the transistor pulls the collector voltage lower and the emitter voltage higher.\nThus, in a rough sense, the emitter is the non-inverting output and the collector is the inverting output.</p>\n<p>The complete behavior of transistors is much more complicated.\nThe nice thing about reverse engineering is that I can assume that the circuit works: the designers needed to\nconsider factors such as the Early effect, capacitance, and beta, but I can ignore them.</p>\n<h3>Emitter follower</h3>\n<p>One of the simplest transistor circuits is the emitter follower.\nIn this circuit, the emitter voltage follows the base voltage, \nstaying about 0.6 volts below the base.\n(The 0.6 volt drop is also called a \"diode drop\" because the base-emitter junction acts like a diode.)</p>\n<p><a href=\"https://static.righto.com/images/tda7000/emitter-follower.jpg\"><img alt=\"An emitter follower circuit.\" class=\"hilite\" height=\"260\" src=\"https://static.righto.com/images/tda7000/emitter-follower-w250.jpg\" title=\"An emitter follower circuit.\" width=\"250\" /></a><div class=\"cite\">An emitter follower circuit.</div></p>\n<p>This behavior can be explained by a feedback loop.\nIf the emitter voltage is too high, the current from the base to the emitter drops, so the current through the\ncollector drops due to the transistor's amplification.\nLess current through the resistor reduces the voltage across the resistor (from Ohm's Law), so the emitter\nvoltage goes down.\nConversely, if the emitter voltage is too low, the base-emitter current increases, increasing the collector current.\nThis increases the voltage across the resistor, and the emitter voltage goes up.\nThus, the emitter voltage adjusts until the circuit is stable; at this point, the emitter is 0.6 volts below the base.</p>\n<p>You might wonder why an emitter follower is useful.\nAlthough the output voltage is lower, the transistor can supply a much higher current.\nThat is, the emitter follower amplifies a weak input current into a stronger output current.\nMoreover, the circuitry on the input side is isolated from the circuitry on the output side,\npreventing distortion or feedback.</p>\n<h3>Current mirror</h3>\n<p>Most analog chips make extensive use of a circuit called a current mirror.\nThe idea is you start with one known current, and then you can \"clone\" multiple copies of the current with a simple transistor circuit, the current mirror.</p>\n<p>In the following circuit, a current mirror is implemented with two identical PNP transistors.\nA reference current passes through the transistor on the right.\n(In this case, the current is set by the resistor.) Since both transistors have the same emitter voltage and base voltage, they source the same current, so the current on the left matches the reference current (more or less).<span id=\"fnref:mirrors\"><a class=\"ref\" href=\"#fn:mirrors\">7</a></span></p>\n<p><a href=\"https://static.righto.com/images/tda7000/current-mirror.jpg\"><img alt=\"A current mirror circuit using PNP transistors.\" class=\"hilite\" height=\"225\" src=\"https://static.righto.com/images/tda7000/current-mirror-w150.jpg\" title=\"A current mirror circuit using PNP transistors.\" width=\"150\" /></a><div class=\"cite\">A current mirror circuit using PNP transistors.</div></p>\n<p>A common use of a current mirror is to replace resistors.\nAs mentioned earlier, resistors inside ICs are inconveniently large.\nIt saves space to use a current mirror instead of multiple resistors whenever possible.\nMoreover, the current mirror is relatively insensitive to the voltages on the different branches, unlike resistors.\nFinally, by changing the size of the transistors (or using multiple collectors of different sizes), a current mirror\ncan provide different currents. </p>\n<p><a href=\"https://static.righto.com/images/tda7000/current-mirror-die.jpg\"><img alt=\"A current mirror on the TDA7000 die.\" class=\"hilite\" height=\"183\" src=\"https://static.righto.com/images/tda7000/current-mirror-die-w400.jpg\" title=\"A current mirror on the TDA7000 die.\" width=\"400\" /></a><div class=\"cite\">A current mirror on the TDA7000 die.</div></p>\n<p>The TDA7000 doesn't use current mirrors as much as I'd expect, but it has a few.\nThe die photo above shows one of its current mirrors, constructed from PNP transistors with their distinctive\nround appearance.\nTwo important features will help you recognize a current mirror.\nFirst, one transistor has its base and collector connected; this is the transistor that controls the current.\nIn the photo, the transistor on the right has this connection.\nSecond, the bases of the two transistors are connected.\nThis isn't obvious above because the connection is through the silicon, rather than in the metal.\nThe trick is that these PNP transistors are inside the same isolation region.\nIf you look at the earlier cross-section of a PNP transistor, the whole N-silicon region is connected\nto the base. \nThus, two PNP transistors in the same isolation region have their bases invisibly linked, even though\nthere is just one base contact from the metal layer.</p>\n<h3>Current sources and sinks</h3>\n<p>Analog circuits frequently need a constant current.\nA straightforward approach is to use a resistor; if a constant voltage is applied, the resistor will produce a constant current.\nOne disadvantage is that circuits can cause the voltage to vary,\ngenerating unwanted current fluctuations.\nMoreover, to produce a small current (and minimize power consumption), the resistor may need to be inconveniently large.\nInstead, chips often use a simple circuit to control the current: this circuit is called a \"current sink\" if the current flows into it and a \"current source\" if the current\nflows out of it.</p>\n<p>Many chips use a current mirror as a current source or sink instead.\nHowever, the TDA7000 uses a different approach: a transistor, a resistor, and a reference voltage.<span id=\"fnref:reference\"><a class=\"ref\" href=\"#fn:reference\">8</a></span>\nThe transistor acts like an emitter follower, causing a fixed voltage across the resistor.\nBy Ohm's Law, this yields a fixed current.\nThus, the circuit sinks a fixed current, controlled by the reference voltage and the size of the resistor.\nBy using a low reference voltage, the resistor can be kept small.</p>\n<p><a href=\"https://static.righto.com/images/tda7000/current-sink.png\"><img alt=\"The current sink circuit used in the TDA7000.\" class=\"hilite\" height=\"258\" src=\"https://static.righto.com/images/tda7000/current-sink-w250.png\" title=\"The current sink circuit used in the TDA7000.\" width=\"250\" /></a><div class=\"cite\">The current sink circuit used in the TDA7000.</div></p>\n<h3>Differential pair amplifier</h3>\n<p>If you see two transistors with the emitters connected, chances are that it is a differential amplifier:\nthe most common two-transistor subcircuit used in analog ICs.<span id=\"fnref:differential\"><a class=\"ref\" href=\"#fn:differential\">9</a></span>\nThe idea of a differential amplifier is that it takes the difference of two inputs and amplifies the result.\nThe differential amplifier is the basis of the operational amplifier (op amp), the comparator, and other circuits.\nThe TDA7000 uses multiple differential pairs for amplification.\nFor filtering, the TDA7000 uses op-amps, formed from differential amplifiers.<span id=\"fnref:op-amps\"><a class=\"ref\" href=\"#fn:op-amps\">10</a></span></p>\n<p>The schematic below shows a simple differential pair.\nThe current sink at the bottom provides a fixed current I, which is split between the two input transistors.\nIf the input voltages are equal, the current will be split equally into the two branches (I1 and I2).\nBut if one of the input voltages is a bit higher than the other, the corresponding transistor will conduct more current,\nso that branch gets more current and the other branch gets less.\nThe resistors in each branch convert the current to a voltage; either side can provide the output.\nA small difference in the input voltages results in a large output voltage, providing the amplification.\n(Alternatively, both sides can be used as a differential output, which can be fed into a second differential amplifier\nstage to provide more amplification.\nNote that the two branches have opposite polarity: when one goes up, the other goes down.)</p>\n<p><a href=\"https://static.righto.com/images/tda7000/differential-pair.png\"><img alt=\"Schematic of a simple differential pair circuit.  The current sink sends a fixed current I through the differential pair.  If the two inputs are equal, the current is split equally between the two branches.  Otherwise, the branch with the higher input voltage gets most of the current.\" class=\"hilite\" height=\"354\" src=\"https://static.righto.com/images/tda7000/differential-pair-w300.png\" title=\"Schematic of a simple differential pair circuit.  The current sink sends a fixed current I through the differential pair.  If the two inputs are equal, the current is split equally between the two branches.  Otherwise, the branch with the higher input voltage gets most of the current.\" width=\"300\" /></a><div class=\"cite\">Schematic of a simple differential pair circuit.  The current sink sends a fixed current I through the differential pair.  If the two inputs are equal, the current is split equally between the two branches.  Otherwise, the branch with the higher input voltage gets most of the current.</div></p>\n<p>The diagram below shows the locations of differential amps, voltage references, mixers, and current mirrors.\nAs you can see, these circuits are extensively used in the TDA7000.</p>\n<p><a href=\"https://static.righto.com/images/tda7000/die-blocks.jpg\"><img alt=\"The die with key circuits labeled.\" class=\"hilite\" height=\"436\" src=\"https://static.righto.com/images/tda7000/die-blocks-w800.jpg\" title=\"The die with key circuits labeled.\" width=\"800\" /></a><div class=\"cite\">The die with key circuits labeled.</div></p>\n<h2>Tips on tracing out circuitry</h2>\n<p>Over the years, I've found various techniques helpful for tracing out the circuitry in an IC.\nIn this section, I'll describe some of those techniques.</p>\n<p>First, take a look at the datasheet if available.\nIn the case of the TDA7000, the datasheet and application note provide a detailed block diagram and a description\nof the functionality.<span id=\"fnref:references\"><a class=\"ref\" href=\"#fn:references\">21</a></span>\nSometimes datasheets include a schematic of the chip, but don't be too trusting: datasheet schematics are often\nsimplified.\nMoreover, different manufacturers may use wildly different implementations for the same part number.\nPatents can also be helpful, but they may be significantly different from the product.</p>\n<p>Mapping the pinout in the datasheet to the pads on the die will make reverse engineering much easier.\nThe power and ground pads are usually distinctive, with thick traces that go to all parts of the chip,\nas shown in the photo below.\nOnce you have identified the power and ground pads, you can assign the other pads in sequence from the datasheet.\nMake sure that these pad assignments make sense. For instance, the TDA7000 datasheet shows special circuitry\nbetween pads 5 and 6 and between pads 13 and 14; the corresponding tuning diodes and RF transistors are visible on\nthe die.\nIn most chips, you can distinguish output pins by the large driver transistors next to the pad, but this\nturns out not to help with the TDA7000.\nFinally, note that chips sometimes have test pads that don't show up in the datasheet.\nFor instance, the TDA7000 has a test pad, shown below; you can tell that it is a test pad because it doesn't\nhave a bond wire.</p>\n<p><a href=\"https://static.righto.com/images/tda7000/pads.jpg\"><img alt=\"Ground, power, and test pads in the TDA7000.\" class=\"hilite\" height=\"203\" src=\"https://static.righto.com/images/tda7000/pads-w500.jpg\" title=\"Ground, power, and test pads in the TDA7000.\" width=\"500\" /></a><div class=\"cite\">Ground, power, and test pads in the TDA7000.</div></p>\n<p>Once I've determined the power and ground pads, I trace out all the power and ground connections on the die.\nThis makes it much easier to understand the circuits and also avoids the annoyance of following a highly-used signal around the\nchip only to discover that it is simply ground.\nNote that NPN transistors will have many collectors connected to power and emitters connected to ground, perhaps through\nresistors. \nIf you find the opposite situation, you probably have power and ground reversed.</p>\n<p>For a small chip, a sheet of paper works fine for sketching out the transistors and their connections.\nBut with a larger chip, I find that more structure is necessary to avoid getting mixed up in a maze of twisty little\nwires, all alike.\nMy solution is to number each component and color each wire as I trace it out, as shown below.\nI use the program KiCad to draw the schematic, using the same transistor numbering.\n(The big advantage of KiCad over paper is that I can move circuits around to get a nicer layout.)</p>\n<p><a href=\"https://static.righto.com/images/tda7000/gimp-diagram.jpg\"><img alt=\"This image shows how I color the wires and number the components as I work on it. I use GIMP for drawing on the die, but any drawing program should work fine.\" class=\"hilite\" height=\"366\" src=\"https://static.righto.com/images/tda7000/gimp-diagram-w500.jpg\" title=\"This image shows how I color the wires and number the components as I work on it. I use GIMP for drawing on the die, but any drawing program should work fine.\" width=\"500\" /></a><div class=\"cite\">This image shows how I color the wires and number the components as I work on it. I use GIMP for drawing on the die, but any drawing program should work fine.</div></p>\n<p>It works better to trace out the circuitry one area at a time, rather than chasing signals all over the chip.\nChips are usually designed with locality, so try to avoid following signals for long distances until you've finished up one block.\nA transistor circuit normally needs to be connected to power (if you follow the collectors) and ground (if you follow the emitters).<span id=\"fnref:connections\"><a class=\"ref\" href=\"#fn:connections\">11</a></span>\nCompleting the circuit between power and ground is more likely to give you a useful functional block than randomly tracing out a chain of transistors.\n(In other words, follow the bases last.)</p>\n<p>Finally, I find that a circuit simulator such as LTspice is handy when trying to understand the behavior of mysterious transistor\ncircuits. I'll often whip up a simulation of a small sub-circuit if its behavior is unclear.</p>\n<h2>How FM radio and the TDA7000 work</h2>\n<p>Before I explain how the TDA7000 chip works, I'll give some background on FM (Frequency Modulation).\nSuppose you're listening to a rock song on 97.3 FM.\nThe number means that the radio station is transmitting at a <em>carrier</em> frequency of 97.3 megahertz.\nThe signal, perhaps a Beyoncé song, is encoded by slightly varying the frequency, increasing the frequency when\nthe signal is positive and decreasing the frequency when the signal is negative.\nThe diagram below illustrates frequency modulation; the input signal (red) modulates the output.\nKeep in mind that the modulation is highly exaggerated in the diagram; the modulation would be invisible in an accurate diagram\nsince a radio broadcast changes the frequency by at most ±75 kHz, less than 0.1% of the carrier frequency.</p>\n<p><a href=\"https://static.righto.com/images/tda7000/Frequency_Modulation.png\"><img alt=\"A diagram showing how a signal (red) modulates the carrier (green), yielding the frequency-modulated output (blue). Created by Gregors, CC BY-SA 2.0.\" class=\"hilite\" height=\"375\" src=\"https://static.righto.com/images/tda7000/Frequency_Modulation-w300.png\" title=\"A diagram showing how a signal (red) modulates the carrier (green), yielding the frequency-modulated output (blue). Created by Gregors, CC BY-SA 2.0.\" width=\"300\" /></a><div class=\"cite\">A diagram showing how a signal (red) modulates the carrier (green), yielding the frequency-modulated output (blue). Created by <a href=\"https://commons.wikimedia.org/wiki/File:Frequency_Modulation.svg\">Gregors</a>, <a href=\"CC BY-SA 2.0\">CC BY-SA 2.0</a>.</div></p>\n<p>FM radio's historical competitor is AM (Amplitude Modulation), which varies the height of the signal (the amplitude)\nrather than the frequency.<span id=\"fnref:satellite\"><a class=\"ref\" href=\"#fn:satellite\">12</a></span>\nOne advantage of FM is that it is more resistant to noise than AM; an event such as lightning will interfere with the signal amplitude but will not change the frequency.\nMoreover, FM radio provides stereo, while AM radio is mono, but this is due to the implementation of radio stations, not a\nfundamental characteristic of FM versus AM.\n(The TDA7000 chip doesn't implement stereo.<span id=\"fnref:stereo\"><a class=\"ref\" href=\"#fn:stereo\">13</a></span>)\nDue to various factors, FM stations require more bandwidth than AM, so\nFM stations are spaced 200 kHz apart while AM stations are just 10 kHz apart.</p>\n<p>An FM receiver such as the TDA7000 must demodulate the radio signal to recover the transmitted audio, converting the changing frequency into a changing signal level.\nFM is more difficult to demodulate than AM, which can literally be done with a piece of rock: lead sulfide in a <a href=\"https://en.wikipedia.org/wiki/Crystal_detector\">crystal detector</a>.\nThere are several ways to implement an FM demodulator; this chip uses a technique called a quadrature detector.\nThe key to a quadrature detector is a circuit that shifts the phase, with the amount of phase shift depending on the frequency.\nThe detector shifts the signal by approximately 90º, multiplies it by the original signal, and then smooths it out with a low-pass filter.\nIf you do this with a sine wave and a 90º phase shift, the result turns out to be 0.\nBut since the phase shift depends on the frequency, a higher frequency gets shifted by more than 90º while a lower frequency gets shifted by less than 90º.\nThe final result turns out to be approximately linear with the frequency, positive for higher frequencies and negative for lower frequencies.\nThus, the FM signal is converted into the desired audio signal.</p>\n<p>Like most radios, the TDA7000 uses a technique called superheterodyning that was invented around 1917.\nThe problem is that FM radio stations use frequencies from 88.0 MHz to 108.0 MHz.\nThese frequencies are too high to conveniently handle on a chip.\nMoreover, it is difficult to design a system that can process a wide range of frequencies.\nThe solution is to shift the desired radio station's signal to a frequency that is fixed and much lower.\nThis frequency is called the <em>intermediate frequency</em>.\nAlthough FM radios commonly use an intermediate frequency of 10.7 MHz, this was still too high for the TDA7000,\nso the designers used an intermediate frequency of just 70 kilohertz.\nThis frequency shift is accomplished through superheterodyning.</p>\n<p>For example, suppose you want to listen to the radio station at 97.3 MHz.\nWhen you tune to this station, you are actually tuning the <em>local oscillator</em> to a frequency that is 70 kHz lower,\n97.23 MHz in this case.\nThe local oscillator signal and the radio signal are mixed by multiplying them. \nIf you multiply two sine waves, you get one sine wave at the difference of the frequencies and another sine wave at\nthe sum of the frequencies.\nIn this case, the two signals are at 70 kHz and 194.53 MHz. \nA low-pass filter (the <em>IF filter</em>) discards everything above 70 kHz, leaving just the desired radio station,\nnow at a fixed and conveniently low frequency.\nThe rest of the radio can then be optimized to work at 70 kHz.</p>\n<h3>The Gilbert cell multiplier</h3>\n<p>But how do you multiply two signals? This is accomplished with a circuit called a Gilbert cell.<span id=\"fnref:multiply\"><a class=\"ref\" href=\"#fn:multiply\">14</a></span>\nThis circuit takes two differential inputs, multiplies them, and produces a differential output.\nThe Gilbert cell is a bit tricky to understand,<span id=\"fnref:gilbert-cell\"><a class=\"ref\" href=\"#fn:gilbert-cell\">15</a></span> but you can think of it as a stack of differential amplifiers,\nwith the current directed along one of four paths, depending on which transistors turn on.\nFor instance, if the A and B inputs are both positive, current will flow through the leftmost transistor,\nlabeled \"pos×pos\".\nLikewise, if the A and B inputs are both negative, current flows through the rightmost transistor,\nlabeled \"neg×neg\".\nThe outputs from both transistors are connected, so both cases produce a positive output.\nConversely, if one input is positive and the other is negative, current flows through one of the middle transistors,\nproducing a negative output.\nSince the multiplier handles all four cases of positive and negative inputs, it is called a \"four-quadrant\" multiplier.</p>\n<p><a href=\"https://static.righto.com/images/tda7000/gilbert-cell2.jpg\"><img alt=\"Schematic of a Gilbert cell.\" class=\"hilite\" height=\"352\" src=\"https://static.righto.com/images/tda7000/gilbert-cell2-w350.jpg\" title=\"Schematic of a Gilbert cell.\" width=\"350\" /></a><div class=\"cite\">Schematic of a Gilbert cell.</div></p>\n<p>Although the Gilbert cell is an uncommon circuit in general, the TDA7000 uses it in multiple places.\nThe first mixer implements the superheterodyning.\nA second mixer provides the FM demodulation, multiplying signals in the quadrature detector described earlier.\nThe TDA7000 also uses a mixer for its correlator, which determines if the chip is tuned to a station or not.<span id=\"fnref:correlator\"><a class=\"ref\" href=\"#fn:correlator\">16</a></span>\nFinally, a Gilbert cell switches the audio off when the radio is not properly tuned.\nOn the die, the Gilbert cell has a nice symmetry that reflects the schematic.</p>\n<p><a href=\"https://static.righto.com/images/tda7000/gilbert-cell-die.jpg\"><img alt=\"This is the Gilbert cell for the first mixer. It has capacitors on either side.\" class=\"hilite\" height=\"309\" src=\"https://static.righto.com/images/tda7000/gilbert-cell-die-w300.jpg\" title=\"This is the Gilbert cell for the first mixer. It has capacitors on either side.\" width=\"300\" /></a><div class=\"cite\">This is the Gilbert cell for the first mixer. It has capacitors on either side.</div></p>\n<h3>The voltage-controlled oscillator</h3>\n<p>One of the trickiest parts of the TDA7000 design is how it manages to use an intermediate frequency of just 70\nkilohertz.\nThe problem is that \nbroadcast FM has a \"modulation frequency deviation\" of 75 kHz, which means that the broadcast frequency varies by\nup to ±75 kHz.\nThe mixer shifts the broadcast frequency down to 70 kHz, but the shifted frequency will vary by the same amount\nas the received signal.\nHow can you have a 70 kilohertz signal that varies by 75 kilohertz? What happens when the frequency goes negative?</p>\n<p>The solution is that the local oscillator frequency (i.e., the frequency that the radio is tuned to) is continuously\nmodified to track the variation in the broadcast frequency.\nSpecifically, a change in the received frequency causes the local oscillator frequency to change, but only by 80% as much.\nFor instance, if the received frequency decreases by 5 hertz, the local oscillator frequency is decreased by 4 hertz.\nRecall that the intermediate frequency is the difference between the two frequencies, generated by the mixer,\nso the intermediate frequency will decrease by just 1 hertz, not 5 hertz.\nThe result is that as the broadcast frequency changes by ±75 kHz, the local oscillator frequency changes by\njust ±15 kHz, so it never goes negative.</p>\n<p>How does the radio constantly adjust the frequency?\nThe fundamental idea of FM is that the frequency shift corresponds to the output audio signal.\nSince the output signal tracks the frequency change, the output signal can be used to modify the local\noscillator's frequency, using a <em>voltage-controlled oscillator</em>.<span id=\"fnref:fll\"><a class=\"ref\" href=\"#fn:fll\">17</a></span>\nSpecifically, the circuit uses special \"varicap\" diodes that vary their capacitance based on the voltage that is applied.\nAs described earlier, the thickness of a diode's \"depletion region\" depends on the voltage applied, so the\ndiode's capacitance will vary with voltage.\nIt's not a great capacitor, but it is good enough to adjust the frequency.</p>\n<p><a href=\"https://static.righto.com/images/tda7000/diode-diagram.jpg\"><img alt=\"The varicap diodes allow the local oscillator frequency to be adjusted.\" class=\"hilite\" height=\"365\" src=\"https://static.righto.com/images/tda7000/diode-diagram-w400.jpg\" title=\"The varicap diodes allow the local oscillator frequency to be adjusted.\" width=\"400\" /></a><div class=\"cite\">The varicap diodes allow the local oscillator frequency to be adjusted.</div></p>\n<p>The image above shows how these diodes appear on the die. The diodes are relatively large and located between\ntwo bond pads.\nThe two diodes have interdigitated \"fingers\"; this increases the capacitance as described earlier with the \"comb capacitor\".\nThe slightly grayish \"background\" region is the P-type silicon, with a silicon control line extending to the right.\n(Changing the voltage on this line changes the capacitance.)\nRegions of N-type silicon are underneath the metal fingers, forming the PN junctions of the diodes.</p>\n<p>Keep in mind that most of the radio tuning is performed with a variable capacitor that\nis external to the chip and adjusts the frequency from 88 MHz to 108 MHz. The capacitance of the diodes\nprovides the  much smaller adjustment of ±60 kHz.\n  Thus, the diodes only need to provide a small capacitance shift.</p>\n<p>The VCO and diodes will also adjust the frequency to lock onto the station if the tuning is off by a moderate amount, say, 100 kHz. However, if the tuning is off by a large amount, say, 200 kHz, the FM detector has a \"sideband\" and the VCO can erroneously lock onto this sideband. This is a problem because the sideband is weak and nonlinear so reception will be bad and will have harmonic distortion. To avoid this problem, the correlator will detect that the tuning is too far off (i.e. the local oscillator is way off from 70 kHz) and will replace the audio with white noise. Thus, the user will realize that they aren't on the station and adjust the tuning, rather than listening to distorted audio and blaming the radio.</p>\n<h3>Noise source</h3>\n<p>Where does the radio get the noise signal to replace distorted audio?\nThe noise is generated from the circuit below, which uses the thermal noise from diodes, amplified by\na differential amplifier.\nSpecifically, each side of the differential amplifier is connected to two transistors that are wired as diodes\n(using the base-emitter junction).\nRandom thermal fluctuations in the transistors will produce small voltage changes on either side of the amplifier.\nThe amplifier boosts these fluctuations,\ncreating the white noise output.</p>\n<p><a href=\"https://static.righto.com/images/tda7000/noise-schematic.jpg\"><img alt=\"The circuit to generate white noise.\" class=\"hilite\" height=\"310\" src=\"https://static.righto.com/images/tda7000/noise-schematic-w400.jpg\" title=\"The circuit to generate white noise.\" width=\"400\" /></a><div class=\"cite\">The circuit to generate white noise.</div></p>\n<h3>Layout tricks and unusual transistors</h3>\n<p>Because this chip has just one layer of metal, the designers had to go to considerable effort to connect\nall the components without wires crossing.\nOne common technique to make routing easier is to separate a transistor's emitter, collector, and base,\nallowing wires to pass over the transistor.\nThe transistor below is an example. Note that the collector, base, and emitter have been stretched apart,\nallowing one wire to pass between the collector and the base, while two more\npass between the base and the emitter.\nMoreover, the transistor layout is flexible: this one has the base in the middle, while many others have the\nemitter in the middle. (Putting the collector in the middle won't work since the base needs to be next to the emitter.)</p>\n<p><a href=\"https://static.righto.com/images/tda7000/transistor-layout.jpg\"><img alt=\"A transistor with gaps between the collector, base, and emitter.\" class=\"hilite\" height=\"123\" src=\"https://static.righto.com/images/tda7000/transistor-layout-w300.jpg\" title=\"A transistor with gaps between the collector, base, and emitter.\" width=\"300\" /></a><div class=\"cite\">A transistor with gaps between the collector, base, and emitter.</div></p>\n<p>The die photo below illustrates a few more routing tricks.\nThis photo shows one collector, three emitters, and four bases, but there are three transistors.\nHow does that work?\nFirst, these three transistors are in the same isolation region, so they share the same \"tub\" of N-silicon.\nIf you look back at the cross-section of an NPN transistor, you'll see that this tub is connected to the collector contact.\nThus, all three transistors share the same collector.<span id=\"fnref:collectors\"><a class=\"ref\" href=\"#fn:collectors\">18</a></span>\nNext, the two bases on the left are connected to the same gray P-silicon. Thus, the two base contacts are\nconnected and function as a single base.\nIn other words, this is a trick to connect the two base wires together through the silicon,\npassing under the four other metal wires in the way.\nFinally, the two transistors on the right have the emitter and base slightly separated so a wire can pass between them.\nWhen reverse-engineering a chip, be on the lookout for unusual transistor layouts such as these.</p>\n<p><a href=\"https://static.righto.com/images/tda7000/transistors.jpg\"><img alt=\"Three transistors with an unusual layout.\" class=\"hilite\" height=\"148\" src=\"https://static.righto.com/images/tda7000/transistors-w600.jpg\" title=\"Three transistors with an unusual layout.\" width=\"600\" /></a><div class=\"cite\">Three transistors with an unusual layout.</div></p>\n<p>When all else failed, the designers could use a \"cross-under\" to let a wire pass under other wires.\nThe cross-under is essentially a resistor with a relatively low resistance, formed from N-type silicon (pink\nin the die photo below).\nBecause silicon has much higher resistance than metal, cross-unders are avoided unless necessary.\nI see just two cross-unders in the TDA7000.</p>\n<p><a href=\"https://static.righto.com/images/tda7000/cross-under.jpg\"><img alt=\"A cross-under in the TDA7000.\" class=\"hilite\" height=\"151\" src=\"https://static.righto.com/images/tda7000/cross-under-w300.jpg\" title=\"A cross-under in the TDA7000.\" width=\"300\" /></a><div class=\"cite\">A cross-under in the TDA7000.</div></p>\n<p>The circuit that caused me the most difficulty is the noise generator below.\nThe transistor highlighted in red below looks straightforward: a resistor is connected to the collector, which is connected to the base.\nHowever, the transistor turned out to be completely different: the collector (red arrow) is on the other side of the circuit and this collector is shared with five other transistors.\nThe structure that I thought was the collector is simply the contact at the end of the resistor, connected to the base.</p>\n<p><a href=\"https://static.righto.com/images/tda7000/noise-annotated.jpg\"><img alt=\"The transistors in the noise generator, with a tricky transistor highlighted.\" class=\"hilite\" height=\"362\" src=\"https://static.righto.com/images/tda7000/noise-annotated-w400.jpg\" title=\"The transistors in the noise generator, with a tricky transistor highlighted.\" width=\"400\" /></a><div class=\"cite\">The transistors in the noise generator, with a tricky transistor highlighted.</div></p>\n<h2>Conclusions</h2>\n<p>The TDA7000 almost didn't become a product.\nIt was invented in 1977 by two engineers at the Philips research labs in the Netherlands.\nAlthough Philips was an innovative consumer electronics company in the 1970s, the Philips radio group\nwasn't interested in an FM radio chip.\nHowever, a rogue factory manager built a few radios with the chips and sent them to Japanese companies.\nThe Japanese companies loved the chip and ordered a million of them, convincing Philips to sell the chips.</p>\n<p>The TDA7000 became a product in 1983&mdash;six years after its creation&mdash;and reportedly more than 5 billion have now been sold.<span id=\"fnref:spectrum\"><a class=\"ref\" href=\"#fn:spectrum\">19</a></span>\nAmong other things, the chip allowed an FM radio to be built into a wristwatch, with the headphone serving as an antenna.\nSince the TDA7000 vastly simplified the construction of a radio, the chip was also popular with electronics hobbyists.\n<a href=\"https://archive.org/details/electronics-the-maplin-magazine/Maplin-Electronics-1988-06-027/mode/2up\">Hobbyist</a>\n<a href=\"https://archive.org/details/PopularElectronics199405/page/n72/mode/1up\">magazines</a>\nprovided <a href=\"https://archive.org/details/radioreceiverpro00unse/page/255/mode/1up\">plans</a> and the\nchip could be obtained from Radio Shack.<span id=\"fnref:radio-shack\"><a class=\"ref\" href=\"#fn:radio-shack\">20</a></span></p>\n<p><a href=\"https://static.righto.com/images/tda7000/wristwatch.jpg\"><img alt=\"A wristwatch using the TDA7010T, the Small Outline package version of the TDA7000.\nFrom FM receivers for mono and stereo on a single chip, Philips Technical Review.\" class=\"hilite\" height=\"282\" src=\"https://static.righto.com/images/tda7000/wristwatch-w400.jpg\" title=\"A wristwatch using the TDA7010T, the Small Outline package version of the TDA7000.\nFrom FM receivers for mono and stereo on a single chip, Philips Technical Review.\" width=\"400\" /></a><div class=\"cite\">A wristwatch using the TDA7010T, the Small Outline package version of the TDA7000.\nFrom <a href=\"https://www.cool386.com/tda7000/technical_review.pdf\">FM receivers for mono and stereo on a single chip</a>, Philips Technical Review.</div></p>\n<p>Why reverse engineer a chip such as the TDA7000?\nIn this case, I was answering some questions for the IEEE microchips exhibit, but even when reverse engineering\nisn't particularly useful, I enjoy discovering the logic behind the\nmysterious patterns on the die.\nMoreover, the TDA7000 is a nice chip for reverse engineering because it has large features that are easy to follow,\nbut it also has many different circuits.\nSince the chip has over 100 transistors, you might want to start with a simpler chip, but the TDA7000 is a good\nexercise if you want to increase your reverse-engineering skills.\nIf you want to check your results, my schematic of the TDA7000 is <a href=\"https://static.righto.com/images/tda7000/schematic2.pdf\">here</a>; I don't guarantee 100% accuracy :-)\nIn any case, I hope you have enjoyed this look at reverse engineering.</p>\n<p>Follow me on\nBluesky (<a href=\"https://bsky.app/profile/righto.com\">@righto.com</a>),\nMastodon (<a href=\"https://oldbytes.space/@kenshirriff\">@kenshirriff@oldbytes.space</a>),\nor <a href=\"http://www.righto.com/feeds/posts/default\">RSS</a>.\n(I've given up on Twitter.)\nThanks to Daniel Mitchell for asking me about the TDA7000 and providing the die photo; be sure to\ncheck out the IEEE Chip Hall of Fame's <a href=\"https://spectrum.ieee.org/chip-hall-of-fame-philips-tda7000-fm-receiver\">TDA7000 article</a>.</p>\n<h2>Notes and references</h2>\n<div class=\"footnote\">\n<ol>\n<li id=\"fn:first-radio\">\n<p>The first \"radio-on-a-chip\" was probably the Ferranti <a href=\"https://en.wikipedia.org/wiki/ZN414\">ZN414</a> from 1973, which implemented an AM radio.\nAn AM radio receiver is much simpler than an FM receiver (you really just need a diode), explaining why the\nAM radio ZN414 was a decade earlier than the FM radio TDA7000.\nAs a 1973 article <a href=\"https://www.worldradiohistory.com/Archive-Electronics/70s/73/Electronics-1973-08-16.pdf#page=40\">stated</a>, \"There are so few transistors in most AM radios that set manufacturers\nsee little profit in developing new designs around integrated circuits merely to shave already low\nsemiconductor costs.\"\nThe ZN414 has just three pins and comes in a plastic package resembling a\ntransistor.\nThe ZN414 contains only <a href=\"https://www.worldradiohistory.com/Archive-Radio-Electronics/70s/1973/Radio-Electronics-1973-10.pdf#page=47\">10 transistors</a>, compared to about 132 in the TDA7000.&#160;<a class=\"footnote-backref\" href=\"#fnref:first-radio\" title=\"Jump back to footnote 1 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:isolation\">\n<p>The transistors are isolated by the P+ band that surrounds them. Because this band is tied to ground, it is at a lower\nvoltage than the neighboring N regions.\nAs a result, the PN border between transistor regions acts as a reverse-biased diode PN junction and current can't flow.\n(For current to flow, the P region must be positive and the N region must be negative.)</p>\n<p>The invention of this isolation technique was a key step in making integrated circuits practical.\nIn earlier integrated circuits, the regions were physically separated and the gaps were filled with non-conductive\nepoxy. This manufacturing process was both difficult and unreliable.&#160;<a class=\"footnote-backref\" href=\"#fnref:isolation\" title=\"Jump back to footnote 2 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:pnp\">\n<p>NPN transistors perform better than PNP transistors due to semiconductor physics.\nSpecifically, current in NPN transistors is primarily carried by electrons, while current in PNP transistors\nis primarily carried by \"holes\", the positively-charged absence of an electron.\nIt turns out that electrons travel better in silicon than holes&mdash;their \"mobility\" is higher.</p>\n<p>Moreover, the lateral construction of a PNP transistor results in a worse transistor\nthan the vertical construction of an NPN transistor.\nWhy can't you just swap the P and N domains to make a vertical PNP transistor?\nThe problem is that the doping elements aren't interchangeable: boron is used to create P-type silicon, but\nit diffuses too rapidly and isn't soluble enough in silicon to make a good vertical PNP transistor.\n(See page 280 of <a href=\"https://amzn.to/46DUEna\">The Art of Analog Layout</a> for details).\nThus, ICs are designed to use NPN transistors instead of PNP transistors as much as possible.&#160;<a class=\"footnote-backref\" href=\"#fnref:pnp\" title=\"Jump back to footnote 3 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:resistance\">\n<p>The resistance of a silicon resistor is proportional to its length divided by its width.\n(This makes sense since increasing the length is like putting resistors in series, while increasing the width is\nlike putting resistors in parallel.)\nWhen you divide length by width, the units cancel out, so \nthe resistance of silicon is described with the curious unit ohms per square (Ω/□).\n(If a resistor is 5 mm long and 1 mm wide, you can think of it as five squares in a chain; the same if it is\n5 µm by 1 µm. It has the same resistance in both cases.)</p>\n<p>A few resistances are mentioned on the TDA7000 schematic in the datasheet. By measuring the corresponding resistors on the die, I calculate\nthat the resistance on the die is about 200 ohms per square (Ω/□).&#160;<a class=\"footnote-backref\" href=\"#fnref:resistance\" title=\"Jump back to footnote 4 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:capacitors\">\n<p>See <a href=\"https://amzn.to/46DUEna\">The Art of Analog Layout</a> page 197 for more information on junction capacitors.&#160;<a class=\"footnote-backref\" href=\"#fnref:capacitors\" title=\"Jump back to footnote 5 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:emitter\">\n<p>You might wonder about the names \"emitter\" and \"collector\"; it seems backward that current flows from the\ncollector to the emitter.\nThe reason is that in an NPN transistor, the emitter emits electrons, they flow to the collector, and the\ncollector collects them.\nThe confusion arises because Benjamin Franklin arbitrarily stated that current flows from positive to negative.\nUnfortunately this \"conventional current\" flows in the opposite direction from the actual electrons.\nOn the other hand, a PNP transistor uses holes&mdash;the absence of electrons&mdash;to transmit current.\nPositively-charged holes flow from the PNP transistor's emitter to the collector, so the flow of charge\ncarriers matches the \"conventional current\" and the names \"emitter\" and \"collector\" make more sense.&#160;<a class=\"footnote-backref\" href=\"#fnref:emitter\" title=\"Jump back to footnote 6 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:mirrors\">\n<p>The basic current mirror circuit isn't always accurate enough.\nThe TDA7000's current mirrors improve the accuracy by adding <a href=\"https://www.allaboutcircuits.com/textbook/designing-analog-chips/current-mirrors/improved-bipolar-current-mirrors/\">emitter degeneration resistors</a>.\nOther chips use additional transistors for accuracy; some circuits  are <a href=\"https://wiki.analog.com/university/courses/electronics/text/chapter-11#imperfections_of_the_simple_mirror\">here</a>.&#160;<a class=\"footnote-backref\" href=\"#fnref:mirrors\" title=\"Jump back to footnote 7 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:reference\">\n<p>The reference voltages are produced with versions of the circuit below, with the output voltage controlled\nby the resistor values.\nIn more detail, the bottom transistor is wired as a diode, providing a voltage drop of 0.6V.\nSince the upper transistor acts as an emitter follower,\nits base \"should\" be at 1.2V.\nThe resistors form a feedback loop with the base: the current (I) will adjust until the voltage drop across R1\nyields a base voltage of 1.2V.\nThe fixed current (I) through the circuit produces a voltage drop across R1 and R2, determining the output voltage.\n(This circuit isn't a voltage regulator; it assumes that the supply voltage is stable.)</p>\n<p><a href=\"https://static.righto.com/images/tda7000/voltage-reference.jpg\"><img alt=\"The voltage reference circuit.\" class=\"hilite\" height=\"349\" src=\"https://static.righto.com/images/tda7000/voltage-reference-w250.jpg\" title=\"The voltage reference circuit.\" width=\"250\" /></a><div class=\"cite\">The voltage reference circuit.</div></p>\n<p>Note that this circuit will produce a reference voltage between 0.6V and 1.2V.\nWithout the lower transistor, the voltage would be below 0.6V, which is too low for the current sink circuit.\nA closer examination of the circuit shows that the output voltage depends on the <em>ratio</em> between the resistances,\nnot the absolute resistances.\nThis is beneficial since, as explained earlier, resistors on integrated circuits have inaccurate absolute resistances,\nbut the ratios are much more constant.&#160;<a class=\"footnote-backref\" href=\"#fnref:reference\" title=\"Jump back to footnote 8 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:differential\">\n<p>Differential pairs are also called long-tailed pairs.\nAccording to <a href=\"https://www.amazon.com/gp/product/0470245999/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0470245999&amp;linkCode=as2&amp;tag=rightocom&amp;linkId=M7Y4IGG5INYYFPEW\">Analysis and Design of Analog Integrated Circuits</a>, differential pairs are \"perhaps the most widely used two-transistor subcircuits in monolithic analog circuits.\" (p214)</p>\n<p>Note that the transistors in the differential pair act like an emitter follower controlled by the higher input.\nThat is, the emitters will be 0.6 volts below the <em>higher</em> base voltage.\nThis is important since it shuts off the transistor with the lower base.\n(For example, if you put 2.1 volts in one base and 2.0 volts in the other base, you might expect that the base voltages\nwould turn both transistors on. But the emitters are forced to 1.5 volts (2.1 - 0.6).\nThe base-emitter voltage of the second transistor is now 0.5 volts (2.0 - 1.5), which is not enough to turn\nthe transistor on.)&#160;<a class=\"footnote-backref\" href=\"#fnref:differential\" title=\"Jump back to footnote 9 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:op-amps\">\n<p>Filters are very important to the TDA7000 and these filters are implemented by op-amps.\nIf you want details, take a look at the\n<a href=\"https://www.tel.uva.es/personales/tri/radio_TDA7000.pdf\">application note</a>, which describes the\n\"second-order low-pass Sallen-Key\" filter, first-order high-pass filter, active all-pass filter, and other\nfilters.&#160;<a class=\"footnote-backref\" href=\"#fnref:op-amps\" title=\"Jump back to footnote 10 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:connections\">\n<p>Most transistor circuits connect (eventually) to power and ground.\nOne exception is open-collector outputs or other circuits with a pull-up resistor outside the chip.&#160;<a class=\"footnote-backref\" href=\"#fnref:connections\" title=\"Jump back to footnote 11 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:satellite\">\n<p>Nowadays, satellite radio such as SiriusXM provides another competitor to FM radio.\nSiriusXM uses QPSK (Quadrature Phase-Shift Keying), which encodes a digital signal by encoding pairs of bits\nusing one of four different phase shifts.&#160;<a class=\"footnote-backref\" href=\"#fnref:satellite\" title=\"Jump back to footnote 12 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:stereo\">\n<p>FM stereo is broadcast in a clever way that allows it to be backward-compatible with mono FM receivers.\nSpecifically, the mono signal consists of the sum of the left and right channels, so you hear both channels combined.\nFor stereo, the difference between the channels is also transmitted: the left channel minus the right channel.\nAdding this to the mono signal gives you the desired left channel, while subtracting this from the mono signal gives you the desired right channel.\nThis stereo signal is shifted up in frequency using a somewhat tricky modulation scheme, occupying the audio frequency range from 23 kHz to 53 kHz, while the mono signal occupies the range 0 kHz to 15 kHz.\n(Note: these channels are combined to make an audio-frequency signal <em>before</em> the frequency modulation.) A mono FM receiver uses a low-pass filter to strip out the stereo signal so you hear the mono channel, while a stereo FM receiver has the circuitry to shift the stereo signal down and then add or subtract it.\nA later chip, the <a href=\"https://www.futurlec.com/Philips/TDA7021T.shtml\">TDA7021T</a>, supported a stereo signal, although it required a separate stereo decoder chip (<a href=\"https://www.futurlec.com/Philips/TDA7040T.shtml\">TDA7040T</a>)to generate the left and right channels.&#160;<a class=\"footnote-backref\" href=\"#fnref:stereo\" title=\"Jump back to footnote 13 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:multiply\">\n<p>A while ago, I wrote about the Rockwell <a href=\"https://www.righto.com/2020/09/how-to-multiply-currents-inside.html\">RC4200</a> analog multiplier chip.\nIt uses a completely different technique from the Gilbert cell, essentially adding logarithms\nto perform multiplication.&#160;<a class=\"footnote-backref\" href=\"#fnref:multiply\" title=\"Jump back to footnote 14 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:gilbert-cell\">\n<p>For a detailed explanation of the Gilbert cell, see <a href=\"https://pa3fwm.nl/technotes/tn34-gilbert-cell-mixer.html\">Gilbert cell mixers</a>.&#160;<a class=\"footnote-backref\" href=\"#fnref:gilbert-cell\" title=\"Jump back to footnote 15 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:correlator\">\n<p>The TDA7000's correlator determines if the radio is correctly tuned or not.\nThe idea is to multiply the signal by the signal delayed by half a cycle (180º) and inverted.\nIf the signal is valid, the two signals match, giving a uniformly positive product.\nBut if the frequency is off, the delay will be off, the signals won't match, and the product will be lower.\nLikewise, if the signal is full of noise, the signals won't match.</p>\n<p>If the radio is mistuned, the audio is muted: the correlator provides the mute control signal.\nSpecifically, when tuned properly, you hear the audio output, but when not tuned, the audio is replaced with a white noise signal, providing an indication that the tuning is wrong.\nThe muting is accomplished with a Gilbert cell, but in a slightly unusual way.\nInstead of using differential inputs, the output audio is fed into one input branch and a white noise signal is fed into the other input branch.\nThe mute control signal is fed into the upper transistors, selecting either the audio or the white noise.\nYou can think of it as multiplying by +1 to get the audio and multiplying by -1 to get the noise.&#160;<a class=\"footnote-backref\" href=\"#fnref:correlator\" title=\"Jump back to footnote 16 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:fll\">\n<p>The circuit to track the frequency is called a Frequency-Locked Loop; it is analogous to a Phase-Locked Loop,\nexcept that the phase is not tracked.&#160;<a class=\"footnote-backref\" href=\"#fnref:fll\" title=\"Jump back to footnote 17 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:collectors\">\n<p>Some chips genuinely have transistors with multiple collectors, typically PNP transistors in current mirrors to produce multiple currents.\nOften these collectors have different sizes to generate different currents.\nNPN transistors with multiple emitters are used in TTL logic gates, while NPN transistors with multiple collectors are used in Integrated Injection Logic, a short-lived logic family from the 1970s.&#160;<a class=\"footnote-backref\" href=\"#fnref:collectors\" title=\"Jump back to footnote 18 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:spectrum\">\n<p>The history of the TDA7000 is based on the IEEE Spectrum article <a href=\"https://spectrum.ieee.org/chip-hall-of-fame-philips-tda7000-fm-receiver\">Chip Hall of Fame: Philips TDA7000 FM Receiver</a>.\nAlthough the article claims that \"more than 5 billion TDA7000s and variants have been sold\", I'm a bit skeptical\nsince that is more than the world's population at the time.\nMoreover, <a href=\"https://www.cool386.com/tda7000/tda7000.html\">this detailed page</a> on the TDA7000 states that\nthe TDA7000 \"found its way into a very few commercially made products\".&#160;<a class=\"footnote-backref\" href=\"#fnref:spectrum\" title=\"Jump back to footnote 19 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:radio-shack\">\n<p>The TDA7000 was sold at stores such as Radio Shack;\nthe listing below is from the 1988 catalog.</p>\n<p><a href=\"https://static.righto.com/images/tda7000/radio-shack.jpg\"><img alt=\"The TDA7000 was listed in the 1988 Radio Shack Catalog.\" class=\"hilite\" height=\"290\" src=\"https://static.righto.com/images/tda7000/radio-shack-w350.jpg\" title=\"The TDA7000 was listed in the 1988 Radio Shack Catalog.\" width=\"350\" /></a><div class=\"cite\">The TDA7000 was listed in the <a href=\"https://www.radioshackcatalogs.com/flipbook/1988_radioshack_catalog.html?fb3d-page=92\">1988 Radio Shack Catalog</a>.</div></p>\n<p><!-- -->&#160;<a class=\"footnote-backref\" href=\"#fnref:radio-shack\" title=\"Jump back to footnote 20 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:references\">\n<p>The TDA7000 is well documented, including the\n<a href=\"https://www.futurlec.com/Philips/TDA7000.shtml\">datasheet</a>, <a href=\"https://www.tel.uva.es/personales/tri/radio_TDA7000.pdf\">application note</a>,\na <a href=\"https://www.cool386.com/tda7000/technical_review.pdf\">technical review</a>,\nan <a href=\"https://www.worldradiohistory.com/Archive-Company-Publications/Philips-Technical-Review/Electronic-Compoinents/Electronic-Components-&amp;-Apps-Vol-5-No-3.pdf?page=32\">article</a>,\nand <a href=\"https://patents.google.com/patent/NL8200959A/en\">Netherlands</a> and\n<a href=\"https://patents.google.com/patent/US4523328A/en\">US</a> patents.</p>\n<p>The die photo is from\n<a href=\"https://history.ieee.org/programs/ieee-global-museum/microchips-that-shook-the-world/\">IEEE Microchips that Shook the World</a> and the history is from <a href=\"https://spectrum.ieee.org/chip-hall-of-fame-philips-tda7000-fm-receiver\">IEEE Chip Hall of Fame: Philips TDA7000 FM Receiver</a>.\nThe <a href=\"https://www.cool386.com/tda7000/tda7000.html\">Cool386 page on the TDA7000</a> has collected a large amount\nof information and is a useful resource.</p>\n<p>The application note has a detailed block diagram, which makes reverse engineering easier:</p>\n<p><a href=\"https://static.righto.com/images/tda7000/tda7000-block-diagram.jpg\"><img alt=\"Block diagram of the TDA7000 with external components. From the TDA7000 application note 192\" class=\"hilite\" height=\"626\" src=\"https://static.righto.com/images/tda7000/tda7000-block-diagram-w700.jpg\" title=\"Block diagram of the TDA7000 with external components. From the TDA7000 application note 192\" width=\"700\" /></a><div class=\"cite\">Block diagram of the TDA7000 with external components. From the <a href=\"https://www.tel.uva.es/personales/tri/radio_TDA7000.pdf\">TDA7000 application note 192</a></div></p>\n<p>If you're interested in analog chips, I highly recommend the book \n<em>Designing Analog Chips</em>, written by Hans Camenzind, the inventor of the famous 555 timer.\nThe free PDF is <a href=\"http://www.designinganalogchips.com/\">here</a> or get the <a href=\"https://amzn.to/40N1Aut\">book</a>.</p>\n<p><!-- -->&#160;<a class=\"footnote-backref\" href=\"#fnref:references\" title=\"Jump back to footnote 21 in the text\">&#8617;</a></p>\n</li>\n</ol>\n</div>",
  "id": "tag:blogger.com,1999:blog-6264947694886887540.post-2494871487466089942"
}