{
  "title": "How do you do, fellow web developers? A growing disconnect.",
  "link": "https://rakhim.exotext.com/web-developers-a-growing-disconnect",
  "published": "Thu, 19 Dec 2024 00:00:00 GMT",
  "summary": "<p>I had a &quot;woah&quot; moment once when one programmer got genuinely baffled about the fact that a website somehow &quot;erases&quot; the history of requests from the Network tab of Chrome DevTools. He was wondering what magic method was used to hide the communication. He hadn't realized the app was not a single-page JS application (SPA), and he actually <em>wasn't aware</em> there is another way to make web apps. The idea that each click actually makes the browser fetch a completely new page, without any JS involved, was alien to him. </p>\n<p>I feel a growing disconnect between my notion of programming and the younger web developers' notion of it. I promise, this isn't a get-off-my-lawn post.</p>\n<p>I'm not that old (right?..), 36 as of today, and have been programming since 11. My first lines of code were written on a 80286 16-bit machine (there weren't too many modern computers in our small town at the time). So, there are full-time developers today who had started their journeys after I had a few years of dabbling in code. There are young devs who were born when I was 18 and had a few part-time jobs done. </p>\n<p>There's been a lot of talk about modern programmers not knowing how fast computers are (<a href=\"https://computers-are-fast.github.io/\">Do you know how much your computer can do in a second?</a>,  <a href=\"https://www.youtube.com/watch?v=j7wu_4_2PQ4\">Jon Blow's rant</a>, <a href=\"https://www.youtube.com/watch?v=hxM8QmyZXtg\">Casey Muratori: How fast should an unoptimized terminal run?</a>). There are so many levels of rich abstractions on top of hardware and even the OS kernel, one can make some arguments to justify the obliviousness of someone who needs to develop a product feature in some web shop. I'm not talking about this today, but I do want to talk about abstraction levels. My growing feeling of disconnect gets fueled mostly by seemingly <em>shifting</em> notions. Some examples I've heard are people saying &quot;vanilla JS&quot; when talking about Node, or saying &quot;JS without frameworks&quot; when talking about React. The &quot;woah&quot; moment from the first paragraph is another example.</p>\n<p>Today I watched the <a href=\"https://youtu.be/POzGAQ7XyZg?si=KuyS_YCYBPpMiRf4\">pilot episode of Leet Heat</a>, a game show for developers. It's cool! I enjoyed watching it, but at the same time it refueled this feeling of disconnect. First, it's meant for <em>developers</em>, not just web developers. But the categories are:</p>\n<ul>\n<li>Web standards</li>\n<li>Typescript</li>\n<li>Frameworks</li>\n<li>Databases</li>\n<li>Computer Science</li>\n</ul>\n<p>You can guess that Frameworks is only about front-end web frameworks like React and Vue, and databases is about some unspecified SQL format and also Mongo. And then there's Computer Science. One of the questions there was:</p>\n<blockquote>\n<p>What's the main difference between <code>Array.map()</code> and <code>Array.foreach()</code><br />\na) Map returns a new array, foreach doesn't<br />\nb) Foreach is faster than map<br />\nc) Map only works with numeric values<br />\nd) There is no difference</p>\n</blockquote>\n<p>This feels like a very JavaScript question... Sure, <code>map</code> is a generic kind of operation, but <code>foreach</code> and the kinds of answers are just assuming JS.</p>\n<p>Another question in Computer Science was &quot;What's the output of this code?&quot;:</p>\n<pre><code class=\"hljs language-typescript\"><span class=\"hljs-keyword\">const</span> p = <span class=\"hljs-keyword\">new</span> <span class=\"hljs-title class_\">Promise</span>(\n    <span class=\"hljs-function\">(<span class=\"hljs-params\">resolve, reject</span>) =&gt;</span> {\n        <span class=\"hljs-title function_\">resolve</span>(<span class=\"hljs-number\">1</span>);\n        <span class=\"hljs-title function_\">resolve</span>(<span class=\"hljs-number\">2</span>);\n        <span class=\"hljs-title function_\">reject</span>(<span class=\"hljs-number\">3</span>);\n    }\n);\n\np.<span class=\"hljs-title function_\">then</span>(<span class=\"hljs-variable language_\">console</span>.<span class=\"hljs-property\">log</span>).<span class=\"hljs-title function_\">catch</span>(<span class=\"hljs-variable language_\">console</span>.<span class=\"hljs-property\">log</span>);\n</code></pre><p>But how is this computer science? Perhaps this is an example of shifting notions I was talking about. &quot;Pure JS&quot;, as well as abstract logic of resolution of non-trivial promises in TypeScript is such a niche, low-level concept, that it's treated as the science of computation.</p>\n<p>The question is presented on the screen in form of a screenshot from JetBrains IDE:</p>\n<p><img alt=\"\" src=\"https://img.exotext.com/1/blyg4YG5F6_FJEXkC2VeA.png\" /></p>\n<p>Notice the hints in grey boxes: they are not part of the code, but a feature of the IDE. So we aren't even looking at code, we're looking at its enhanced representation. </p>\n<p>One can argue that any programming is computer science, and yes, sure, but by this logic the topic shouldn't even be among the categories. Web standards is also computer science. It's a game show for <del>web-developers</del> <del>developers</del> computer scientists.</p>\n<p>Another Computer Science question was:</p>\n<blockquote>\n<p>Which method removes and returns the last element of an array?</p>\n</blockquote>\n<p>I mean, sure, this is a fun game show where people eat spicy food for entertainment. It's probably not representative of job interviews or the way people think about programming. But I don't know, maybe it is? Again, I'm not bashing them for making it, nor am I trying to be the &quot;um, ackchyually&quot; guy. These are anthropological observations if you will. </p>\n<p>I've always felt safety in coding. It was a comfortably logical, deterministic, and beautifully consistent refuge from the world of vague and ambagious reality. I also felt certain kinship to other programmers, it was my tribe. So I'm worried about this feeling of disconnect, a little bit. I don't want to become an old man yelling at cloud. What worries me even more is that when I see a similar sentiment in comments (HN, Reddit, etc.) and blogs, very often it goes way overboard, and I feel a disconnect toward that side, too. Someone would grumpily bash &quot;stupid JS frameworks&quot; and &quot;bootcamp devs&quot;, while religiously proclaiming how everybody should just use bash and vim, or something. </p>\n<p>It's all pretty fascinating.</p>\n<hr />\n<p>Discussions:</p>\n<ul>\n<li><a href=\"https://news.ycombinator.com/item?id=42461264\">Hackernews</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=oNjfXnhq0UM\">YouTube</a></li>\n<li><a href=\"https://lobste.rs/s/7cbbsv/how_do_you_do_fellow_web_developers\">Lobste.rs</a></li>\n<li><a href=\"https://www.reddit.com/r/programming/comments/1hifo83/how_do_you_do_fellow_web_developers_a_growing/\">Reddit</a></li>\n<li><a href=\"https://tildes.net/~comp/1kws\">Tildes</a></li>\n<li><a href=\"https://lemmy.kde.social/post/2565623\">KDE Social</a></li>\n</ul>",
  "id": "https://rakhim.exotext.com/web-developers-a-growing-disconnect"
}